arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/******************************************************************************
* EUSCI_A0 Registers
******************************************************************************/
#define UCA0CTLW0                                (HWREG16(0x40001000))           /**< eUSCI_Ax Control Word Register 0 */
#define UCA0CTLW0_SPI                            (HWREG16(0x40001000))           /**< eUSCI_Ax Control Word Register 0 */
#define UCA0CTLW1                                (HWREG16(0x40001002))           /**< eUSCI_Ax Control Word Register 1 */
#define UCA0BRW                                  (HWREG16(0x40001006))           /**< eUSCI_Ax Baud Rate Control Word Register */
#define UCA0BRW_SPI                              (HWREG16(0x40001006))           /**< eUSCI_Ax Bit Rate Control Register 1 */
#define UCA0MCTLW                                (HWREG16(0x40001008))           /**< eUSCI_Ax Modulation Control Word Register */
#define UCA0STATW                                (HWREG16(0x4000100A))           /**< eUSCI_Ax Status Register */
#define UCA0STATW_SPI                            (HWREG16(0x4000100A))
#define UCA0RXBUF                                (HWREG16(0x4000100C))           /**< eUSCI_Ax Receive Buffer Register */
#define UCA0RXBUF_SPI                            (HWREG16(0x4000100C))           /**< eUSCI_Ax Receive Buffer Register */
#define UCA0TXBUF                                (HWREG16(0x4000100E))           /**< eUSCI_Ax Transmit Buffer Register */
#define UCA0TXBUF_SPI                            (HWREG16(0x4000100E))           /**< eUSCI_Ax Transmit Buffer Register */
#define UCA0ABCTL                                (HWREG16(0x40001010))           /**< eUSCI_Ax Auto Baud Rate Control Register */
#define UCA0IRCTL                                (HWREG16(0x40001012))           /**< eUSCI_Ax IrDA Control Word Register */
#define UCA0IE                                   (HWREG16(0x4000101A))           /**< eUSCI_Ax Interrupt Enable Register */
#define UCA0IE_SPI                               (HWREG16(0x4000101A))           /**< eUSCI_Ax Interrupt Enable Register */
#define UCA0IFG                                  (HWREG16(0x4000101C))           /**< eUSCI_Ax Interrupt Flag Register */
#define UCA0IFG_SPI                              (HWREG16(0x4000101C))           /**< eUSCI_Ax Interrupt Flag Register */
#define UCA0IV                                   (HWREG16(0x4000101E))           /**< eUSCI_Ax Interrupt Vector Register */
#define UCA0IV_SPI                               (HWREG16(0x4000101E))           /**< eUSCI_Ax Interrupt Vector Register */

/* Register offsets from EUSCI_A0_BASE address */
#define OFS_UCA0CTLW0                                      (0x0000)              /**< eUSCI_Ax Control Word Register 0 */
#define OFS_UCA0CTLW0_SPI                                  (0x0000)              /**< eUSCI_Ax Control Word Register 0 */
#define OFS_UCA0CTLW1                                      (0x0002)              /**< eUSCI_Ax Control Word Register 1 */
#define OFS_UCA0BRW                                        (0x0006)              /**< eUSCI_Ax Baud Rate Control Word Register */
#define OFS_UCA0BRW_SPI                                    (0x0006)              /**< eUSCI_Ax Bit Rate Control Register 1 */
#define OFS_UCA0MCTLW                                      (0x0008)              /**< eUSCI_Ax Modulation Control Word Register */
#define OFS_UCA0STATW                                      (0x000a)              /**< eUSCI_Ax Status Register */
#define OFS_UCA0STATW_SPI                                  (0x000a)
#define OFS_UCA0RXBUF                                      (0x000c)              /**< eUSCI_Ax Receive Buffer Register */
#define OFS_UCA0RXBUF_SPI                                  (0x000c)              /**< eUSCI_Ax Receive Buffer Register */
#define OFS_UCA0TXBUF                                      (0x000e)              /**< eUSCI_Ax Transmit Buffer Register */
#define OFS_UCA0TXBUF_SPI                                  (0x000e)              /**< eUSCI_Ax Transmit Buffer Register */
#define OFS_UCA0ABCTL                                      (0x0010)              /**< eUSCI_Ax Auto Baud Rate Control Register */
#define OFS_UCA0IRCTL                                      (0x0012)              /**< eUSCI_Ax IrDA Control Word Register */
#define OFS_UCA0IE                                         (0x001a)              /**< eUSCI_Ax Interrupt Enable Register */
#define OFS_UCA0IE_SPI                                     (0x001a)              /**< eUSCI_Ax Interrupt Enable Register */
#define OFS_UCA0IFG                                        (0x001c)              /**< eUSCI_Ax Interrupt Flag Register */
#define OFS_UCA0IFG_SPI                                    (0x001c)              /**< eUSCI_Ax Interrupt Flag Register */
#define OFS_UCA0IV                                         (0x001e)              /**< eUSCI_Ax Interrupt Vector Register */
#define OFS_UCA0IV_SPI                                     (0x001e)              /**< eUSCI_Ax Interrupt Vector Register */

#define UCA0CTL0                                           (HWREG8_L(UCA0CTLW0)) /* eUSCI_Ax Control 0 */
#define UCA0CTL1                                           (HWREG8_H(UCA0CTLW0)) /* eUSCI_Ax Control 1 */
#define UCA0BR0                                            (HWREG8_L(UCA0BRW))   /* eUSCI_Ax Baud Rate Control 0 */
#define UCA0BR1                                            (HWREG8_H(UCA0BRW))   /* eUSCI_Ax Baud Rate Control 1 */
#define UCA0IRTCTL                                         (HWREG8_L(UCA0IRCTL)) /* eUSCI_Ax IrDA Transmit Control */
#define UCA0IRRCTL                                         (HWREG8_H(UCA0IRCTL)) /* eUSCI_Ax IrDA Receive Control */

/******************************************************************************
* EUSCI_A1 Registers
******************************************************************************/
#define UCA1CTLW0                                (HWREG16(0x40001400))           /**< eUSCI_Ax Control Word Register 0 */
#define UCA1CTLW0_SPI                            (HWREG16(0x40001400))           /**< eUSCI_Ax Control Word Register 0 */
#define UCA1CTLW1                                (HWREG16(0x40001402))           /**< eUSCI_Ax Control Word Register 1 */
#define UCA1BRW                                  (HWREG16(0x40001406))           /**< eUSCI_Ax Baud Rate Control Word Register */
#define UCA1BRW_SPI                              (HWREG16(0x40001406))           /**< eUSCI_Ax Bit Rate Control Register 1 */
#define UCA1MCTLW                                (HWREG16(0x40001408))           /**< eUSCI_Ax Modulation Control Word Register */
#define UCA1STATW                                (HWREG16(0x4000140A))           /**< eUSCI_Ax Status Register */
#define UCA1STATW_SPI                            (HWREG16(0x4000140A))
#define UCA1RXBUF                                (HWREG16(0x4000140C))           /**< eUSCI_Ax Receive Buffer Register */
#define UCA1RXBUF_SPI                            (HWREG16(0x4000140C))           /**< eUSCI_Ax Receive Buffer Register */
#define UCA1TXBUF                                (HWREG16(0x4000140E))           /**< eUSCI_Ax Transmit Buffer Register */
#define UCA1TXBUF_SPI                            (HWREG16(0x4000140E))           /**< eUSCI_Ax Transmit Buffer Register */
#define UCA1ABCTL                                (HWREG16(0x40001410))           /**< eUSCI_Ax Auto Baud Rate Control Register */
#define UCA1IRCTL                                (HWREG16(0x40001412))           /**< eUSCI_Ax IrDA Control Word Register */
#define UCA1IE                                   (HWREG16(0x4000141A))           /**< eUSCI_Ax Interrupt Enable Register */
#define UCA1IE_SPI                               (HWREG16(0x4000141A))           /**< eUSCI_Ax Interrupt Enable Register */
#define UCA1IFG                                  (HWREG16(0x4000141C))           /**< eUSCI_Ax Interrupt Flag Register */
#define UCA1IFG_SPI                              (HWREG16(0x4000141C))           /**< eUSCI_Ax Interrupt Flag Register */
#define UCA1IV                                   (HWREG16(0x4000141E))           /**< eUSCI_Ax Interrupt Vector Register */
#define UCA1IV_SPI                               (HWREG16(0x4000141E))           /**< eUSCI_Ax Interrupt Vector Register */

/* Register offsets from EUSCI_A1_BASE address */
#define OFS_UCA1CTLW0                                      (0x0000)              /**< eUSCI_Ax Control Word Register 0 */
#define OFS_UCA1CTLW0_SPI                                  (0x0000)              /**< eUSCI_Ax Control Word Register 0 */
#define OFS_UCA1CTLW1                                      (0x0002)              /**< eUSCI_Ax Control Word Register 1 */
#define OFS_UCA1BRW                                        (0x0006)              /**< eUSCI_Ax Baud Rate Control Word Register */
#define OFS_UCA1BRW_SPI                                    (0x0006)              /**< eUSCI_Ax Bit Rate Control Register 1 */
#define OFS_UCA1MCTLW                                      (0x0008)              /**< eUSCI_Ax Modulation Control Word Register */
#define OFS_UCA1STATW                                      (0x000a)              /**< eUSCI_Ax Status Register */
#define OFS_UCA1STATW_SPI                                  (0x000a)
#define OFS_UCA1RXBUF                                      (0x000c)              /**< eUSCI_Ax Receive Buffer Register */
#define OFS_UCA1RXBUF_SPI                                  (0x000c)              /**< eUSCI_Ax Receive Buffer Register */
#define OFS_UCA1TXBUF                                      (0x000e)              /**< eUSCI_Ax Transmit Buffer Register */
#define OFS_UCA1TXBUF_SPI                                  (0x000e)              /**< eUSCI_Ax Transmit Buffer Register */
#define OFS_UCA1ABCTL                                      (0x0010)              /**< eUSCI_Ax Auto Baud Rate Control Register */
#define OFS_UCA1IRCTL                                      (0x0012)              /**< eUSCI_Ax IrDA Control Word Register */
#define OFS_UCA1IE                                         (0x001a)              /**< eUSCI_Ax Interrupt Enable Register */
#define OFS_UCA1IE_SPI                                     (0x001a)              /**< eUSCI_Ax Interrupt Enable Register */
#define OFS_UCA1IFG                                        (0x001c)              /**< eUSCI_Ax Interrupt Flag Register */
#define OFS_UCA1IFG_SPI                                    (0x001c)              /**< eUSCI_Ax Interrupt Flag Register */
#define OFS_UCA1IV                                         (0x001e)              /**< eUSCI_Ax Interrupt Vector Register */
#define OFS_UCA1IV_SPI                                     (0x001e)              /**< eUSCI_Ax Interrupt Vector Register */

