arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
#define UCA1CTL0                                           (HWREG8_L(UCA1CTLW0)) /* eUSCI_Ax Control 0 */
#define UCA1CTL1                                           (HWREG8_H(UCA1CTLW0)) /* eUSCI_Ax Control 1 */
#define UCA1BR0                                            (HWREG8_L(UCA1BRW))   /* eUSCI_Ax Baud Rate Control 0 */
#define UCA1BR1                                            (HWREG8_H(UCA1BRW))   /* eUSCI_Ax Baud Rate Control 1 */
#define UCA1IRTCTL                                         (HWREG8_L(UCA1IRCTL)) /* eUSCI_Ax IrDA Transmit Control */
#define UCA1IRRCTL                                         (HWREG8_H(UCA1IRCTL)) /* eUSCI_Ax IrDA Receive Control */

/******************************************************************************
* EUSCI_A2 Registers
******************************************************************************/
#define UCA2CTLW0                                (HWREG16(0x40001800))           /**< eUSCI_Ax Control Word Register 0 */
#define UCA2CTLW0_SPI                            (HWREG16(0x40001800))           /**< eUSCI_Ax Control Word Register 0 */
#define UCA2CTLW1                                (HWREG16(0x40001802))           /**< eUSCI_Ax Control Word Register 1 */
#define UCA2BRW                                  (HWREG16(0x40001806))           /**< eUSCI_Ax Baud Rate Control Word Register */
#define UCA2BRW_SPI                              (HWREG16(0x40001806))           /**< eUSCI_Ax Bit Rate Control Register 1 */
#define UCA2MCTLW                                (HWREG16(0x40001808))           /**< eUSCI_Ax Modulation Control Word Register */
#define UCA2STATW                                (HWREG16(0x4000180A))           /**< eUSCI_Ax Status Register */
#define UCA2STATW_SPI                            (HWREG16(0x4000180A))
#define UCA2RXBUF                                (HWREG16(0x4000180C))           /**< eUSCI_Ax Receive Buffer Register */
#define UCA2RXBUF_SPI                            (HWREG16(0x4000180C))           /**< eUSCI_Ax Receive Buffer Register */
#define UCA2TXBUF                                (HWREG16(0x4000180E))           /**< eUSCI_Ax Transmit Buffer Register */
#define UCA2TXBUF_SPI                            (HWREG16(0x4000180E))           /**< eUSCI_Ax Transmit Buffer Register */
#define UCA2ABCTL                                (HWREG16(0x40001810))           /**< eUSCI_Ax Auto Baud Rate Control Register */
#define UCA2IRCTL                                (HWREG16(0x40001812))           /**< eUSCI_Ax IrDA Control Word Register */
#define UCA2IE                                   (HWREG16(0x4000181A))           /**< eUSCI_Ax Interrupt Enable Register */
#define UCA2IE_SPI                               (HWREG16(0x4000181A))           /**< eUSCI_Ax Interrupt Enable Register */
#define UCA2IFG                                  (HWREG16(0x4000181C))           /**< eUSCI_Ax Interrupt Flag Register */
#define UCA2IFG_SPI                              (HWREG16(0x4000181C))           /**< eUSCI_Ax Interrupt Flag Register */
#define UCA2IV                                   (HWREG16(0x4000181E))           /**< eUSCI_Ax Interrupt Vector Register */
#define UCA2IV_SPI                               (HWREG16(0x4000181E))           /**< eUSCI_Ax Interrupt Vector Register */

/* Register offsets from EUSCI_A2_BASE address */
#define OFS_UCA2CTLW0                                      (0x0000)              /**< eUSCI_Ax Control Word Register 0 */
#define OFS_UCA2CTLW0_SPI                                  (0x0000)              /**< eUSCI_Ax Control Word Register 0 */
#define OFS_UCA2CTLW1                                      (0x0002)              /**< eUSCI_Ax Control Word Register 1 */
#define OFS_UCA2BRW                                        (0x0006)              /**< eUSCI_Ax Baud Rate Control Word Register */
#define OFS_UCA2BRW_SPI                                    (0x0006)              /**< eUSCI_Ax Bit Rate Control Register 1 */
#define OFS_UCA2MCTLW                                      (0x0008)              /**< eUSCI_Ax Modulation Control Word Register */
#define OFS_UCA2STATW                                      (0x000a)              /**< eUSCI_Ax Status Register */
#define OFS_UCA2STATW_SPI                                  (0x000a)
#define OFS_UCA2RXBUF                                      (0x000c)              /**< eUSCI_Ax Receive Buffer Register */
#define OFS_UCA2RXBUF_SPI                                  (0x000c)              /**< eUSCI_Ax Receive Buffer Register */
#define OFS_UCA2TXBUF                                      (0x000e)              /**< eUSCI_Ax Transmit Buffer Register */
#define OFS_UCA2TXBUF_SPI                                  (0x000e)              /**< eUSCI_Ax Transmit Buffer Register */
#define OFS_UCA2ABCTL                                      (0x0010)              /**< eUSCI_Ax Auto Baud Rate Control Register */
#define OFS_UCA2IRCTL                                      (0x0012)              /**< eUSCI_Ax IrDA Control Word Register */
#define OFS_UCA2IE                                         (0x001a)              /**< eUSCI_Ax Interrupt Enable Register */
#define OFS_UCA2IE_SPI                                     (0x001a)              /**< eUSCI_Ax Interrupt Enable Register */
#define OFS_UCA2IFG                                        (0x001c)              /**< eUSCI_Ax Interrupt Flag Register */
#define OFS_UCA2IFG_SPI                                    (0x001c)              /**< eUSCI_Ax Interrupt Flag Register */
#define OFS_UCA2IV                                         (0x001e)              /**< eUSCI_Ax Interrupt Vector Register */
#define OFS_UCA2IV_SPI                                     (0x001e)              /**< eUSCI_Ax Interrupt Vector Register */

#define UCA2CTL0                                           (HWREG8_L(UCA2CTLW0)) /* eUSCI_Ax Control 0 */
#define UCA2CTL1                                           (HWREG8_H(UCA2CTLW0)) /* eUSCI_Ax Control 1 */
#define UCA2BR0                                            (HWREG8_L(UCA2BRW))   /* eUSCI_Ax Baud Rate Control 0 */
#define UCA2BR1                                            (HWREG8_H(UCA2BRW))   /* eUSCI_Ax Baud Rate Control 1 */
#define UCA2IRTCTL                                         (HWREG8_L(UCA2IRCTL)) /* eUSCI_Ax IrDA Transmit Control */
#define UCA2IRRCTL                                         (HWREG8_H(UCA2IRCTL)) /* eUSCI_Ax IrDA Receive Control */

