arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/******************************************************************************
* EUSCI_A3 Registers
******************************************************************************/
#define UCA3CTLW0                                (HWREG16(0x40001C00))           /**< eUSCI_Ax Control Word Register 0 */
#define UCA3CTLW0_SPI                            (HWREG16(0x40001C00))           /**< eUSCI_Ax Control Word Register 0 */
#define UCA3CTLW1                                (HWREG16(0x40001C02))           /**< eUSCI_Ax Control Word Register 1 */
#define UCA3BRW                                  (HWREG16(0x40001C06))           /**< eUSCI_Ax Baud Rate Control Word Register */
#define UCA3BRW_SPI                              (HWREG16(0x40001C06))           /**< eUSCI_Ax Bit Rate Control Register 1 */
#define UCA3MCTLW                                (HWREG16(0x40001C08))           /**< eUSCI_Ax Modulation Control Word Register */
#define UCA3STATW                                (HWREG16(0x40001C0A))           /**< eUSCI_Ax Status Register */
#define UCA3STATW_SPI                            (HWREG16(0x40001C0A))
#define UCA3RXBUF                                (HWREG16(0x40001C0C))           /**< eUSCI_Ax Receive Buffer Register */
#define UCA3RXBUF_SPI                            (HWREG16(0x40001C0C))           /**< eUSCI_Ax Receive Buffer Register */
#define UCA3TXBUF                                (HWREG16(0x40001C0E))           /**< eUSCI_Ax Transmit Buffer Register */
#define UCA3TXBUF_SPI                            (HWREG16(0x40001C0E))           /**< eUSCI_Ax Transmit Buffer Register */
#define UCA3ABCTL                                (HWREG16(0x40001C10))           /**< eUSCI_Ax Auto Baud Rate Control Register */
#define UCA3IRCTL                                (HWREG16(0x40001C12))           /**< eUSCI_Ax IrDA Control Word Register */
#define UCA3IE                                   (HWREG16(0x40001C1A))           /**< eUSCI_Ax Interrupt Enable Register */
#define UCA3IE_SPI                               (HWREG16(0x40001C1A))           /**< eUSCI_Ax Interrupt Enable Register */
#define UCA3IFG                                  (HWREG16(0x40001C1C))           /**< eUSCI_Ax Interrupt Flag Register */
#define UCA3IFG_SPI                              (HWREG16(0x40001C1C))           /**< eUSCI_Ax Interrupt Flag Register */
#define UCA3IV                                   (HWREG16(0x40001C1E))           /**< eUSCI_Ax Interrupt Vector Register */
#define UCA3IV_SPI                               (HWREG16(0x40001C1E))           /**< eUSCI_Ax Interrupt Vector Register */

/* Register offsets from EUSCI_A3_BASE address */
#define OFS_UCA3CTLW0                                      (0x0000)              /**< eUSCI_Ax Control Word Register 0 */
#define OFS_UCA3CTLW0_SPI                                  (0x0000)              /**< eUSCI_Ax Control Word Register 0 */
#define OFS_UCA3CTLW1                                      (0x0002)              /**< eUSCI_Ax Control Word Register 1 */
#define OFS_UCA3BRW                                        (0x0006)              /**< eUSCI_Ax Baud Rate Control Word Register */
#define OFS_UCA3BRW_SPI                                    (0x0006)              /**< eUSCI_Ax Bit Rate Control Register 1 */
#define OFS_UCA3MCTLW                                      (0x0008)              /**< eUSCI_Ax Modulation Control Word Register */
#define OFS_UCA3STATW                                      (0x000a)              /**< eUSCI_Ax Status Register */
#define OFS_UCA3STATW_SPI                                  (0x000a)
#define OFS_UCA3RXBUF                                      (0x000c)              /**< eUSCI_Ax Receive Buffer Register */
#define OFS_UCA3RXBUF_SPI                                  (0x000c)              /**< eUSCI_Ax Receive Buffer Register */
#define OFS_UCA3TXBUF                                      (0x000e)              /**< eUSCI_Ax Transmit Buffer Register */
#define OFS_UCA3TXBUF_SPI                                  (0x000e)              /**< eUSCI_Ax Transmit Buffer Register */
#define OFS_UCA3ABCTL                                      (0x0010)              /**< eUSCI_Ax Auto Baud Rate Control Register */
#define OFS_UCA3IRCTL                                      (0x0012)              /**< eUSCI_Ax IrDA Control Word Register */
#define OFS_UCA3IE                                         (0x001a)              /**< eUSCI_Ax Interrupt Enable Register */
#define OFS_UCA3IE_SPI                                     (0x001a)              /**< eUSCI_Ax Interrupt Enable Register */
#define OFS_UCA3IFG                                        (0x001c)              /**< eUSCI_Ax Interrupt Flag Register */
#define OFS_UCA3IFG_SPI                                    (0x001c)              /**< eUSCI_Ax Interrupt Flag Register */
#define OFS_UCA3IV                                         (0x001e)              /**< eUSCI_Ax Interrupt Vector Register */
#define OFS_UCA3IV_SPI                                     (0x001e)              /**< eUSCI_Ax Interrupt Vector Register */

#define UCA3CTL0                                           (HWREG8_L(UCA3CTLW0)) /* eUSCI_Ax Control 0 */
#define UCA3CTL1                                           (HWREG8_H(UCA3CTLW0)) /* eUSCI_Ax Control 1 */
#define UCA3BR0                                            (HWREG8_L(UCA3BRW))   /* eUSCI_Ax Baud Rate Control 0 */
#define UCA3BR1                                            (HWREG8_H(UCA3BRW))   /* eUSCI_Ax Baud Rate Control 1 */
#define UCA3IRTCTL                                         (HWREG8_L(UCA3IRCTL)) /* eUSCI_Ax IrDA Transmit Control */
#define UCA3IRRCTL                                         (HWREG8_H(UCA3IRCTL)) /* eUSCI_Ax IrDA Receive Control */

/******************************************************************************
* EUSCI_B0 Registers
******************************************************************************/
#define UCB0CTLW0                                (HWREG16(0x40002000))           /**< eUSCI_Bx Control Word Register 0 */
#define UCB0CTLW0_SPI                            (HWREG16(0x40002000))           /**< eUSCI_Bx Control Word Register 0 */
#define UCB0CTLW1                                (HWREG16(0x40002002))           /**< eUSCI_Bx Control Word Register 1 */
#define UCB0BRW                                  (HWREG16(0x40002006))           /**< eUSCI_Bx Baud Rate Control Word Register */
#define UCB0BRW_SPI                              (HWREG16(0x40002006))           /**< eUSCI_Bx Bit Rate Control Register 1 */
#define UCB0STATW                                (HWREG16(0x40002008))           /**< eUSCI_Bx Status Register */
#define UCB0STATW_SPI                            (HWREG16(0x40002008))
#define UCB0TBCNT                                (HWREG16(0x4000200A))           /**< eUSCI_Bx Byte Counter Threshold Register */
#define UCB0RXBUF                                (HWREG16(0x4000200C))           /**< eUSCI_Bx Receive Buffer Register */
#define UCB0RXBUF_SPI                            (HWREG16(0x4000200C))           /**< eUSCI_Bx Receive Buffer Register */
#define UCB0TXBUF                                (HWREG16(0x4000200E))           /**< eUSCI_Bx Transmit Buffer Register */
#define UCB0TXBUF_SPI                            (HWREG16(0x4000200E))           /**< eUSCI_Bx Transmit Buffer Register */
#define UCB0I2COA0                               (HWREG16(0x40002014))           /**< eUSCI_Bx I2C Own Address 0 Register */
#define UCB0I2COA1                               (HWREG16(0x40002016))           /**< eUSCI_Bx I2C Own Address 1 Register */
#define UCB0I2COA2                               (HWREG16(0x40002018))           /**< eUSCI_Bx I2C Own Address 2 Register */
#define UCB0I2COA3                               (HWREG16(0x4000201A))           /**< eUSCI_Bx I2C Own Address 3 Register */
#define UCB0ADDRX                                (HWREG16(0x4000201C))           /**< eUSCI_Bx I2C Received Address Register */
#define UCB0ADDMASK                              (HWREG16(0x4000201E))           /**< eUSCI_Bx I2C Address Mask Register */
#define UCB0I2CSA                                (HWREG16(0x40002020))           /**< eUSCI_Bx I2C Slave Address Register */
#define UCB0IE                                   (HWREG16(0x4000202A))           /**< eUSCI_Bx Interrupt Enable Register */
#define UCB0IE_SPI                               (HWREG16(0x4000202A))           /**< eUSCI_Bx Interrupt Enable Register */
#define UCB0IFG                                  (HWREG16(0x4000202C))           /**< eUSCI_Bx Interrupt Flag Register */
#define UCB0IFG_SPI                              (HWREG16(0x4000202C))           /**< eUSCI_Bx Interrupt Flag Register */
#define UCB0IV                                   (HWREG16(0x4000202E))           /**< eUSCI_Bx Interrupt Vector Register */
#define UCB0IV_SPI                               (HWREG16(0x4000202E))           /**< eUSCI_Bx Interrupt Vector Register */

