arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/* Register offsets from EUSCI_B0_BASE address */
#define OFS_UCB0CTLW0                                      (0x0000)              /**< eUSCI_Bx Control Word Register 0 */
#define OFS_UCB0CTLW0_SPI                                  (0x0000)              /**< eUSCI_Bx Control Word Register 0 */
#define OFS_UCB0CTLW1                                      (0x0002)              /**< eUSCI_Bx Control Word Register 1 */
#define OFS_UCB0BRW                                        (0x0006)              /**< eUSCI_Bx Baud Rate Control Word Register */
#define OFS_UCB0BRW_SPI                                    (0x0006)              /**< eUSCI_Bx Bit Rate Control Register 1 */
#define OFS_UCB0STATW                                      (0x0008)              /**< eUSCI_Bx Status Register */
#define OFS_UCB0STATW_SPI                                  (0x0008)
#define OFS_UCB0TBCNT                                      (0x000a)              /**< eUSCI_Bx Byte Counter Threshold Register */
#define OFS_UCB0RXBUF                                      (0x000c)              /**< eUSCI_Bx Receive Buffer Register */
#define OFS_UCB0RXBUF_SPI                                  (0x000c)              /**< eUSCI_Bx Receive Buffer Register */
#define OFS_UCB0TXBUF                                      (0x000e)              /**< eUSCI_Bx Transmit Buffer Register */
#define OFS_UCB0TXBUF_SPI                                  (0x000e)              /**< eUSCI_Bx Transmit Buffer Register */
#define OFS_UCB0I2COA0                                     (0x0014)              /**< eUSCI_Bx I2C Own Address 0 Register */
#define OFS_UCB0I2COA1                                     (0x0016)              /**< eUSCI_Bx I2C Own Address 1 Register */
#define OFS_UCB0I2COA2                                     (0x0018)              /**< eUSCI_Bx I2C Own Address 2 Register */
#define OFS_UCB0I2COA3                                     (0x001a)              /**< eUSCI_Bx I2C Own Address 3 Register */
#define OFS_UCB0ADDRX                                      (0x001c)              /**< eUSCI_Bx I2C Received Address Register */
#define OFS_UCB0ADDMASK                                    (0x001e)              /**< eUSCI_Bx I2C Address Mask Register */
#define OFS_UCB0I2CSA                                      (0x0020)              /**< eUSCI_Bx I2C Slave Address Register */
#define OFS_UCB0IE                                         (0x002a)              /**< eUSCI_Bx Interrupt Enable Register */
#define OFS_UCB0IE_SPI                                     (0x002a)              /**< eUSCI_Bx Interrupt Enable Register */
#define OFS_UCB0IFG                                        (0x002c)              /**< eUSCI_Bx Interrupt Flag Register */
#define OFS_UCB0IFG_SPI                                    (0x002c)              /**< eUSCI_Bx Interrupt Flag Register */
#define OFS_UCB0IV                                         (0x002e)              /**< eUSCI_Bx Interrupt Vector Register */
#define OFS_UCB0IV_SPI                                     (0x002e)              /**< eUSCI_Bx Interrupt Vector Register */

#define UCB0CTL0                                           (HWREG8_L(UCB0CTLW0)) /* eUSCI_Bx Control 1 */
#define UCB0CTL1                                           (HWREG8_H(UCB0CTLW0)) /* eUSCI_Bx Control 0 */
#define UCB0BR0                                            (HWREG8_L(UCB0BRW))   /* eUSCI_Bx Bit Rate Control 0 */
#define UCB0BR1                                            (HWREG8_H(UCB0BRW))   /* eUSCI_Bx Bit Rate Control 1 */
#define UCB0STAT                                           (HWREG8_L(UCB0STATW)) /* eUSCI_Bx Status */
#define UCB0BCNT                                           (HWREG8_H(UCB0STATW)) /* eUSCI_Bx Byte Counter Register */

/******************************************************************************
* EUSCI_B1 Registers
******************************************************************************/
#define UCB1CTLW0                                (HWREG16(0x40002400))           /**< eUSCI_Bx Control Word Register 0 */
#define UCB1CTLW0_SPI                            (HWREG16(0x40002400))           /**< eUSCI_Bx Control Word Register 0 */
#define UCB1CTLW1                                (HWREG16(0x40002402))           /**< eUSCI_Bx Control Word Register 1 */
#define UCB1BRW                                  (HWREG16(0x40002406))           /**< eUSCI_Bx Baud Rate Control Word Register */
#define UCB1BRW_SPI                              (HWREG16(0x40002406))           /**< eUSCI_Bx Bit Rate Control Register 1 */
#define UCB1STATW                                (HWREG16(0x40002408))           /**< eUSCI_Bx Status Register */
#define UCB1STATW_SPI                            (HWREG16(0x40002408))
#define UCB1TBCNT                                (HWREG16(0x4000240A))           /**< eUSCI_Bx Byte Counter Threshold Register */
#define UCB1RXBUF                                (HWREG16(0x4000240C))           /**< eUSCI_Bx Receive Buffer Register */
#define UCB1RXBUF_SPI                            (HWREG16(0x4000240C))           /**< eUSCI_Bx Receive Buffer Register */
#define UCB1TXBUF                                (HWREG16(0x4000240E))           /**< eUSCI_Bx Transmit Buffer Register */
#define UCB1TXBUF_SPI                            (HWREG16(0x4000240E))           /**< eUSCI_Bx Transmit Buffer Register */
#define UCB1I2COA0                               (HWREG16(0x40002414))           /**< eUSCI_Bx I2C Own Address 0 Register */
#define UCB1I2COA1                               (HWREG16(0x40002416))           /**< eUSCI_Bx I2C Own Address 1 Register */
#define UCB1I2COA2                               (HWREG16(0x40002418))           /**< eUSCI_Bx I2C Own Address 2 Register */
#define UCB1I2COA3                               (HWREG16(0x4000241A))           /**< eUSCI_Bx I2C Own Address 3 Register */
#define UCB1ADDRX                                (HWREG16(0x4000241C))           /**< eUSCI_Bx I2C Received Address Register */
#define UCB1ADDMASK                              (HWREG16(0x4000241E))           /**< eUSCI_Bx I2C Address Mask Register */
#define UCB1I2CSA                                (HWREG16(0x40002420))           /**< eUSCI_Bx I2C Slave Address Register */
#define UCB1IE                                   (HWREG16(0x4000242A))           /**< eUSCI_Bx Interrupt Enable Register */
#define UCB1IE_SPI                               (HWREG16(0x4000242A))           /**< eUSCI_Bx Interrupt Enable Register */
#define UCB1IFG                                  (HWREG16(0x4000242C))           /**< eUSCI_Bx Interrupt Flag Register */
#define UCB1IFG_SPI                              (HWREG16(0x4000242C))           /**< eUSCI_Bx Interrupt Flag Register */
#define UCB1IV                                   (HWREG16(0x4000242E))           /**< eUSCI_Bx Interrupt Vector Register */
#define UCB1IV_SPI                               (HWREG16(0x4000242E))           /**< eUSCI_Bx Interrupt Vector Register */

/* Register offsets from EUSCI_B1_BASE address */
#define OFS_UCB1CTLW0                                      (0x0000)              /**< eUSCI_Bx Control Word Register 0 */
#define OFS_UCB1CTLW0_SPI                                  (0x0000)              /**< eUSCI_Bx Control Word Register 0 */
#define OFS_UCB1CTLW1                                      (0x0002)              /**< eUSCI_Bx Control Word Register 1 */
#define OFS_UCB1BRW                                        (0x0006)              /**< eUSCI_Bx Baud Rate Control Word Register */
#define OFS_UCB1BRW_SPI                                    (0x0006)              /**< eUSCI_Bx Bit Rate Control Register 1 */
#define OFS_UCB1STATW                                      (0x0008)              /**< eUSCI_Bx Status Register */
#define OFS_UCB1STATW_SPI                                  (0x0008)
#define OFS_UCB1TBCNT                                      (0x000a)              /**< eUSCI_Bx Byte Counter Threshold Register */
#define OFS_UCB1RXBUF                                      (0x000c)              /**< eUSCI_Bx Receive Buffer Register */
#define OFS_UCB1RXBUF_SPI                                  (0x000c)              /**< eUSCI_Bx Receive Buffer Register */
#define OFS_UCB1TXBUF                                      (0x000e)              /**< eUSCI_Bx Transmit Buffer Register */
#define OFS_UCB1TXBUF_SPI                                  (0x000e)              /**< eUSCI_Bx Transmit Buffer Register */
#define OFS_UCB1I2COA0                                     (0x0014)              /**< eUSCI_Bx I2C Own Address 0 Register */
#define OFS_UCB1I2COA1                                     (0x0016)              /**< eUSCI_Bx I2C Own Address 1 Register */
#define OFS_UCB1I2COA2                                     (0x0018)              /**< eUSCI_Bx I2C Own Address 2 Register */
#define OFS_UCB1I2COA3                                     (0x001a)              /**< eUSCI_Bx I2C Own Address 3 Register */
#define OFS_UCB1ADDRX                                      (0x001c)              /**< eUSCI_Bx I2C Received Address Register */
#define OFS_UCB1ADDMASK                                    (0x001e)              /**< eUSCI_Bx I2C Address Mask Register */
#define OFS_UCB1I2CSA                                      (0x0020)              /**< eUSCI_Bx I2C Slave Address Register */
#define OFS_UCB1IE                                         (0x002a)              /**< eUSCI_Bx Interrupt Enable Register */
#define OFS_UCB1IE_SPI                                     (0x002a)              /**< eUSCI_Bx Interrupt Enable Register */
#define OFS_UCB1IFG                                        (0x002c)              /**< eUSCI_Bx Interrupt Flag Register */
#define OFS_UCB1IFG_SPI                                    (0x002c)              /**< eUSCI_Bx Interrupt Flag Register */
#define OFS_UCB1IV                                         (0x002e)              /**< eUSCI_Bx Interrupt Vector Register */
#define OFS_UCB1IV_SPI                                     (0x002e)              /**< eUSCI_Bx Interrupt Vector Register */

#define UCB1CTL0                                           (HWREG8_L(UCB1CTLW0)) /* eUSCI_Bx Control 1 */
#define UCB1CTL1                                           (HWREG8_H(UCB1CTLW0)) /* eUSCI_Bx Control 0 */
#define UCB1BR0                                            (HWREG8_L(UCB1BRW))   /* eUSCI_Bx Bit Rate Control 0 */
#define UCB1BR1                                            (HWREG8_H(UCB1BRW))   /* eUSCI_Bx Bit Rate Control 1 */
#define UCB1STAT                                           (HWREG8_L(UCB1STATW)) /* eUSCI_Bx Status */
#define UCB1BCNT                                           (HWREG8_H(UCB1STATW)) /* eUSCI_Bx Byte Counter Register */

