arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/******************************************************************************
* EUSCI_B2 Registers
******************************************************************************/
#define UCB2CTLW0                                (HWREG16(0x40002800))           /**< eUSCI_Bx Control Word Register 0 */
#define UCB2CTLW0_SPI                            (HWREG16(0x40002800))           /**< eUSCI_Bx Control Word Register 0 */
#define UCB2CTLW1                                (HWREG16(0x40002802))           /**< eUSCI_Bx Control Word Register 1 */
#define UCB2BRW                                  (HWREG16(0x40002806))           /**< eUSCI_Bx Baud Rate Control Word Register */
#define UCB2BRW_SPI                              (HWREG16(0x40002806))           /**< eUSCI_Bx Bit Rate Control Register 1 */
#define UCB2STATW                                (HWREG16(0x40002808))           /**< eUSCI_Bx Status Register */
#define UCB2STATW_SPI                            (HWREG16(0x40002808))
#define UCB2TBCNT                                (HWREG16(0x4000280A))           /**< eUSCI_Bx Byte Counter Threshold Register */
#define UCB2RXBUF                                (HWREG16(0x4000280C))           /**< eUSCI_Bx Receive Buffer Register */
#define UCB2RXBUF_SPI                            (HWREG16(0x4000280C))           /**< eUSCI_Bx Receive Buffer Register */
#define UCB2TXBUF                                (HWREG16(0x4000280E))           /**< eUSCI_Bx Transmit Buffer Register */
#define UCB2TXBUF_SPI                            (HWREG16(0x4000280E))           /**< eUSCI_Bx Transmit Buffer Register */
#define UCB2I2COA0                               (HWREG16(0x40002814))           /**< eUSCI_Bx I2C Own Address 0 Register */
#define UCB2I2COA1                               (HWREG16(0x40002816))           /**< eUSCI_Bx I2C Own Address 1 Register */
#define UCB2I2COA2                               (HWREG16(0x40002818))           /**< eUSCI_Bx I2C Own Address 2 Register */
#define UCB2I2COA3                               (HWREG16(0x4000281A))           /**< eUSCI_Bx I2C Own Address 3 Register */
#define UCB2ADDRX                                (HWREG16(0x4000281C))           /**< eUSCI_Bx I2C Received Address Register */
#define UCB2ADDMASK                              (HWREG16(0x4000281E))           /**< eUSCI_Bx I2C Address Mask Register */
#define UCB2I2CSA                                (HWREG16(0x40002820))           /**< eUSCI_Bx I2C Slave Address Register */
#define UCB2IE                                   (HWREG16(0x4000282A))           /**< eUSCI_Bx Interrupt Enable Register */
#define UCB2IE_SPI                               (HWREG16(0x4000282A))           /**< eUSCI_Bx Interrupt Enable Register */
#define UCB2IFG                                  (HWREG16(0x4000282C))           /**< eUSCI_Bx Interrupt Flag Register */
#define UCB2IFG_SPI                              (HWREG16(0x4000282C))           /**< eUSCI_Bx Interrupt Flag Register */
#define UCB2IV                                   (HWREG16(0x4000282E))           /**< eUSCI_Bx Interrupt Vector Register */
#define UCB2IV_SPI                               (HWREG16(0x4000282E))           /**< eUSCI_Bx Interrupt Vector Register */

/* Register offsets from EUSCI_B2_BASE address */
#define OFS_UCB2CTLW0                                      (0x0000)              /**< eUSCI_Bx Control Word Register 0 */
#define OFS_UCB2CTLW0_SPI                                  (0x0000)              /**< eUSCI_Bx Control Word Register 0 */
#define OFS_UCB2CTLW1                                      (0x0002)              /**< eUSCI_Bx Control Word Register 1 */
#define OFS_UCB2BRW                                        (0x0006)              /**< eUSCI_Bx Baud Rate Control Word Register */
#define OFS_UCB2BRW_SPI                                    (0x0006)              /**< eUSCI_Bx Bit Rate Control Register 1 */
#define OFS_UCB2STATW                                      (0x0008)              /**< eUSCI_Bx Status Register */
#define OFS_UCB2STATW_SPI                                  (0x0008)
#define OFS_UCB2TBCNT                                      (0x000a)              /**< eUSCI_Bx Byte Counter Threshold Register */
#define OFS_UCB2RXBUF                                      (0x000c)              /**< eUSCI_Bx Receive Buffer Register */
#define OFS_UCB2RXBUF_SPI                                  (0x000c)              /**< eUSCI_Bx Receive Buffer Register */
#define OFS_UCB2TXBUF                                      (0x000e)              /**< eUSCI_Bx Transmit Buffer Register */
#define OFS_UCB2TXBUF_SPI                                  (0x000e)              /**< eUSCI_Bx Transmit Buffer Register */
#define OFS_UCB2I2COA0                                     (0x0014)              /**< eUSCI_Bx I2C Own Address 0 Register */
#define OFS_UCB2I2COA1                                     (0x0016)              /**< eUSCI_Bx I2C Own Address 1 Register */
#define OFS_UCB2I2COA2                                     (0x0018)              /**< eUSCI_Bx I2C Own Address 2 Register */
#define OFS_UCB2I2COA3                                     (0x001a)              /**< eUSCI_Bx I2C Own Address 3 Register */
#define OFS_UCB2ADDRX                                      (0x001c)              /**< eUSCI_Bx I2C Received Address Register */
#define OFS_UCB2ADDMASK                                    (0x001e)              /**< eUSCI_Bx I2C Address Mask Register */
#define OFS_UCB2I2CSA                                      (0x0020)              /**< eUSCI_Bx I2C Slave Address Register */
#define OFS_UCB2IE                                         (0x002a)              /**< eUSCI_Bx Interrupt Enable Register */
#define OFS_UCB2IE_SPI                                     (0x002a)              /**< eUSCI_Bx Interrupt Enable Register */
#define OFS_UCB2IFG                                        (0x002c)              /**< eUSCI_Bx Interrupt Flag Register */
#define OFS_UCB2IFG_SPI                                    (0x002c)              /**< eUSCI_Bx Interrupt Flag Register */
#define OFS_UCB2IV                                         (0x002e)              /**< eUSCI_Bx Interrupt Vector Register */
#define OFS_UCB2IV_SPI                                     (0x002e)              /**< eUSCI_Bx Interrupt Vector Register */

#define UCB2CTL0                                           (HWREG8_L(UCB2CTLW0)) /* eUSCI_Bx Control 1 */
#define UCB2CTL1                                           (HWREG8_H(UCB2CTLW0)) /* eUSCI_Bx Control 0 */
#define UCB2BR0                                            (HWREG8_L(UCB2BRW))   /* eUSCI_Bx Bit Rate Control 0 */
#define UCB2BR1                                            (HWREG8_H(UCB2BRW))   /* eUSCI_Bx Bit Rate Control 1 */
#define UCB2STAT                                           (HWREG8_L(UCB2STATW)) /* eUSCI_Bx Status */
#define UCB2BCNT                                           (HWREG8_H(UCB2STATW)) /* eUSCI_Bx Byte Counter Register */

