arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/******************************************************************************
* EUSCI_B3 Registers
******************************************************************************/
#define UCB3CTLW0                                (HWREG16(0x40002C00))           /**< eUSCI_Bx Control Word Register 0 */
#define UCB3CTLW0_SPI                            (HWREG16(0x40002C00))           /**< eUSCI_Bx Control Word Register 0 */
#define UCB3CTLW1                                (HWREG16(0x40002C02))           /**< eUSCI_Bx Control Word Register 1 */
#define UCB3BRW                                  (HWREG16(0x40002C06))           /**< eUSCI_Bx Baud Rate Control Word Register */
#define UCB3BRW_SPI                              (HWREG16(0x40002C06))           /**< eUSCI_Bx Bit Rate Control Register 1 */
#define UCB3STATW                                (HWREG16(0x40002C08))           /**< eUSCI_Bx Status Register */
#define UCB3STATW_SPI                            (HWREG16(0x40002C08))
#define UCB3TBCNT                                (HWREG16(0x40002C0A))           /**< eUSCI_Bx Byte Counter Threshold Register */
#define UCB3RXBUF                                (HWREG16(0x40002C0C))           /**< eUSCI_Bx Receive Buffer Register */
#define UCB3RXBUF_SPI                            (HWREG16(0x40002C0C))           /**< eUSCI_Bx Receive Buffer Register */
#define UCB3TXBUF                                (HWREG16(0x40002C0E))           /**< eUSCI_Bx Transmit Buffer Register */
#define UCB3TXBUF_SPI                            (HWREG16(0x40002C0E))           /**< eUSCI_Bx Transmit Buffer Register */
#define UCB3I2COA0                               (HWREG16(0x40002C14))           /**< eUSCI_Bx I2C Own Address 0 Register */
#define UCB3I2COA1                               (HWREG16(0x40002C16))           /**< eUSCI_Bx I2C Own Address 1 Register */
#define UCB3I2COA2                               (HWREG16(0x40002C18))           /**< eUSCI_Bx I2C Own Address 2 Register */
#define UCB3I2COA3                               (HWREG16(0x40002C1A))           /**< eUSCI_Bx I2C Own Address 3 Register */
#define UCB3ADDRX                                (HWREG16(0x40002C1C))           /**< eUSCI_Bx I2C Received Address Register */
#define UCB3ADDMASK                              (HWREG16(0x40002C1E))           /**< eUSCI_Bx I2C Address Mask Register */
#define UCB3I2CSA                                (HWREG16(0x40002C20))           /**< eUSCI_Bx I2C Slave Address Register */
#define UCB3IE                                   (HWREG16(0x40002C2A))           /**< eUSCI_Bx Interrupt Enable Register */
#define UCB3IE_SPI                               (HWREG16(0x40002C2A))           /**< eUSCI_Bx Interrupt Enable Register */
#define UCB3IFG                                  (HWREG16(0x40002C2C))           /**< eUSCI_Bx Interrupt Flag Register */
#define UCB3IFG_SPI                              (HWREG16(0x40002C2C))           /**< eUSCI_Bx Interrupt Flag Register */
#define UCB3IV                                   (HWREG16(0x40002C2E))           /**< eUSCI_Bx Interrupt Vector Register */
#define UCB3IV_SPI                               (HWREG16(0x40002C2E))           /**< eUSCI_Bx Interrupt Vector Register */

/* Register offsets from EUSCI_B3_BASE address */
#define OFS_UCB3CTLW0                                      (0x0000)              /**< eUSCI_Bx Control Word Register 0 */
#define OFS_UCB3CTLW0_SPI                                  (0x0000)              /**< eUSCI_Bx Control Word Register 0 */
#define OFS_UCB3CTLW1                                      (0x0002)              /**< eUSCI_Bx Control Word Register 1 */
#define OFS_UCB3BRW                                        (0x0006)              /**< eUSCI_Bx Baud Rate Control Word Register */
#define OFS_UCB3BRW_SPI                                    (0x0006)              /**< eUSCI_Bx Bit Rate Control Register 1 */
#define OFS_UCB3STATW                                      (0x0008)              /**< eUSCI_Bx Status Register */
#define OFS_UCB3STATW_SPI                                  (0x0008)
#define OFS_UCB3TBCNT                                      (0x000a)              /**< eUSCI_Bx Byte Counter Threshold Register */
#define OFS_UCB3RXBUF                                      (0x000c)              /**< eUSCI_Bx Receive Buffer Register */
#define OFS_UCB3RXBUF_SPI                                  (0x000c)              /**< eUSCI_Bx Receive Buffer Register */
#define OFS_UCB3TXBUF                                      (0x000e)              /**< eUSCI_Bx Transmit Buffer Register */
#define OFS_UCB3TXBUF_SPI                                  (0x000e)              /**< eUSCI_Bx Transmit Buffer Register */
#define OFS_UCB3I2COA0                                     (0x0014)              /**< eUSCI_Bx I2C Own Address 0 Register */
#define OFS_UCB3I2COA1                                     (0x0016)              /**< eUSCI_Bx I2C Own Address 1 Register */
#define OFS_UCB3I2COA2                                     (0x0018)              /**< eUSCI_Bx I2C Own Address 2 Register */
#define OFS_UCB3I2COA3                                     (0x001a)              /**< eUSCI_Bx I2C Own Address 3 Register */
#define OFS_UCB3ADDRX                                      (0x001c)              /**< eUSCI_Bx I2C Received Address Register */
#define OFS_UCB3ADDMASK                                    (0x001e)              /**< eUSCI_Bx I2C Address Mask Register */
#define OFS_UCB3I2CSA                                      (0x0020)              /**< eUSCI_Bx I2C Slave Address Register */
#define OFS_UCB3IE                                         (0x002a)              /**< eUSCI_Bx Interrupt Enable Register */
#define OFS_UCB3IE_SPI                                     (0x002a)              /**< eUSCI_Bx Interrupt Enable Register */
#define OFS_UCB3IFG                                        (0x002c)              /**< eUSCI_Bx Interrupt Flag Register */
#define OFS_UCB3IFG_SPI                                    (0x002c)              /**< eUSCI_Bx Interrupt Flag Register */
#define OFS_UCB3IV                                         (0x002e)              /**< eUSCI_Bx Interrupt Vector Register */
#define OFS_UCB3IV_SPI                                     (0x002e)              /**< eUSCI_Bx Interrupt Vector Register */

