arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
#define UCB3CTL0                                           (HWREG8_L(UCB3CTLW0)) /* eUSCI_Bx Control 1 */
#define UCB3CTL1                                           (HWREG8_H(UCB3CTLW0)) /* eUSCI_Bx Control 0 */
#define UCB3BR0                                            (HWREG8_L(UCB3BRW))   /* eUSCI_Bx Bit Rate Control 0 */
#define UCB3BR1                                            (HWREG8_H(UCB3BRW))   /* eUSCI_Bx Bit Rate Control 1 */
#define UCB3STAT                                           (HWREG8_L(UCB3STATW)) /* eUSCI_Bx Status */
#define UCB3BCNT                                           (HWREG8_H(UCB3STATW)) /* eUSCI_Bx Byte Counter Register */

/******************************************************************************
* PMAP Registers
******************************************************************************/
#define PMAPKEYID                                (HWREG16(0x40005000))           /**< Port Mapping Key Register */
#define PMAPCTL                                  (HWREG16(0x40005002))           /**< Port Mapping Control Register */
#define P1MAP01                                  (HWREG16(0x40005008))           /**< Port mapping register, P1.0 and P1.1 */
#define P1MAP23                                  (HWREG16(0x4000500A))           /**< Port mapping register, P1.2 and P1.3 */
#define P1MAP45                                  (HWREG16(0x4000500C))           /**< Port mapping register, P1.4 and P1.5 */
#define P1MAP67                                  (HWREG16(0x4000500E))           /**< Port mapping register, P1.6 and P1.7 */
#define P2MAP01                                  (HWREG16(0x40005010))           /**< Port mapping register, P2.0 and P2.1 */
#define P2MAP23                                  (HWREG16(0x40005012))           /**< Port mapping register, P2.2 and P2.3 */
#define P2MAP45                                  (HWREG16(0x40005014))           /**< Port mapping register, P2.4 and P2.5 */
#define P2MAP67                                  (HWREG16(0x40005016))           /**< Port mapping register, P2.6 and P2.7 */
#define P3MAP01                                  (HWREG16(0x40005018))           /**< Port mapping register, P3.0 and P3.1 */
#define P3MAP23                                  (HWREG16(0x4000501A))           /**< Port mapping register, P3.2 and P3.3 */
#define P3MAP45                                  (HWREG16(0x4000501C))           /**< Port mapping register, P3.4 and P3.5 */
#define P3MAP67                                  (HWREG16(0x4000501E))           /**< Port mapping register, P3.6 and P3.7 */
#define P4MAP01                                  (HWREG16(0x40005020))           /**< Port mapping register, P4.0 and P4.1 */
#define P4MAP23                                  (HWREG16(0x40005022))           /**< Port mapping register, P4.2 and P4.3 */
#define P4MAP45                                  (HWREG16(0x40005024))           /**< Port mapping register, P4.4 and P4.5 */
#define P4MAP67                                  (HWREG16(0x40005026))           /**< Port mapping register, P4.6 and P4.7 */
#define P5MAP01                                  (HWREG16(0x40005028))           /**< Port mapping register, P5.0 and P5.1 */
#define P5MAP23                                  (HWREG16(0x4000502A))           /**< Port mapping register, P5.2 and P5.3 */
#define P5MAP45                                  (HWREG16(0x4000502C))           /**< Port mapping register, P5.4 and P5.5 */
#define P5MAP67                                  (HWREG16(0x4000502E))           /**< Port mapping register, P5.6 and P5.7 */
#define P6MAP01                                  (HWREG16(0x40005030))           /**< Port mapping register, P6.0 and P6.1 */
#define P6MAP23                                  (HWREG16(0x40005032))           /**< Port mapping register, P6.2 and P6.3 */
#define P6MAP45                                  (HWREG16(0x40005034))           /**< Port mapping register, P6.4 and P6.5 */
#define P6MAP67                                  (HWREG16(0x40005036))           /**< Port mapping register, P6.6 and P6.7 */
#define P7MAP01                                  (HWREG16(0x40005038))           /**< Port mapping register, P7.0 and P7.1 */
#define P7MAP23                                  (HWREG16(0x4000503A))           /**< Port mapping register, P7.2 and P7.3 */
#define P7MAP45                                  (HWREG16(0x4000503C))           /**< Port mapping register, P7.4 and P7.5 */
#define P7MAP67                                  (HWREG16(0x4000503E))           /**< Port mapping register, P7.6 and P7.7 */

/* Register offsets from PMAP_BASE address */
#define OFS_PMAPKEYID                                      (0x0000)              /**< Port Mapping Key Register */
#define OFS_PMAPCTL                                        (0x0002)              /**< Port Mapping Control Register */
#define OFS_P1MAP01                                        (0x0008)              /**< Port mapping register, P1.0 and P1.1 */
#define OFS_P1MAP23                                        (0x000a)              /**< Port mapping register, P1.2 and P1.3 */
#define OFS_P1MAP45                                        (0x000c)              /**< Port mapping register, P1.4 and P1.5 */
#define OFS_P1MAP67                                        (0x000e)              /**< Port mapping register, P1.6 and P1.7 */
#define OFS_P2MAP01                                        (0x0010)              /**< Port mapping register, P2.0 and P2.1 */
#define OFS_P2MAP23                                        (0x0012)              /**< Port mapping register, P2.2 and P2.3 */
#define OFS_P2MAP45                                        (0x0014)              /**< Port mapping register, P2.4 and P2.5 */
#define OFS_P2MAP67                                        (0x0016)              /**< Port mapping register, P2.6 and P2.7 */
#define OFS_P3MAP01                                        (0x0018)              /**< Port mapping register, P3.0 and P3.1 */
#define OFS_P3MAP23                                        (0x001a)              /**< Port mapping register, P3.2 and P3.3 */
#define OFS_P3MAP45                                        (0x001c)              /**< Port mapping register, P3.4 and P3.5 */
#define OFS_P3MAP67                                        (0x001e)              /**< Port mapping register, P3.6 and P3.7 */
#define OFS_P4MAP01                                        (0x0020)              /**< Port mapping register, P4.0 and P4.1 */
#define OFS_P4MAP23                                        (0x0022)              /**< Port mapping register, P4.2 and P4.3 */
#define OFS_P4MAP45                                        (0x0024)              /**< Port mapping register, P4.4 and P4.5 */
#define OFS_P4MAP67                                        (0x0026)              /**< Port mapping register, P4.6 and P4.7 */
#define OFS_P5MAP01                                        (0x0028)              /**< Port mapping register, P5.0 and P5.1 */
#define OFS_P5MAP23                                        (0x002a)              /**< Port mapping register, P5.2 and P5.3 */
#define OFS_P5MAP45                                        (0x002c)              /**< Port mapping register, P5.4 and P5.5 */
#define OFS_P5MAP67                                        (0x002e)              /**< Port mapping register, P5.6 and P5.7 */
#define OFS_P6MAP01                                        (0x0030)              /**< Port mapping register, P6.0 and P6.1 */
#define OFS_P6MAP23                                        (0x0032)              /**< Port mapping register, P6.2 and P6.3 */
#define OFS_P6MAP45                                        (0x0034)              /**< Port mapping register, P6.4 and P6.5 */
#define OFS_P6MAP67                                        (0x0036)              /**< Port mapping register, P6.6 and P6.7 */
#define OFS_P7MAP01                                        (0x0038)              /**< Port mapping register, P7.0 and P7.1 */
#define OFS_P7MAP23                                        (0x003a)              /**< Port mapping register, P7.2 and P7.3 */
#define OFS_P7MAP45                                        (0x003c)              /**< Port mapping register, P7.4 and P7.5 */
#define OFS_P7MAP67                                        (0x003e)              /**< Port mapping register, P7.6 and P7.7 */


