arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/******************************************************************************
* REF_A Registers
******************************************************************************/
#define REFCTL0                                  (HWREG16(0x40003000))           /**< REF Control Register 0 */

/* Register offsets from REF_A_BASE address */
#define OFS_REFCTL0                                        (0x0000)              /**< REF Control Register 0 */

#define REFCTL0_L                                          (HWREG8_L(REFCTL0))   /* REF Control Register 0 */
#define REFCTL0_H                                          (HWREG8_H(REFCTL0))   /* REF Control Register 0 */

/******************************************************************************
* RTC_C Registers
******************************************************************************/
#define RTCCTL0                                  (HWREG16(0x40004400))           /**< RTCCTL0 Register */
#define RTCCTL13                                 (HWREG16(0x40004402))           /**< RTCCTL13 Register */
#define RTCOCAL                                  (HWREG16(0x40004404))           /**< RTCOCAL Register */
#define RTCTCMP                                  (HWREG16(0x40004406))           /**< RTCTCMP Register */
#define RTCPS0CTL                                (HWREG16(0x40004408))           /**< Real-Time Clock Prescale Timer 0 Control Register */
#define RTCPS1CTL                                (HWREG16(0x4000440A))           /**< Real-Time Clock Prescale Timer 1 Control Register */
#define RTCPS                                    (HWREG16(0x4000440C))           /**< Real-Time Clock Prescale Timer Counter Register */
#define RTCIV                                    (HWREG16(0x4000440E))           /**< Real-Time Clock Interrupt Vector Register */
#define RTCTIM0                                  (HWREG16(0x40004410))           /**< RTCTIM0 Register ? Hexadecimal Format */
#define RTCTIM0_BCD                              (HWREG16(0x40004410))           /**< RTCTIM0 Register ? BCD Format */
#define RTCTIM1                                  (HWREG16(0x40004412))           /**< Real-Time Clock Hour, Day of Week */
#define RTCTIM1_BCD                              (HWREG16(0x40004412))           /**< RTCTIM1 Register ? BCD Format */
#define RTCDATE                                  (HWREG16(0x40004414))           /**< RTCDATE - Hexadecimal Format */
#define RTCDATE_BCD                              (HWREG16(0x40004414))           /**< Real-Time Clock Date - BCD Format */
#define RTCYEAR                                  (HWREG16(0x40004416))           /**< RTCYEAR Register ? Hexadecimal Format */
#define RTCYEAR_BCD                              (HWREG16(0x40004416))           /**< RTCYEAR Register ? BCD Format */
#define RTCAMINHR                                (HWREG16(0x40004418))           /**< RTCMINHR - Hexadecimal Format */
#define RTCAMINHR_BCD                            (HWREG16(0x40004418))           /**< RTCMINHR - BCD Format */
#define RTCADOWDAY                               (HWREG16(0x4000441A))           /**< RTCADOWDAY - Hexadecimal Format */
#define RTCADOWDAY_BCD                           (HWREG16(0x4000441A))           /**< RTCADOWDAY - BCD Format */
#define RTCBIN2BCD                               (HWREG16(0x4000441C))           /**< Binary-to-BCD Conversion Register */
#define RTCBCD2BIN                               (HWREG16(0x4000441E))           /**< BCD-to-Binary Conversion Register */

/* Register offsets from RTC_C_BASE address */
#define OFS_RTCCTL0                                        (0x0000)              /**< RTCCTL0 Register */
#define OFS_RTCCTL13                                       (0x0002)              /**< RTCCTL13 Register */
#define OFS_RTCOCAL                                        (0x0004)              /**< RTCOCAL Register */
#define OFS_RTCTCMP                                        (0x0006)              /**< RTCTCMP Register */
#define OFS_RTCPS0CTL                                      (0x0008)              /**< Real-Time Clock Prescale Timer 0 Control Register */
#define OFS_RTCPS1CTL                                      (0x000a)              /**< Real-Time Clock Prescale Timer 1 Control Register */
#define OFS_RTCPS                                          (0x000c)              /**< Real-Time Clock Prescale Timer Counter Register */
#define OFS_RTCIV                                          (0x000e)              /**< Real-Time Clock Interrupt Vector Register */
#define OFS_RTCTIM0                                        (0x0010)              /**< RTCTIM0 Register ? Hexadecimal Format */
#define OFS_RTCTIM0_BCD                                    (0x0010)              /**< RTCTIM0 Register ? BCD Format */
#define OFS_RTCTIM1                                        (0x0012)              /**< Real-Time Clock Hour, Day of Week */
#define OFS_RTCTIM1_BCD                                    (0x0012)              /**< RTCTIM1 Register ? BCD Format */
#define OFS_RTCDATE                                        (0x0014)              /**< RTCDATE - Hexadecimal Format */
#define OFS_RTCDATE_BCD                                    (0x0014)              /**< Real-Time Clock Date - BCD Format */
#define OFS_RTCYEAR                                        (0x0016)              /**< RTCYEAR Register ? Hexadecimal Format */
#define OFS_RTCYEAR_BCD                                    (0x0016)              /**< RTCYEAR Register ? BCD Format */
#define OFS_RTCAMINHR                                      (0x0018)              /**< RTCMINHR - Hexadecimal Format */
#define OFS_RTCAMINHR_BCD                                  (0x0018)              /**< RTCMINHR - BCD Format */
#define OFS_RTCADOWDAY                                     (0x001a)              /**< RTCADOWDAY - Hexadecimal Format */
#define OFS_RTCADOWDAY_BCD                                 (0x001a)              /**< RTCADOWDAY - BCD Format */
#define OFS_RTCBIN2BCD                                     (0x001c)              /**< Binary-to-BCD Conversion Register */
#define OFS_RTCBCD2BIN                                     (0x001e)              /**< BCD-to-Binary Conversion Register */

