arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
#define RTCCTL0_L                                          (HWREG8_L(RTCCTL0))   /* RTCCTL0 Register */
#define RTCCTL0_H                                          (HWREG8_H(RTCCTL0))   /* RTCCTL0 Register */
#define RTCCTL1                                            (HWREG8_L(RTCCTL13))  /* RTCCTL13 Register */
#define RTCCTL13_L                                         (HWREG8_L(RTCCTL13))  /* RTCCTL13 Register */
#define RTCCTL3                                            (HWREG8_H(RTCCTL13))  /* RTCCTL13 Register */
#define RTCCTL13_H                                         (HWREG8_H(RTCCTL13))  /* RTCCTL13 Register */
#define RTCOCAL_L                                          (HWREG8_L(RTCOCAL))   /* RTCOCAL Register */
#define RTCOCAL_H                                          (HWREG8_H(RTCOCAL))   /* RTCOCAL Register */
#define RTCTCMP_L                                          (HWREG8_L(RTCTCMP))   /* RTCTCMP Register */
#define RTCTCMP_H                                          (HWREG8_H(RTCTCMP))   /* RTCTCMP Register */
#define RTCPS0CTL_L                                        (HWREG8_L(RTCPS0CTL)) /* Real-Time Clock Prescale Timer 0 Control Register */
#define RTCPS0CTL_H                                        (HWREG8_H(RTCPS0CTL)) /* Real-Time Clock Prescale Timer 0 Control Register */
#define RTCPS1CTL_L                                        (HWREG8_L(RTCPS1CTL)) /* Real-Time Clock Prescale Timer 1 Control Register */
#define RTCPS1CTL_H                                        (HWREG8_H(RTCPS1CTL)) /* Real-Time Clock Prescale Timer 1 Control Register */
#define RTCPS0                                             (HWREG8_L(RTCPS))     /* Real-Time Clock Prescale Timer Counter Register */
#define RTCPS_L                                            (HWREG8_L(RTCPS))     /* Real-Time Clock Prescale Timer Counter Register */
#define RTCPS1                                             (HWREG8_H(RTCPS))     /* Real-Time Clock Prescale Timer Counter Register */
#define RTCPS_H                                            (HWREG8_H(RTCPS))     /* Real-Time Clock Prescale Timer Counter Register */
#define RTCSEC                                             (HWREG8_L(RTCTIM0))   /* Real-Time Clock Seconds */
#define RTCTIM0_L                                          (HWREG8_L(RTCTIM0))   /* Real-Time Clock Seconds */
#define RTCMIN                                             (HWREG8_H(RTCTIM0))   /* Real-Time Clock Minutes */
#define RTCTIM0_H                                          (HWREG8_H(RTCTIM0))   /* Real-Time Clock Minutes */
#define RTCHOUR                                            (HWREG8_L(RTCTIM1))   /* Real-Time Clock Hour */
#define RTCTIM1_L                                          (HWREG8_L(RTCTIM1))   /* Real-Time Clock Hour */
#define RTCDOW                                             (HWREG8_H(RTCTIM1))   /* Real-Time Clock Day of Week */
#define RTCTIM1_H                                          (HWREG8_H(RTCTIM1))   /* Real-Time Clock Day of Week */
#define RTCDAY                                             (HWREG8_L(RTCDATE))   /* Real-Time Clock Day of Month */
#define RTCDATE_L                                          (HWREG8_L(RTCDATE))   /* Real-Time Clock Day of Month */
#define RTCMON                                             (HWREG8_H(RTCDATE))   /* Real-Time Clock Month */
#define RTCDATE_H                                          (HWREG8_H(RTCDATE))   /* Real-Time Clock Month */
#define RTCAMIN                                            (HWREG8_L(RTCAMINHR)) /* Real-Time Clock Minutes Alarm */
#define RTCAMINHR_L                                        (HWREG8_L(RTCAMINHR)) /* Real-Time Clock Minutes Alarm */
#define RTCAHOUR                                           (HWREG8_H(RTCAMINHR)) /* Real-Time Clock Hours Alarm */
#define RTCAMINHR_H                                        (HWREG8_H(RTCAMINHR)) /* Real-Time Clock Hours Alarm */
#define RTCADOW                                            (HWREG8_L(RTCADOWDAY))/* Real-Time Clock Day of Week Alarm */
#define RTCADOWDAY_L                                       (HWREG8_L(RTCADOWDAY))/* Real-Time Clock Day of Week Alarm */
#define RTCADAY                                            (HWREG8_H(RTCADOWDAY))/* Real-Time Clock Day of Month Alarm */
#define RTCADOWDAY_H                                       (HWREG8_H(RTCADOWDAY))/* Real-Time Clock Day of Month Alarm */

/******************************************************************************
* TIMER_A0 Registers
******************************************************************************/
#define TA0CTL                                   (HWREG16(0x40000000))           /**< TimerAx Control Register */
#define TA0CCTL0                                 (HWREG16(0x40000002))           /**< Timer_A Capture/Compare Control Register */
#define TA0CCTL1                                 (HWREG16(0x40000004))           /**< Timer_A Capture/Compare Control Register */
#define TA0CCTL2                                 (HWREG16(0x40000006))           /**< Timer_A Capture/Compare Control Register */
#define TA0CCTL3                                 (HWREG16(0x40000008))           /**< Timer_A Capture/Compare Control Register */
#define TA0CCTL4                                 (HWREG16(0x4000000A))           /**< Timer_A Capture/Compare Control Register */
#define TA0CCTL5                                 (HWREG16(0x4000000C))           /**< Timer_A Capture/Compare Control Register */
#define TA0CCTL6                                 (HWREG16(0x4000000E))           /**< Timer_A Capture/Compare Control Register */
#define TA0R                                     (HWREG16(0x40000010))           /**< TimerA register */
#define TA0CCR0                                  (HWREG16(0x40000012))           /**< Timer_A Capture/Compare  Register */
#define TA0CCR1                                  (HWREG16(0x40000014))           /**< Timer_A Capture/Compare  Register */
#define TA0CCR2                                  (HWREG16(0x40000016))           /**< Timer_A Capture/Compare  Register */
#define TA0CCR3                                  (HWREG16(0x40000018))           /**< Timer_A Capture/Compare  Register */
#define TA0CCR4                                  (HWREG16(0x4000001A))           /**< Timer_A Capture/Compare  Register */
#define TA0CCR5                                  (HWREG16(0x4000001C))           /**< Timer_A Capture/Compare  Register */
#define TA0CCR6                                  (HWREG16(0x4000001E))           /**< Timer_A Capture/Compare  Register */
#define TA0EX0                                   (HWREG16(0x40000020))           /**< TimerAx Expansion 0 Register */
#define TA0IV                                    (HWREG16(0x4000002E))           /**< TimerAx Interrupt Vector Register */

/* Register offsets from TIMER_A0_BASE address */
#define OFS_TA0CTL                                         (0x0000)              /**< TimerAx Control Register */
#define OFS_TA0CCTL0                                       (0x0002)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA0CCTL1                                       (0x0004)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA0CCTL2                                       (0x0006)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA0CCTL3                                       (0x0008)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA0CCTL4                                       (0x000A)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA0CCTL5                                       (0x000C)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA0CCTL6                                       (0x000E)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA0R                                           (0x0010)              /**< TimerA register */
#define OFS_TA0CCR0                                        (0x0012)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA0CCR1                                        (0x0014)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA0CCR2                                        (0x0016)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA0CCR3                                        (0x0018)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA0CCR4                                        (0x001A)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA0CCR5                                        (0x001C)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA0CCR6                                        (0x001E)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA0EX0                                         (0x0020)              /**< TimerAx Expansion 0 Register */
#define OFS_TA0IV                                          (0x002e)              /**< TimerAx Interrupt Vector Register */


