arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/******************************************************************************
* TIMER_A1 Registers
******************************************************************************/
#define TA1CTL                                   (HWREG16(0x40000400))           /**< TimerAx Control Register */
#define TA1CCTL0                                 (HWREG16(0x40000402))           /**< Timer_A Capture/Compare Control Register */
#define TA1CCTL1                                 (HWREG16(0x40000404))           /**< Timer_A Capture/Compare Control Register */
#define TA1CCTL2                                 (HWREG16(0x40000406))           /**< Timer_A Capture/Compare Control Register */
#define TA1CCTL3                                 (HWREG16(0x40000408))           /**< Timer_A Capture/Compare Control Register */
#define TA1CCTL4                                 (HWREG16(0x4000040A))           /**< Timer_A Capture/Compare Control Register */
#define TA1CCTL5                                 (HWREG16(0x4000040C))           /**< Timer_A Capture/Compare Control Register */
#define TA1CCTL6                                 (HWREG16(0x4000040E))           /**< Timer_A Capture/Compare Control Register */
#define TA1R                                     (HWREG16(0x40000410))           /**< TimerA register */
#define TA1CCR0                                  (HWREG16(0x40000412))           /**< Timer_A Capture/Compare  Register */
#define TA1CCR1                                  (HWREG16(0x40000414))           /**< Timer_A Capture/Compare  Register */
#define TA1CCR2                                  (HWREG16(0x40000416))           /**< Timer_A Capture/Compare  Register */
#define TA1CCR3                                  (HWREG16(0x40000418))           /**< Timer_A Capture/Compare  Register */
#define TA1CCR4                                  (HWREG16(0x4000041A))           /**< Timer_A Capture/Compare  Register */
#define TA1CCR5                                  (HWREG16(0x4000041C))           /**< Timer_A Capture/Compare  Register */
#define TA1CCR6                                  (HWREG16(0x4000041E))           /**< Timer_A Capture/Compare  Register */
#define TA1EX0                                   (HWREG16(0x40000420))           /**< TimerAx Expansion 0 Register */
#define TA1IV                                    (HWREG16(0x4000042E))           /**< TimerAx Interrupt Vector Register */

/* Register offsets from TIMER_A1_BASE address */
#define OFS_TA1CTL                                         (0x0000)              /**< TimerAx Control Register */
#define OFS_TA1CCTL0                                       (0x0002)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA1CCTL1                                       (0x0004)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA1CCTL2                                       (0x0006)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA1CCTL3                                       (0x0008)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA1CCTL4                                       (0x000A)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA1CCTL5                                       (0x000C)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA1CCTL6                                       (0x000E)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA1R                                           (0x0010)              /**< TimerA register */
#define OFS_TA1CCR0                                        (0x0012)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA1CCR1                                        (0x0014)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA1CCR2                                        (0x0016)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA1CCR3                                        (0x0018)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA1CCR4                                        (0x001A)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA1CCR5                                        (0x001C)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA1CCR6                                        (0x001E)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA1EX0                                         (0x0020)              /**< TimerAx Expansion 0 Register */
#define OFS_TA1IV                                          (0x002e)              /**< TimerAx Interrupt Vector Register */


/******************************************************************************
* TIMER_A2 Registers
******************************************************************************/
#define TA2CTL                                   (HWREG16(0x40000800))           /**< TimerAx Control Register */
#define TA2CCTL0                                 (HWREG16(0x40000802))           /**< Timer_A Capture/Compare Control Register */
#define TA2CCTL1                                 (HWREG16(0x40000804))           /**< Timer_A Capture/Compare Control Register */
#define TA2CCTL2                                 (HWREG16(0x40000806))           /**< Timer_A Capture/Compare Control Register */
#define TA2CCTL3                                 (HWREG16(0x40000808))           /**< Timer_A Capture/Compare Control Register */
#define TA2CCTL4                                 (HWREG16(0x4000080A))           /**< Timer_A Capture/Compare Control Register */
#define TA2CCTL5                                 (HWREG16(0x4000080C))           /**< Timer_A Capture/Compare Control Register */
#define TA2CCTL6                                 (HWREG16(0x4000080E))           /**< Timer_A Capture/Compare Control Register */
#define TA2R                                     (HWREG16(0x40000810))           /**< TimerA register */
#define TA2CCR0                                  (HWREG16(0x40000812))           /**< Timer_A Capture/Compare  Register */
#define TA2CCR1                                  (HWREG16(0x40000814))           /**< Timer_A Capture/Compare  Register */
#define TA2CCR2                                  (HWREG16(0x40000816))           /**< Timer_A Capture/Compare  Register */
#define TA2CCR3                                  (HWREG16(0x40000818))           /**< Timer_A Capture/Compare  Register */
#define TA2CCR4                                  (HWREG16(0x4000081A))           /**< Timer_A Capture/Compare  Register */
#define TA2CCR5                                  (HWREG16(0x4000081C))           /**< Timer_A Capture/Compare  Register */
#define TA2CCR6                                  (HWREG16(0x4000081E))           /**< Timer_A Capture/Compare  Register */
#define TA2EX0                                   (HWREG16(0x40000820))           /**< TimerAx Expansion 0 Register */
#define TA2IV                                    (HWREG16(0x4000082E))           /**< TimerAx Interrupt Vector Register */

