arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/* Register offsets from TIMER_A2_BASE address */
#define OFS_TA2CTL                                         (0x0000)              /**< TimerAx Control Register */
#define OFS_TA2CCTL0                                       (0x0002)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA2CCTL1                                       (0x0004)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA2CCTL2                                       (0x0006)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA2CCTL3                                       (0x0008)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA2CCTL4                                       (0x000A)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA2CCTL5                                       (0x000C)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA2CCTL6                                       (0x000E)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA2R                                           (0x0010)              /**< TimerA register */
#define OFS_TA2CCR0                                        (0x0012)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA2CCR1                                        (0x0014)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA2CCR2                                        (0x0016)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA2CCR3                                        (0x0018)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA2CCR4                                        (0x001A)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA2CCR5                                        (0x001C)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA2CCR6                                        (0x001E)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA2EX0                                         (0x0020)              /**< TimerAx Expansion 0 Register */
#define OFS_TA2IV                                          (0x002e)              /**< TimerAx Interrupt Vector Register */


/******************************************************************************
* TIMER_A3 Registers
******************************************************************************/
#define TA3CTL                                   (HWREG16(0x40000C00))           /**< TimerAx Control Register */
#define TA3CCTL0                                 (HWREG16(0x40000C02))           /**< Timer_A Capture/Compare Control Register */
#define TA3CCTL1                                 (HWREG16(0x40000C04))           /**< Timer_A Capture/Compare Control Register */
#define TA3CCTL2                                 (HWREG16(0x40000C06))           /**< Timer_A Capture/Compare Control Register */
#define TA3CCTL3                                 (HWREG16(0x40000C08))           /**< Timer_A Capture/Compare Control Register */
#define TA3CCTL4                                 (HWREG16(0x40000C0A))           /**< Timer_A Capture/Compare Control Register */
#define TA3CCTL5                                 (HWREG16(0x40000C0C))           /**< Timer_A Capture/Compare Control Register */
#define TA3CCTL6                                 (HWREG16(0x40000C0E))           /**< Timer_A Capture/Compare Control Register */
#define TA3R                                     (HWREG16(0x40000C10))           /**< TimerA register */
#define TA3CCR0                                  (HWREG16(0x40000C12))           /**< Timer_A Capture/Compare  Register */
#define TA3CCR1                                  (HWREG16(0x40000C14))           /**< Timer_A Capture/Compare  Register */
#define TA3CCR2                                  (HWREG16(0x40000C16))           /**< Timer_A Capture/Compare  Register */
#define TA3CCR3                                  (HWREG16(0x40000C18))           /**< Timer_A Capture/Compare  Register */
#define TA3CCR4                                  (HWREG16(0x40000C1A))           /**< Timer_A Capture/Compare  Register */
#define TA3CCR5                                  (HWREG16(0x40000C1C))           /**< Timer_A Capture/Compare  Register */
#define TA3CCR6                                  (HWREG16(0x40000C1E))           /**< Timer_A Capture/Compare  Register */
#define TA3EX0                                   (HWREG16(0x40000C20))           /**< TimerAx Expansion 0 Register */
#define TA3IV                                    (HWREG16(0x40000C2E))           /**< TimerAx Interrupt Vector Register */

/* Register offsets from TIMER_A3_BASE address */
#define OFS_TA3CTL                                         (0x0000)              /**< TimerAx Control Register */
#define OFS_TA3CCTL0                                       (0x0002)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA3CCTL1                                       (0x0004)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA3CCTL2                                       (0x0006)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA3CCTL3                                       (0x0008)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA3CCTL4                                       (0x000A)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA3CCTL5                                       (0x000C)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA3CCTL6                                       (0x000E)              /**< Timer_A Capture/Compare Control Register */
#define OFS_TA3R                                           (0x0010)              /**< TimerA register */
#define OFS_TA3CCR0                                        (0x0012)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA3CCR1                                        (0x0014)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA3CCR2                                        (0x0016)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA3CCR3                                        (0x0018)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA3CCR4                                        (0x001A)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA3CCR5                                        (0x001C)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA3CCR6                                        (0x001E)              /**< Timer_A Capture/Compare  Register */
#define OFS_TA3EX0                                         (0x0020)              /**< TimerAx Expansion 0 Register */
#define OFS_TA3IV                                          (0x002e)              /**< TimerAx Interrupt Vector Register */


