arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/******************************************************************************
* CAPTIO Bits (legacy section)
******************************************************************************/
/* CAPTIO0CTL[CAPTIOPISEL] Bits */
#define CAPTIOPISEL_OFS                          CAPTIO_CTL_PISEL_OFS            /**< CAPTIOPISELx Offset */
#define CAPTIOPISEL_M                            CAPTIO_CTL_PISEL_MASK           /**< Capacitive Touch IO pin select */
#define CAPTIOPISEL0                             CAPTIO_CTL_PISEL0               /**< CAPTIOPISEL Bit 0 */
#define CAPTIOPISEL1                             CAPTIO_CTL_PISEL1               /**< CAPTIOPISEL Bit 1 */
#define CAPTIOPISEL2                             CAPTIO_CTL_PISEL2               /**< CAPTIOPISEL Bit 2 */
#define CAPTIOPISEL_0                            CAPTIO_CTL_PISEL_0              /**< Px.0 */
#define CAPTIOPISEL_1                            CAPTIO_CTL_PISEL_1              /**< Px.1 */
#define CAPTIOPISEL_2                            CAPTIO_CTL_PISEL_2              /**< Px.2 */
#define CAPTIOPISEL_3                            CAPTIO_CTL_PISEL_3              /**< Px.3 */
#define CAPTIOPISEL_4                            CAPTIO_CTL_PISEL_4              /**< Px.4 */
#define CAPTIOPISEL_5                            CAPTIO_CTL_PISEL_5              /**< Px.5 */
#define CAPTIOPISEL_6                            CAPTIO_CTL_PISEL_6              /**< Px.6 */
#define CAPTIOPISEL_7                            CAPTIO_CTL_PISEL_7              /**< Px.7 */
/* CAPTIO0CTL[CAPTIOPOSEL] Bits */
#define CAPTIOPOSEL_OFS                          CAPTIO_CTL_POSEL_OFS            /**< CAPTIOPOSELx Offset */
#define CAPTIOPOSEL_M                            CAPTIO_CTL_POSEL_MASK           /**< Capacitive Touch IO port select */
#define CAPTIOPOSEL0                             CAPTIO_CTL_POSEL0               /**< CAPTIOPOSEL Bit 0 */
#define CAPTIOPOSEL1                             CAPTIO_CTL_POSEL1               /**< CAPTIOPOSEL Bit 1 */
#define CAPTIOPOSEL2                             CAPTIO_CTL_POSEL2               /**< CAPTIOPOSEL Bit 2 */
#define CAPTIOPOSEL3                             CAPTIO_CTL_POSEL3               /**< CAPTIOPOSEL Bit 3 */
#define CAPTIOPOSEL_0                            CAPTIO_CTL_POSEL_0              /**< Px = PJ */
#define CAPTIOPOSEL_1                            CAPTIO_CTL_POSEL_1              /**< Px = P1 */
#define CAPTIOPOSEL_2                            CAPTIO_CTL_POSEL_2              /**< Px = P2 */
#define CAPTIOPOSEL_3                            CAPTIO_CTL_POSEL_3              /**< Px = P3 */
#define CAPTIOPOSEL_4                            CAPTIO_CTL_POSEL_4              /**< Px = P4 */
#define CAPTIOPOSEL_5                            CAPTIO_CTL_POSEL_5              /**< Px = P5 */
#define CAPTIOPOSEL_6                            CAPTIO_CTL_POSEL_6              /**< Px = P6 */
#define CAPTIOPOSEL_7                            CAPTIO_CTL_POSEL_7              /**< Px = P7 */
#define CAPTIOPOSEL_8                            CAPTIO_CTL_POSEL_8              /**< Px = P8 */
#define CAPTIOPOSEL_9                            CAPTIO_CTL_POSEL_9              /**< Px = P9 */
#define CAPTIOPOSEL_10                           CAPTIO_CTL_POSEL_10             /**< Px = P10 */
#define CAPTIOPOSEL_11                           CAPTIO_CTL_POSEL_11             /**< Px = P11 */
#define CAPTIOPOSEL_12                           CAPTIO_CTL_POSEL_12             /**< Px = P12 */
#define CAPTIOPOSEL_13                           CAPTIO_CTL_POSEL_13             /**< Px = P13 */
#define CAPTIOPOSEL_14                           CAPTIO_CTL_POSEL_14             /**< Px = P14 */
#define CAPTIOPOSEL_15                           CAPTIO_CTL_POSEL_15             /**< Px = P15 */
#define CAPTIOPOSEL__PJ                          CAPTIO_CTL_POSEL__PJ            /**< Px = PJ */
#define CAPTIOPOSEL__P1                          CAPTIO_CTL_POSEL__P1            /**< Px = P1 */
#define CAPTIOPOSEL__P2                          CAPTIO_CTL_POSEL__P2            /**< Px = P2 */
#define CAPTIOPOSEL__P3                          CAPTIO_CTL_POSEL__P3            /**< Px = P3 */
#define CAPTIOPOSEL__P4                          CAPTIO_CTL_POSEL__P4            /**< Px = P4 */
#define CAPTIOPOSEL__P5                          CAPTIO_CTL_POSEL__P5            /**< Px = P5 */
#define CAPTIOPOSEL__P6                          CAPTIO_CTL_POSEL__P6            /**< Px = P6 */
#define CAPTIOPOSEL__P7                          CAPTIO_CTL_POSEL__P7            /**< Px = P7 */
#define CAPTIOPOSEL__P8                          CAPTIO_CTL_POSEL__P8            /**< Px = P8 */
#define CAPTIOPOSEL__P9                          CAPTIO_CTL_POSEL__P9            /**< Px = P9 */
#define CAPTIOPOSEL__P10                         CAPTIO_CTL_POSEL__P10           /**< Px = P10 */
#define CAPTIOPOSEL__P11                         CAPTIO_CTL_POSEL__P11           /**< Px = P11 */
#define CAPTIOPOSEL__P12                         CAPTIO_CTL_POSEL__P12           /**< Px = P12 */
#define CAPTIOPOSEL__P13                         CAPTIO_CTL_POSEL__P13           /**< Px = P13 */
#define CAPTIOPOSEL__P14                         CAPTIO_CTL_POSEL__P14           /**< Px = P14 */
#define CAPTIOPOSEL__P15                         CAPTIO_CTL_POSEL__P15           /**< Px = P15 */
/* CAPTIO0CTL[CAPTIOEN] Bits */
#define CAPTIOEN_OFS                             CAPTIO_CTL_EN_OFS               /**< CAPTIOEN Offset */
#define CAPTIOEN                                 CAPTIO_CTL_EN                   /**< Capacitive Touch IO enable */
/* CAPTIO0CTL[CAPTIOSTATE] Bits */
#define CAPTIOSTATE_OFS                          CAPTIO_CTL_STATE_OFS            /**< CAPTIOSTATE Offset */
#define CAPTIOSTATE                              CAPTIO_CTL_STATE                /**< Capacitive Touch IO state */


/******************************************************************************
* COMP_E Bits (legacy section)
******************************************************************************/
/* CE0CTL0[CEIPSEL] Bits */
#define CEIPSEL_OFS                              COMP_E_CTL0_IPSEL_OFS           /**< CEIPSEL Offset */
#define CEIPSEL_M                                COMP_E_CTL0_IPSEL_MASK          /**< Channel input selected for the V+ terminal */
#define CEIPSEL0                                 COMP_E_CTL0_IPSEL0              /**< CEIPSEL Bit 0 */
#define CEIPSEL1                                 COMP_E_CTL0_IPSEL1              /**< CEIPSEL Bit 1 */
#define CEIPSEL2                                 COMP_E_CTL0_IPSEL2              /**< CEIPSEL Bit 2 */
#define CEIPSEL3                                 COMP_E_CTL0_IPSEL3              /**< CEIPSEL Bit 3 */
#define CEIPSEL_0                                COMP_E_CTL0_IPSEL_0             /**< Channel 0 selected */
#define CEIPSEL_1                                COMP_E_CTL0_IPSEL_1             /**< Channel 1 selected */
#define CEIPSEL_2                                COMP_E_CTL0_IPSEL_2             /**< Channel 2 selected */
#define CEIPSEL_3                                COMP_E_CTL0_IPSEL_3             /**< Channel 3 selected */
#define CEIPSEL_4                                COMP_E_CTL0_IPSEL_4             /**< Channel 4 selected */
#define CEIPSEL_5                                COMP_E_CTL0_IPSEL_5             /**< Channel 5 selected */
#define CEIPSEL_6                                COMP_E_CTL0_IPSEL_6             /**< Channel 6 selected */
#define CEIPSEL_7                                COMP_E_CTL0_IPSEL_7             /**< Channel 7 selected */
#define CEIPSEL_8                                COMP_E_CTL0_IPSEL_8             /**< Channel 8 selected */
#define CEIPSEL_9                                COMP_E_CTL0_IPSEL_9             /**< Channel 9 selected */
#define CEIPSEL_10                               COMP_E_CTL0_IPSEL_10            /**< Channel 10 selected */
#define CEIPSEL_11                               COMP_E_CTL0_IPSEL_11            /**< Channel 11 selected */
#define CEIPSEL_12                               COMP_E_CTL0_IPSEL_12            /**< Channel 12 selected */
#define CEIPSEL_13                               COMP_E_CTL0_IPSEL_13            /**< Channel 13 selected */
#define CEIPSEL_14                               COMP_E_CTL0_IPSEL_14            /**< Channel 14 selected */
#define CEIPSEL_15                               COMP_E_CTL0_IPSEL_15            /**< Channel 15 selected */
/* CE0CTL0[CEIPEN] Bits */
#define CEIPEN_OFS                               COMP_E_CTL0_IPEN_OFS            /**< CEIPEN Offset */
#define CEIPEN                                   COMP_E_CTL0_IPEN                /**< Channel input enable for the V+ terminal */
/* CE0CTL0[CEIMSEL] Bits */
#define CEIMSEL_OFS                              COMP_E_CTL0_IMSEL_OFS           /**< CEIMSEL Offset */
#define CEIMSEL_M                                COMP_E_CTL0_IMSEL_MASK          /**< Channel input selected for the - terminal */
#define CEIMSEL0                                 COMP_E_CTL0_IMSEL0              /**< CEIMSEL Bit 0 */
#define CEIMSEL1                                 COMP_E_CTL0_IMSEL1              /**< CEIMSEL Bit 1 */
#define CEIMSEL2                                 COMP_E_CTL0_IMSEL2              /**< CEIMSEL Bit 2 */
#define CEIMSEL3                                 COMP_E_CTL0_IMSEL3              /**< CEIMSEL Bit 3 */
#define CEIMSEL_0                                COMP_E_CTL0_IMSEL_0             /**< Channel 0 selected */
#define CEIMSEL_1                                COMP_E_CTL0_IMSEL_1             /**< Channel 1 selected */
#define CEIMSEL_2                                COMP_E_CTL0_IMSEL_2             /**< Channel 2 selected */
#define CEIMSEL_3                                COMP_E_CTL0_IMSEL_3             /**< Channel 3 selected */
#define CEIMSEL_4                                COMP_E_CTL0_IMSEL_4             /**< Channel 4 selected */
#define CEIMSEL_5                                COMP_E_CTL0_IMSEL_5             /**< Channel 5 selected */
#define CEIMSEL_6                                COMP_E_CTL0_IMSEL_6             /**< Channel 6 selected */
#define CEIMSEL_7                                COMP_E_CTL0_IMSEL_7             /**< Channel 7 selected */
#define CEIMSEL_8                                COMP_E_CTL0_IMSEL_8             /**< Channel 8 selected */
#define CEIMSEL_9                                COMP_E_CTL0_IMSEL_9             /**< Channel 9 selected */
#define CEIMSEL_10                               COMP_E_CTL0_IMSEL_10            /**< Channel 10 selected */
#define CEIMSEL_11                               COMP_E_CTL0_IMSEL_11            /**< Channel 11 selected */
#define CEIMSEL_12                               COMP_E_CTL0_IMSEL_12            /**< Channel 12 selected */
#define CEIMSEL_13                               COMP_E_CTL0_IMSEL_13            /**< Channel 13 selected */
#define CEIMSEL_14                               COMP_E_CTL0_IMSEL_14            /**< Channel 14 selected */
#define CEIMSEL_15                               COMP_E_CTL0_IMSEL_15            /**< Channel 15 selected */
/* CE0CTL0[CEIMEN] Bits */
#define CEIMEN_OFS                               COMP_E_CTL0_IMEN_OFS            /**< CEIMEN Offset */
#define CEIMEN                                   COMP_E_CTL0_IMEN                /**< Channel input enable for the - terminal */
/* CE0CTL1[CEOUT] Bits */
#define CEOUT_OFS                                COMP_E_CTL1_OUT_OFS             /**< CEOUT Offset */
#define CEOUT                                    COMP_E_CTL1_OUT                 /**< Comparator output value */
/* CE0CTL1[CEOUTPOL] Bits */
#define CEOUTPOL_OFS                             COMP_E_CTL1_OUTPOL_OFS          /**< CEOUTPOL Offset */
#define CEOUTPOL                                 COMP_E_CTL1_OUTPOL              /**< Comparator output polarity */
/* CE0CTL1[CEF] Bits */
#define CEF_OFS                                  COMP_E_CTL1_F_OFS               /**< CEF Offset */
#define CEF                                      COMP_E_CTL1_F                   /**< Comparator output filter */
/* CE0CTL1[CEIES] Bits */
#define CEIES_OFS                                COMP_E_CTL1_IES_OFS             /**< CEIES Offset */
#define CEIES                                    COMP_E_CTL1_IES                 /**< Interrupt edge select for CEIIFG and CEIFG */
/* CE0CTL1[CESHORT] Bits */
#define CESHORT_OFS                              COMP_E_CTL1_SHORT_OFS           /**< CESHORT Offset */
#define CESHORT                                  COMP_E_CTL1_SHORT               /**< Input short */
/* CE0CTL1[CEEX] Bits */
#define CEEX_OFS                                 COMP_E_CTL1_EX_OFS              /**< CEEX Offset */
#define CEEX                                     COMP_E_CTL1_EX                  /**< Exchange */
/* CE0CTL1[CEFDLY] Bits */
#define CEFDLY_OFS                               COMP_E_CTL1_FDLY_OFS            /**< CEFDLY Offset */
#define CEFDLY_M                                 COMP_E_CTL1_FDLY_MASK           /**< Filter delay */
#define CEFDLY0                                  COMP_E_CTL1_FDLY0               /**< CEFDLY Bit 0 */
#define CEFDLY1                                  COMP_E_CTL1_FDLY1               /**< CEFDLY Bit 1 */
#define CEFDLY_0                                 COMP_E_CTL1_FDLY_0              /**< Typical filter delay of TBD (450) ns */
#define CEFDLY_1                                 COMP_E_CTL1_FDLY_1              /**< Typical filter delay of TBD (900) ns */
#define CEFDLY_2                                 COMP_E_CTL1_FDLY_2              /**< Typical filter delay of TBD (1800) ns */
#define CEFDLY_3                                 COMP_E_CTL1_FDLY_3              /**< Typical filter delay of TBD (3600) ns */
/* CE0CTL1[CEPWRMD] Bits */
#define CEPWRMD_OFS                              COMP_E_CTL1_PWRMD_OFS           /**< CEPWRMD Offset */
#define CEPWRMD_M                                COMP_E_CTL1_PWRMD_MASK          /**< Power Mode */
#define CEPWRMD0                                 COMP_E_CTL1_PWRMD0              /**< CEPWRMD Bit 0 */
#define CEPWRMD1                                 COMP_E_CTL1_PWRMD1              /**< CEPWRMD Bit 1 */
#define CEPWRMD_0                                COMP_E_CTL1_PWRMD_0             /**< High-speed mode */
#define CEPWRMD_1                                COMP_E_CTL1_PWRMD_1             /**< Normal mode */
#define CEPWRMD_2                                COMP_E_CTL1_PWRMD_2             /**< Ultra-low power mode */
/* CE0CTL1[CEON] Bits */
#define CEON_OFS                                 COMP_E_CTL1_ON_OFS              /**< CEON Offset */
#define CEON                                     COMP_E_CTL1_ON                  /**< Comparator On */
/* CE0CTL1[CEMRVL] Bits */
#define CEMRVL_OFS                               COMP_E_CTL1_MRVL_OFS            /**< CEMRVL Offset */
#define CEMRVL                                   COMP_E_CTL1_MRVL                /**< This bit is valid of CEMRVS is set to 1 */
/* CE0CTL1[CEMRVS] Bits */
#define CEMRVS_OFS                               COMP_E_CTL1_MRVS_OFS            /**< CEMRVS Offset */
#define CEMRVS                                   COMP_E_CTL1_MRVS
/* CE0CTL2[CEREF0] Bits */
#define CEREF0_OFS                               COMP_E_CTL2_REF0_OFS            /**< CEREF0 Offset */
#define CEREF0_M                                 COMP_E_CTL2_REF0_MASK           /**< Reference resistor tap 0 */
/* CE0CTL2[CERSEL] Bits */
#define CERSEL_OFS                               COMP_E_CTL2_RSEL_OFS            /**< CERSEL Offset */
#define CERSEL                                   COMP_E_CTL2_RSEL                /**< Reference select */
/* CE0CTL2[CERS] Bits */
#define CERS_OFS                                 COMP_E_CTL2_RS_OFS              /**< CERS Offset */
#define CERS_M                                   COMP_E_CTL2_RS_MASK             /**< Reference source */
#define CERS0                                    COMP_E_CTL2_RS0                 /**< CERS Bit 0 */
#define CERS1                                    COMP_E_CTL2_RS1                 /**< CERS Bit 1 */
#define CERS_0                                   COMP_E_CTL2_RS_0                /**< No current is drawn by the reference circuitry */
#define CERS_1                                   COMP_E_CTL2_RS_1                /**< VCC applied to the resistor ladder */
#define CERS_2                                   COMP_E_CTL2_RS_2                /**< Shared reference voltage applied to the resistor ladder */
#define CERS_3                                   COMP_E_CTL2_RS_3                /**< Shared reference voltage supplied to V(CREF). Resistor ladder is off */
/* CE0CTL2[CEREF1] Bits */
#define CEREF1_OFS                               COMP_E_CTL2_REF1_OFS            /**< CEREF1 Offset */
#define CEREF1_M                                 COMP_E_CTL2_REF1_MASK           /**< Reference resistor tap 1 */
/* CE0CTL2[CEREFL] Bits */
#define CEREFL_OFS                               COMP_E_CTL2_REFL_OFS            /**< CEREFL Offset */
#define CEREFL_M                                 COMP_E_CTL2_REFL_MASK           /**< Reference voltage level */
#define CEREFL0                                  COMP_E_CTL2_REFL0               /**< CEREFL Bit 0 */
#define CEREFL1                                  COMP_E_CTL2_REFL1               /**< CEREFL Bit 1 */
#define CEREFL_0                                 COMP_E_CTL2_CEREFL_0            /**< Reference amplifier is disabled. No reference voltage is requested */
#define CEREFL_1                                 COMP_E_CTL2_CEREFL_1            /**< 1.2 V is selected as shared reference voltage input */
#define CEREFL_2                                 COMP_E_CTL2_CEREFL_2            /**< 2.0 V is selected as shared reference voltage input */
#define CEREFL_3                                 COMP_E_CTL2_CEREFL_3            /**< 2.5 V is selected as shared reference voltage input */
#define CEREFL__OFF                              COMP_E_CTL2_REFL__OFF           /**< Reference amplifier is disabled. No reference voltage is requested */
#define CEREFL__1P2V                             COMP_E_CTL2_REFL__1P2V          /**< 1.2 V is selected as shared reference voltage input */
#define CEREFL__2P0V                             COMP_E_CTL2_REFL__2P0V          /**< 2.0 V is selected as shared reference voltage input */
#define CEREFL__2P5V                             COMP_E_CTL2_REFL__2P5V          /**< 2.5 V is selected as shared reference voltage input */
/* CE0CTL2[CEREFACC] Bits */
#define CEREFACC_OFS                             COMP_E_CTL2_REFACC_OFS          /**< CEREFACC Offset */
#define CEREFACC                                 COMP_E_CTL2_REFACC              /**< Reference accuracy */
/* CE0CTL3[CEPD0] Bits */
#define CEPD0_OFS                                COMP_E_CTL3_PD0_OFS             /**< CEPD0 Offset */
#define CEPD0                                    COMP_E_CTL3_PD0                 /**< Port disable */
/* CE0CTL3[CEPD1] Bits */
#define CEPD1_OFS                                COMP_E_CTL3_PD1_OFS             /**< CEPD1 Offset */
#define CEPD1                                    COMP_E_CTL3_PD1                 /**< Port disable */
/* CE0CTL3[CEPD2] Bits */
#define CEPD2_OFS                                COMP_E_CTL3_PD2_OFS             /**< CEPD2 Offset */
#define CEPD2                                    COMP_E_CTL3_PD2                 /**< Port disable */
/* CE0CTL3[CEPD3] Bits */
#define CEPD3_OFS                                COMP_E_CTL3_PD3_OFS             /**< CEPD3 Offset */
#define CEPD3                                    COMP_E_CTL3_PD3                 /**< Port disable */
/* CE0CTL3[CEPD4] Bits */
#define CEPD4_OFS                                COMP_E_CTL3_PD4_OFS             /**< CEPD4 Offset */
#define CEPD4                                    COMP_E_CTL3_PD4                 /**< Port disable */
/* CE0CTL3[CEPD5] Bits */
#define CEPD5_OFS                                COMP_E_CTL3_PD5_OFS             /**< CEPD5 Offset */
#define CEPD5                                    COMP_E_CTL3_PD5                 /**< Port disable */
/* CE0CTL3[CEPD6] Bits */
#define CEPD6_OFS                                COMP_E_CTL3_PD6_OFS             /**< CEPD6 Offset */
#define CEPD6                                    COMP_E_CTL3_PD6                 /**< Port disable */
/* CE0CTL3[CEPD7] Bits */
#define CEPD7_OFS                                COMP_E_CTL3_PD7_OFS             /**< CEPD7 Offset */
#define CEPD7                                    COMP_E_CTL3_PD7                 /**< Port disable */
/* CE0CTL3[CEPD8] Bits */
#define CEPD8_OFS                                COMP_E_CTL3_PD8_OFS             /**< CEPD8 Offset */
#define CEPD8                                    COMP_E_CTL3_PD8                 /**< Port disable */
/* CE0CTL3[CEPD9] Bits */
#define CEPD9_OFS                                COMP_E_CTL3_PD9_OFS             /**< CEPD9 Offset */
#define CEPD9                                    COMP_E_CTL3_PD9                 /**< Port disable */
/* CE0CTL3[CEPD10] Bits */
#define CEPD10_OFS                               COMP_E_CTL3_PD10_OFS            /**< CEPD10 Offset */
#define CEPD10                                   COMP_E_CTL3_PD10                /**< Port disable */
/* CE0CTL3[CEPD11] Bits */
#define CEPD11_OFS                               COMP_E_CTL3_PD11_OFS            /**< CEPD11 Offset */
#define CEPD11                                   COMP_E_CTL3_PD11                /**< Port disable */
/* CE0CTL3[CEPD12] Bits */
#define CEPD12_OFS                               COMP_E_CTL3_PD12_OFS            /**< CEPD12 Offset */
#define CEPD12                                   COMP_E_CTL3_PD12                /**< Port disable */
/* CE0CTL3[CEPD13] Bits */
#define CEPD13_OFS                               COMP_E_CTL3_PD13_OFS            /**< CEPD13 Offset */
#define CEPD13                                   COMP_E_CTL3_PD13                /**< Port disable */
/* CE0CTL3[CEPD14] Bits */
#define CEPD14_OFS                               COMP_E_CTL3_PD14_OFS            /**< CEPD14 Offset */
#define CEPD14                                   COMP_E_CTL3_PD14                /**< Port disable */
/* CE0CTL3[CEPD15] Bits */
#define CEPD15_OFS                               COMP_E_CTL3_PD15_OFS            /**< CEPD15 Offset */
#define CEPD15                                   COMP_E_CTL3_PD15                /**< Port disable */
/* CE0INT[CEIFG] Bits */
#define CEIFG_OFS                                COMP_E_INT_IFG_OFS              /**< CEIFG Offset */
#define CEIFG                                    COMP_E_INT_IFG                  /**< Comparator output interrupt flag */
/* CE0INT[CEIIFG] Bits */
#define CEIIFG_OFS                               COMP_E_INT_IIFG_OFS             /**< CEIIFG Offset */
#define CEIIFG                                   COMP_E_INT_IIFG                 /**< Comparator output inverted interrupt flag */
/* CE0INT[CERDYIFG] Bits */
#define CERDYIFG_OFS                             COMP_E_INT_RDYIFG_OFS           /**< CERDYIFG Offset */
#define CERDYIFG                                 COMP_E_INT_RDYIFG               /**< Comparator ready interrupt flag */
/* CE0INT[CEIE] Bits */
#define CEIE_OFS                                 COMP_E_INT_IE_OFS               /**< CEIE Offset */
#define CEIE                                     COMP_E_INT_IE                   /**< Comparator output interrupt enable */
/* CE0INT[CEIIE] Bits */
#define CEIIE_OFS                                COMP_E_INT_IIE_OFS              /**< CEIIE Offset */
#define CEIIE                                    COMP_E_INT_IIE                  /**< Comparator output interrupt enable inverted polarity */
/* CE0INT[CERDYIE] Bits */
#define CERDYIE_OFS                              COMP_E_INT_RDYIE_OFS            /**< CERDYIE Offset */
#define CERDYIE                                  COMP_E_INT_RDYIE                /**< Comparator ready interrupt enable */


