arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/******************************************************************************
* CRC32 Bits (legacy section)
******************************************************************************/

/* DIO_PAIN[P1IN] Bits */
#define P1IN_OFS                                           ( 0)                  /* P1IN Offset */
#define P1IN_M                                             (0x00ff)              /* Port 1 Input */
/* DIO_PAIN[P2IN] Bits */
#define P2IN_OFS                                           ( 8)                  /* P2IN Offset */
#define P2IN_M                                             (0xff00)              /* Port 2 Input */
/* DIO_PAOUT[P2OUT] Bits */
#define P2OUT_OFS                                          ( 8)                  /* P2OUT Offset */
#define P2OUT_M                                            (0xff00)              /* Port 2 Output */
/* DIO_PAOUT[P1OUT] Bits */
#define P1OUT_OFS                                          ( 0)                  /* P1OUT Offset */
#define P1OUT_M                                            (0x00ff)              /* Port 1 Output */
/* DIO_PADIR[P1DIR] Bits */
#define P1DIR_OFS                                          ( 0)                  /* P1DIR Offset */
#define P1DIR_M                                            (0x00ff)              /* Port 1 Direction */
/* DIO_PADIR[P2DIR] Bits */
#define P2DIR_OFS                                          ( 8)                  /* P2DIR Offset */
#define P2DIR_M                                            (0xff00)              /* Port 2 Direction */
/* DIO_PAREN[P1REN] Bits */
#define P1REN_OFS                                          ( 0)                  /* P1REN Offset */
#define P1REN_M                                            (0x00ff)              /* Port 1 Resistor Enable */
/* DIO_PAREN[P2REN] Bits */
#define P2REN_OFS                                          ( 8)                  /* P2REN Offset */
#define P2REN_M                                            (0xff00)              /* Port 2 Resistor Enable */
/* DIO_PADS[P1DS] Bits */
#define P1DS_OFS                                           ( 0)                  /* P1DS Offset */
#define P1DS_M                                             (0x00ff)              /* Port 1 Drive Strength */
/* DIO_PADS[P2DS] Bits */
#define P2DS_OFS                                           ( 8)                  /* P2DS Offset */
#define P2DS_M                                             (0xff00)              /* Port 2 Drive Strength */
/* DIO_PASEL0[P1SEL0] Bits */
#define P1SEL0_OFS                                         ( 0)                  /* P1SEL0 Offset */
#define P1SEL0_M                                           (0x00ff)              /* Port 1 Select 0 */
/* DIO_PASEL0[P2SEL0] Bits */
#define P2SEL0_OFS                                         ( 8)                  /* P2SEL0 Offset */
#define P2SEL0_M                                           (0xff00)              /* Port 2 Select 0 */
/* DIO_PASEL1[P1SEL1] Bits */
#define P1SEL1_OFS                                         ( 0)                  /* P1SEL1 Offset */
#define P1SEL1_M                                           (0x00ff)              /* Port 1 Select 1 */
/* DIO_PASEL1[P2SEL1] Bits */
#define P2SEL1_OFS                                         ( 8)                  /* P2SEL1 Offset */
#define P2SEL1_M                                           (0xff00)              /* Port 2 Select 1 */
/* DIO_P1IV[P1IV] Bits */
#define P1IV_OFS                                           ( 0)                  /* P1IV Offset */
#define P1IV_M                                             (0x001f)              /* Port 1 interrupt vector value */
#define P1IV0                                              (0x0001)              /* Port 1 interrupt vector value */
#define P1IV1                                              (0x0002)              /* Port 1 interrupt vector value */
#define P1IV2                                              (0x0004)              /* Port 1 interrupt vector value */
#define P1IV3                                              (0x0008)              /* Port 1 interrupt vector value */
#define P1IV4                                              (0x0010)              /* Port 1 interrupt vector value */
#define P1IV_0                                             (0x0000)              /* No interrupt pending */
#define P1IV_2                                             (0x0002)              /* Interrupt Source: Port 1.0 interrupt; Interrupt Flag: P1IFG0; Interrupt Priority: Highest */
#define P1IV_4                                             (0x0004)              /* Interrupt Source: Port 1.1 interrupt; Interrupt Flag: P1IFG1 */
#define P1IV_6                                             (0x0006)              /* Interrupt Source: Port 1.2 interrupt; Interrupt Flag: P1IFG2 */
#define P1IV_8                                             (0x0008)              /* Interrupt Source: Port 1.3 interrupt; Interrupt Flag: P1IFG3 */
#define P1IV_10                                            (0x000a)              /* Interrupt Source: Port 1.4 interrupt; Interrupt Flag: P1IFG4 */
#define P1IV_12                                            (0x000c)              /* Interrupt Source: Port 1.5 interrupt; Interrupt Flag: P1IFG5 */
#define P1IV_14                                            (0x000e)              /* Interrupt Source: Port 1.6 interrupt; Interrupt Flag: P1IFG6 */
#define P1IV_16                                            (0x0010)              /* Interrupt Source: Port 1.7 interrupt; Interrupt Flag: P1IFG7; Interrupt Priority: Lowest */
#define P1IV__NONE                                         (0x0000)              /* No interrupt pending */
#define P1IV__P1IFG0                                       (0x0002)              /* Interrupt Source: Port 1.0 interrupt; Interrupt Flag: P1IFG0; Interrupt Priority: Highest */
#define P1IV__P1IFG1                                       (0x0004)              /* Interrupt Source: Port 1.1 interrupt; Interrupt Flag: P1IFG1 */
#define P1IV__P1IFG2                                       (0x0006)              /* Interrupt Source: Port 1.2 interrupt; Interrupt Flag: P1IFG2 */
#define P1IV__P1IFG3                                       (0x0008)              /* Interrupt Source: Port 1.3 interrupt; Interrupt Flag: P1IFG3 */
#define P1IV__P1IFG4                                       (0x000a)              /* Interrupt Source: Port 1.4 interrupt; Interrupt Flag: P1IFG4 */
#define P1IV__P1IFG5                                       (0x000c)              /* Interrupt Source: Port 1.5 interrupt; Interrupt Flag: P1IFG5 */
#define P1IV__P1IFG6                                       (0x000e)              /* Interrupt Source: Port 1.6 interrupt; Interrupt Flag: P1IFG6 */
#define P1IV__P1IFG7                                       (0x0010)              /* Interrupt Source: Port 1.7 interrupt; Interrupt Flag: P1IFG7; Interrupt Priority: Lowest */
/* DIO_PASELC[P1SELC] Bits */
#define P1SELC_OFS                                         ( 0)                  /* P1SELC Offset */
#define P1SELC_M                                           (0x00ff)              /* Port 1 Complement Select */
/* DIO_PASELC[P2SELC] Bits */
#define P2SELC_OFS                                         ( 8)                  /* P2SELC Offset */
#define P2SELC_M                                           (0xff00)              /* Port 2 Complement Select */
/* DIO_PAIES[P1IES] Bits */
#define P1IES_OFS                                          ( 0)                  /* P1IES Offset */
#define P1IES_M                                            (0x00ff)              /* Port 1 Interrupt Edge Select */
/* DIO_PAIES[P2IES] Bits */
#define P2IES_OFS                                          ( 8)                  /* P2IES Offset */
#define P2IES_M                                            (0xff00)              /* Port 2 Interrupt Edge Select */
/* DIO_PAIE[P1IE] Bits */
#define P1IE_OFS                                           ( 0)                  /* P1IE Offset */
#define P1IE_M                                             (0x00ff)              /* Port 1 Interrupt Enable */
/* DIO_PAIE[P2IE] Bits */
#define P2IE_OFS                                           ( 8)                  /* P2IE Offset */
#define P2IE_M                                             (0xff00)              /* Port 2 Interrupt Enable */
/* DIO_PAIFG[P1IFG] Bits */
#define P1IFG_OFS                                          ( 0)                  /* P1IFG Offset */
#define P1IFG_M                                            (0x00ff)              /* Port 1 Interrupt Flag */
/* DIO_PAIFG[P2IFG] Bits */
#define P2IFG_OFS                                          ( 8)                  /* P2IFG Offset */
#define P2IFG_M                                            (0xff00)              /* Port 2 Interrupt Flag */
/* DIO_P2IV[P2IV] Bits */
#define P2IV_OFS                                           ( 0)                  /* P2IV Offset */
#define P2IV_M                                             (0x001f)              /* Port 2 interrupt vector value */
#define P2IV0                                              (0x0001)              /* Port 2 interrupt vector value */
#define P2IV1                                              (0x0002)              /* Port 2 interrupt vector value */
#define P2IV2                                              (0x0004)              /* Port 2 interrupt vector value */
#define P2IV3                                              (0x0008)              /* Port 2 interrupt vector value */
#define P2IV4                                              (0x0010)              /* Port 2 interrupt vector value */
#define P2IV_0                                             (0x0000)              /* No interrupt pending */
#define P2IV_2                                             (0x0002)              /* Interrupt Source: Port 2.0 interrupt; Interrupt Flag: P2IFG0; Interrupt Priority: Highest */
#define P2IV_4                                             (0x0004)              /* Interrupt Source: Port 2.1 interrupt; Interrupt Flag: P2IFG1 */
#define P2IV_6                                             (0x0006)              /* Interrupt Source: Port 2.2 interrupt; Interrupt Flag: P2IFG2 */
#define P2IV_8                                             (0x0008)              /* Interrupt Source: Port 2.3 interrupt; Interrupt Flag: P2IFG3 */
#define P2IV_10                                            (0x000a)              /* Interrupt Source: Port 2.4 interrupt; Interrupt Flag: P2IFG4 */
#define P2IV_12                                            (0x000c)              /* Interrupt Source: Port 2.5 interrupt; Interrupt Flag: P2IFG5 */
#define P2IV_14                                            (0x000e)              /* Interrupt Source: Port 2.6 interrupt; Interrupt Flag: P2IFG6 */
#define P2IV_16                                            (0x0010)              /* Interrupt Source: Port 2.7 interrupt; Interrupt Flag: P2IFG7; Interrupt Priority: Lowest */
#define P2IV__NONE                                         (0x0000)              /* No interrupt pending */
#define P2IV__P2IFG0                                       (0x0002)              /* Interrupt Source: Port 2.0 interrupt; Interrupt Flag: P2IFG0; Interrupt Priority: Highest */
#define P2IV__P2IFG1                                       (0x0004)              /* Interrupt Source: Port 2.1 interrupt; Interrupt Flag: P2IFG1 */
#define P2IV__P2IFG2                                       (0x0006)              /* Interrupt Source: Port 2.2 interrupt; Interrupt Flag: P2IFG2 */
#define P2IV__P2IFG3                                       (0x0008)              /* Interrupt Source: Port 2.3 interrupt; Interrupt Flag: P2IFG3 */
#define P2IV__P2IFG4                                       (0x000a)              /* Interrupt Source: Port 2.4 interrupt; Interrupt Flag: P2IFG4 */
#define P2IV__P2IFG5                                       (0x000c)              /* Interrupt Source: Port 2.5 interrupt; Interrupt Flag: P2IFG5 */
#define P2IV__P2IFG6                                       (0x000e)              /* Interrupt Source: Port 2.6 interrupt; Interrupt Flag: P2IFG6 */
#define P2IV__P2IFG7                                       (0x0010)              /* Interrupt Source: Port 2.7 interrupt; Interrupt Flag: P2IFG7; Interrupt Priority: Lowest */
/* DIO_PBIN[P3IN] Bits */
#define P3IN_OFS                                           ( 0)                  /* P3IN Offset */
#define P3IN_M                                             (0x00ff)              /* Port 3 Input */
/* DIO_PBIN[P4IN] Bits */
#define P4IN_OFS                                           ( 8)                  /* P4IN Offset */
#define P4IN_M                                             (0xff00)              /* Port 4 Input */
/* DIO_PBOUT[P3OUT] Bits */
#define P3OUT_OFS                                          ( 0)                  /* P3OUT Offset */
#define P3OUT_M                                            (0x00ff)              /* Port 3 Output */
/* DIO_PBOUT[P4OUT] Bits */
#define P4OUT_OFS                                          ( 8)                  /* P4OUT Offset */
#define P4OUT_M                                            (0xff00)              /* Port 4 Output */
/* DIO_PBDIR[P3DIR] Bits */
#define P3DIR_OFS                                          ( 0)                  /* P3DIR Offset */
#define P3DIR_M                                            (0x00ff)              /* Port 3 Direction */
/* DIO_PBDIR[P4DIR] Bits */
#define P4DIR_OFS                                          ( 8)                  /* P4DIR Offset */
#define P4DIR_M                                            (0xff00)              /* Port 4 Direction */
/* DIO_PBREN[P3REN] Bits */
#define P3REN_OFS                                          ( 0)                  /* P3REN Offset */
#define P3REN_M                                            (0x00ff)              /* Port 3 Resistor Enable */
/* DIO_PBREN[P4REN] Bits */
#define P4REN_OFS                                          ( 8)                  /* P4REN Offset */
#define P4REN_M                                            (0xff00)              /* Port 4 Resistor Enable */
/* DIO_PBDS[P3DS] Bits */
#define P3DS_OFS                                           ( 0)                  /* P3DS Offset */
#define P3DS_M                                             (0x00ff)              /* Port 3 Drive Strength */
/* DIO_PBDS[P4DS] Bits */
#define P4DS_OFS                                           ( 8)                  /* P4DS Offset */
#define P4DS_M                                             (0xff00)              /* Port 4 Drive Strength */
/* DIO_PBSEL0[P4SEL0] Bits */
#define P4SEL0_OFS                                         ( 8)                  /* P4SEL0 Offset */
#define P4SEL0_M                                           (0xff00)              /* Port 4 Select 0 */
/* DIO_PBSEL0[P3SEL0] Bits */
#define P3SEL0_OFS                                         ( 0)                  /* P3SEL0 Offset */
#define P3SEL0_M                                           (0x00ff)              /* Port 3 Select 0 */
/* DIO_PBSEL1[P3SEL1] Bits */
#define P3SEL1_OFS                                         ( 0)                  /* P3SEL1 Offset */
#define P3SEL1_M                                           (0x00ff)              /* Port 3 Select 1 */
/* DIO_PBSEL1[P4SEL1] Bits */
#define P4SEL1_OFS                                         ( 8)                  /* P4SEL1 Offset */
#define P4SEL1_M                                           (0xff00)              /* Port 4 Select 1 */
/* DIO_P3IV[P3IV] Bits */
#define P3IV_OFS                                           ( 0)                  /* P3IV Offset */
#define P3IV_M                                             (0x001f)              /* Port 3 interrupt vector value */
#define P3IV0                                              (0x0001)              /* Port 3 interrupt vector value */
#define P3IV1                                              (0x0002)              /* Port 3 interrupt vector value */
#define P3IV2                                              (0x0004)              /* Port 3 interrupt vector value */
#define P3IV3                                              (0x0008)              /* Port 3 interrupt vector value */
#define P3IV4                                              (0x0010)              /* Port 3 interrupt vector value */
#define P3IV_0                                             (0x0000)              /* No interrupt pending */
#define P3IV_2                                             (0x0002)              /* Interrupt Source: Port 3.0 interrupt; Interrupt Flag: P3IFG0; Interrupt Priority: Highest */
#define P3IV_4                                             (0x0004)              /* Interrupt Source: Port 3.1 interrupt; Interrupt Flag: P3IFG1 */
#define P3IV_6                                             (0x0006)              /* Interrupt Source: Port 3.2 interrupt; Interrupt Flag: P3IFG2 */
#define P3IV_8                                             (0x0008)              /* Interrupt Source: Port 3.3 interrupt; Interrupt Flag: P3IFG3 */
#define P3IV_10                                            (0x000a)              /* Interrupt Source: Port 3.4 interrupt; Interrupt Flag: P3IFG4 */
#define P3IV_12                                            (0x000c)              /* Interrupt Source: Port 3.5 interrupt; Interrupt Flag: P3IFG5 */
#define P3IV_14                                            (0x000e)              /* Interrupt Source: Port 3.6 interrupt; Interrupt Flag: P3IFG6 */
#define P3IV_16                                            (0x0010)              /* Interrupt Source: Port 3.7 interrupt; Interrupt Flag: P3IFG7; Interrupt Priority: Lowest */
#define P3IV__NONE                                         (0x0000)              /* No interrupt pending */
#define P3IV__P3IFG0                                       (0x0002)              /* Interrupt Source: Port 3.0 interrupt; Interrupt Flag: P3IFG0; Interrupt Priority: Highest */
#define P3IV__P3IFG1                                       (0x0004)              /* Interrupt Source: Port 3.1 interrupt; Interrupt Flag: P3IFG1 */
#define P3IV__P3IFG2                                       (0x0006)              /* Interrupt Source: Port 3.2 interrupt; Interrupt Flag: P3IFG2 */
#define P3IV__P3IFG3                                       (0x0008)              /* Interrupt Source: Port 3.3 interrupt; Interrupt Flag: P3IFG3 */
#define P3IV__P3IFG4                                       (0x000a)              /* Interrupt Source: Port 3.4 interrupt; Interrupt Flag: P3IFG4 */
#define P3IV__P3IFG5                                       (0x000c)              /* Interrupt Source: Port 3.5 interrupt; Interrupt Flag: P3IFG5 */
#define P3IV__P3IFG6                                       (0x000e)              /* Interrupt Source: Port 3.6 interrupt; Interrupt Flag: P3IFG6 */
#define P3IV__P3IFG7                                       (0x0010)              /* Interrupt Source: Port 3.7 interrupt; Interrupt Flag: P3IFG7; Interrupt Priority: Lowest */
/* DIO_PBSELC[P3SELC] Bits */
#define P3SELC_OFS                                         ( 0)                  /* P3SELC Offset */
#define P3SELC_M                                           (0x00ff)              /* Port 3 Complement Select */
/* DIO_PBSELC[P4SELC] Bits */
#define P4SELC_OFS                                         ( 8)                  /* P4SELC Offset */
#define P4SELC_M                                           (0xff00)              /* Port 4 Complement Select */
/* DIO_PBIES[P3IES] Bits */
#define P3IES_OFS                                          ( 0)                  /* P3IES Offset */
#define P3IES_M                                            (0x00ff)              /* Port 3 Interrupt Edge Select */
/* DIO_PBIES[P4IES] Bits */
#define P4IES_OFS                                          ( 8)                  /* P4IES Offset */
#define P4IES_M                                            (0xff00)              /* Port 4 Interrupt Edge Select */
/* DIO_PBIE[P3IE] Bits */
#define P3IE_OFS                                           ( 0)                  /* P3IE Offset */
#define P3IE_M                                             (0x00ff)              /* Port 3 Interrupt Enable */
/* DIO_PBIE[P4IE] Bits */
#define P4IE_OFS                                           ( 8)                  /* P4IE Offset */
#define P4IE_M                                             (0xff00)              /* Port 4 Interrupt Enable */
/* DIO_PBIFG[P3IFG] Bits */
#define P3IFG_OFS                                          ( 0)                  /* P3IFG Offset */
#define P3IFG_M                                            (0x00ff)              /* Port 3 Interrupt Flag */
/* DIO_PBIFG[P4IFG] Bits */
#define P4IFG_OFS                                          ( 8)                  /* P4IFG Offset */
#define P4IFG_M                                            (0xff00)              /* Port 4 Interrupt Flag */
/* DIO_P4IV[P4IV] Bits */
#define P4IV_OFS                                           ( 0)                  /* P4IV Offset */
#define P4IV_M                                             (0x001f)              /* Port 4 interrupt vector value */
#define P4IV0                                              (0x0001)              /* Port 4 interrupt vector value */
#define P4IV1                                              (0x0002)              /* Port 4 interrupt vector value */
#define P4IV2                                              (0x0004)              /* Port 4 interrupt vector value */
#define P4IV3                                              (0x0008)              /* Port 4 interrupt vector value */
#define P4IV4                                              (0x0010)              /* Port 4 interrupt vector value */
#define P4IV_0                                             (0x0000)              /* No interrupt pending */
#define P4IV_2                                             (0x0002)              /* Interrupt Source: Port 4.0 interrupt; Interrupt Flag: P4IFG0; Interrupt Priority: Highest */
#define P4IV_4                                             (0x0004)              /* Interrupt Source: Port 4.1 interrupt; Interrupt Flag: P4IFG1 */
#define P4IV_6                                             (0x0006)              /* Interrupt Source: Port 4.2 interrupt; Interrupt Flag: P4IFG2 */
#define P4IV_8                                             (0x0008)              /* Interrupt Source: Port 4.3 interrupt; Interrupt Flag: P4IFG3 */
#define P4IV_10                                            (0x000a)              /* Interrupt Source: Port 4.4 interrupt; Interrupt Flag: P4IFG4 */
#define P4IV_12                                            (0x000c)              /* Interrupt Source: Port 4.5 interrupt; Interrupt Flag: P4IFG5 */
#define P4IV_14                                            (0x000e)              /* Interrupt Source: Port 4.6 interrupt; Interrupt Flag: P4IFG6 */
#define P4IV_16                                            (0x0010)              /* Interrupt Source: Port 4.7 interrupt; Interrupt Flag: P4IFG7; Interrupt Priority: Lowest */
#define P4IV__NONE                                         (0x0000)              /* No interrupt pending */
#define P4IV__P4IFG0                                       (0x0002)              /* Interrupt Source: Port 4.0 interrupt; Interrupt Flag: P4IFG0; Interrupt Priority: Highest */
#define P4IV__P4IFG1                                       (0x0004)              /* Interrupt Source: Port 4.1 interrupt; Interrupt Flag: P4IFG1 */
#define P4IV__P4IFG2                                       (0x0006)              /* Interrupt Source: Port 4.2 interrupt; Interrupt Flag: P4IFG2 */
