arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
#define P4IV__P4IFG3                                       (0x0008)              /* Interrupt Source: Port 4.3 interrupt; Interrupt Flag: P4IFG3 */
#define P4IV__P4IFG4                                       (0x000a)              /* Interrupt Source: Port 4.4 interrupt; Interrupt Flag: P4IFG4 */
#define P4IV__P4IFG5                                       (0x000c)              /* Interrupt Source: Port 4.5 interrupt; Interrupt Flag: P4IFG5 */
#define P4IV__P4IFG6                                       (0x000e)              /* Interrupt Source: Port 4.6 interrupt; Interrupt Flag: P4IFG6 */
#define P4IV__P4IFG7                                       (0x0010)              /* Interrupt Source: Port 4.7 interrupt; Interrupt Flag: P4IFG7; Interrupt Priority: Lowest */
/* DIO_PCIN[P5IN] Bits */
#define P5IN_OFS                                           ( 0)                  /* P5IN Offset */
#define P5IN_M                                             (0x00ff)              /* Port 5 Input */
/* DIO_PCIN[P6IN] Bits */
#define P6IN_OFS                                           ( 8)                  /* P6IN Offset */
#define P6IN_M                                             (0xff00)              /* Port 6 Input */
/* DIO_PCOUT[P5OUT] Bits */
#define P5OUT_OFS                                          ( 0)                  /* P5OUT Offset */
#define P5OUT_M                                            (0x00ff)              /* Port 5 Output */
/* DIO_PCOUT[P6OUT] Bits */
#define P6OUT_OFS                                          ( 8)                  /* P6OUT Offset */
#define P6OUT_M                                            (0xff00)              /* Port 6 Output */
/* DIO_PCDIR[P5DIR] Bits */
#define P5DIR_OFS                                          ( 0)                  /* P5DIR Offset */
#define P5DIR_M                                            (0x00ff)              /* Port 5 Direction */
/* DIO_PCDIR[P6DIR] Bits */
#define P6DIR_OFS                                          ( 8)                  /* P6DIR Offset */
#define P6DIR_M                                            (0xff00)              /* Port 6 Direction */
/* DIO_PCREN[P5REN] Bits */
#define P5REN_OFS                                          ( 0)                  /* P5REN Offset */
#define P5REN_M                                            (0x00ff)              /* Port 5 Resistor Enable */
/* DIO_PCREN[P6REN] Bits */
#define P6REN_OFS                                          ( 8)                  /* P6REN Offset */
#define P6REN_M                                            (0xff00)              /* Port 6 Resistor Enable */
/* DIO_PCDS[P5DS] Bits */
#define P5DS_OFS                                           ( 0)                  /* P5DS Offset */
#define P5DS_M                                             (0x00ff)              /* Port 5 Drive Strength */
/* DIO_PCDS[P6DS] Bits */
#define P6DS_OFS                                           ( 8)                  /* P6DS Offset */
#define P6DS_M                                             (0xff00)              /* Port 6 Drive Strength */
/* DIO_PCSEL0[P5SEL0] Bits */
#define P5SEL0_OFS                                         ( 0)                  /* P5SEL0 Offset */
#define P5SEL0_M                                           (0x00ff)              /* Port 5 Select 0 */
/* DIO_PCSEL0[P6SEL0] Bits */
#define P6SEL0_OFS                                         ( 8)                  /* P6SEL0 Offset */
#define P6SEL0_M                                           (0xff00)              /* Port 6 Select 0 */
/* DIO_PCSEL1[P5SEL1] Bits */
#define P5SEL1_OFS                                         ( 0)                  /* P5SEL1 Offset */
#define P5SEL1_M                                           (0x00ff)              /* Port 5 Select 1 */
/* DIO_PCSEL1[P6SEL1] Bits */
#define P6SEL1_OFS                                         ( 8)                  /* P6SEL1 Offset */
#define P6SEL1_M                                           (0xff00)              /* Port 6 Select 1 */
/* DIO_P5IV[P5IV] Bits */
#define P5IV_OFS                                           ( 0)                  /* P5IV Offset */
#define P5IV_M                                             (0x001f)              /* Port 5 interrupt vector value */
#define P5IV0                                              (0x0001)              /* Port 5 interrupt vector value */
#define P5IV1                                              (0x0002)              /* Port 5 interrupt vector value */
#define P5IV2                                              (0x0004)              /* Port 5 interrupt vector value */
#define P5IV3                                              (0x0008)              /* Port 5 interrupt vector value */
#define P5IV4                                              (0x0010)              /* Port 5 interrupt vector value */
#define P5IV_0                                             (0x0000)              /* No interrupt pending */
#define P5IV_2                                             (0x0002)              /* Interrupt Source: Port 5.0 interrupt; Interrupt Flag: P5IFG0; Interrupt Priority: Highest */
#define P5IV_4                                             (0x0004)              /* Interrupt Source: Port 5.1 interrupt; Interrupt Flag: P5IFG1 */
#define P5IV_6                                             (0x0006)              /* Interrupt Source: Port 5.2 interrupt; Interrupt Flag: P5IFG2 */
#define P5IV_8                                             (0x0008)              /* Interrupt Source: Port 5.3 interrupt; Interrupt Flag: P5IFG3 */
#define P5IV_10                                            (0x000a)              /* Interrupt Source: Port 5.4 interrupt; Interrupt Flag: P5IFG4 */
#define P5IV_12                                            (0x000c)              /* Interrupt Source: Port 5.5 interrupt; Interrupt Flag: P5IFG5 */
#define P5IV_14                                            (0x000e)              /* Interrupt Source: Port 5.6 interrupt; Interrupt Flag: P5IFG6 */
#define P5IV_16                                            (0x0010)              /* Interrupt Source: Port 5.7 interrupt; Interrupt Flag: P5IFG7; Interrupt Priority: Lowest */
#define P5IV__NONE                                         (0x0000)              /* No interrupt pending */
#define P5IV__P5IFG0                                       (0x0002)              /* Interrupt Source: Port 5.0 interrupt; Interrupt Flag: P5IFG0; Interrupt Priority: Highest */
#define P5IV__P5IFG1                                       (0x0004)              /* Interrupt Source: Port 5.1 interrupt; Interrupt Flag: P5IFG1 */
#define P5IV__P5IFG2                                       (0x0006)              /* Interrupt Source: Port 5.2 interrupt; Interrupt Flag: P5IFG2 */
#define P5IV__P5IFG3                                       (0x0008)              /* Interrupt Source: Port 5.3 interrupt; Interrupt Flag: P5IFG3 */
#define P5IV__P5IFG4                                       (0x000a)              /* Interrupt Source: Port 5.4 interrupt; Interrupt Flag: P5IFG4 */
#define P5IV__P5IFG5                                       (0x000c)              /* Interrupt Source: Port 5.5 interrupt; Interrupt Flag: P5IFG5 */
#define P5IV__P5IFG6                                       (0x000e)              /* Interrupt Source: Port 5.6 interrupt; Interrupt Flag: P5IFG6 */
#define P5IV__P5IFG7                                       (0x0010)              /* Interrupt Source: Port 5.7 interrupt; Interrupt Flag: P5IFG7; Interrupt Priority: Lowest */
/* DIO_PCSELC[P5SELC] Bits */
#define P5SELC_OFS                                         ( 0)                  /* P5SELC Offset */
#define P5SELC_M                                           (0x00ff)              /* Port 5 Complement Select */
/* DIO_PCSELC[P6SELC] Bits */
#define P6SELC_OFS                                         ( 8)                  /* P6SELC Offset */
#define P6SELC_M                                           (0xff00)              /* Port 6 Complement Select */
/* DIO_PCIES[P5IES] Bits */
#define P5IES_OFS                                          ( 0)                  /* P5IES Offset */
#define P5IES_M                                            (0x00ff)              /* Port 5 Interrupt Edge Select */
/* DIO_PCIES[P6IES] Bits */
#define P6IES_OFS                                          ( 8)                  /* P6IES Offset */
#define P6IES_M                                            (0xff00)              /* Port 6 Interrupt Edge Select */
/* DIO_PCIE[P5IE] Bits */
#define P5IE_OFS                                           ( 0)                  /* P5IE Offset */
#define P5IE_M                                             (0x00ff)              /* Port 5 Interrupt Enable */
/* DIO_PCIE[P6IE] Bits */
#define P6IE_OFS                                           ( 8)                  /* P6IE Offset */
#define P6IE_M                                             (0xff00)              /* Port 6 Interrupt Enable */
/* DIO_PCIFG[P5IFG] Bits */
#define P5IFG_OFS                                          ( 0)                  /* P5IFG Offset */
#define P5IFG_M                                            (0x00ff)              /* Port 5 Interrupt Flag */
/* DIO_PCIFG[P6IFG] Bits */
#define P6IFG_OFS                                          ( 8)                  /* P6IFG Offset */
#define P6IFG_M                                            (0xff00)              /* Port 6 Interrupt Flag */
/* DIO_P6IV[P6IV] Bits */
#define P6IV_OFS                                           ( 0)                  /* P6IV Offset */
#define P6IV_M                                             (0x001f)              /* Port 6 interrupt vector value */
#define P6IV0                                              (0x0001)              /* Port 6 interrupt vector value */
#define P6IV1                                              (0x0002)              /* Port 6 interrupt vector value */
#define P6IV2                                              (0x0004)              /* Port 6 interrupt vector value */
#define P6IV3                                              (0x0008)              /* Port 6 interrupt vector value */
#define P6IV4                                              (0x0010)              /* Port 6 interrupt vector value */
#define P6IV_0                                             (0x0000)              /* No interrupt pending */
#define P6IV_2                                             (0x0002)              /* Interrupt Source: Port 6.0 interrupt; Interrupt Flag: P6IFG0; Interrupt Priority: Highest */
#define P6IV_4                                             (0x0004)              /* Interrupt Source: Port 6.1 interrupt; Interrupt Flag: P6IFG1 */
#define P6IV_6                                             (0x0006)              /* Interrupt Source: Port 6.2 interrupt; Interrupt Flag: P6IFG2 */
#define P6IV_8                                             (0x0008)              /* Interrupt Source: Port 6.3 interrupt; Interrupt Flag: P6IFG3 */
#define P6IV_10                                            (0x000a)              /* Interrupt Source: Port 6.4 interrupt; Interrupt Flag: P6IFG4 */
#define P6IV_12                                            (0x000c)              /* Interrupt Source: Port 6.5 interrupt; Interrupt Flag: P6IFG5 */
#define P6IV_14                                            (0x000e)              /* Interrupt Source: Port 6.6 interrupt; Interrupt Flag: P6IFG6 */
#define P6IV_16                                            (0x0010)              /* Interrupt Source: Port 6.7 interrupt; Interrupt Flag: P6IFG7; Interrupt Priority: Lowest */
#define P6IV__NONE                                         (0x0000)              /* No interrupt pending */
#define P6IV__P6IFG0                                       (0x0002)              /* Interrupt Source: Port 6.0 interrupt; Interrupt Flag: P6IFG0; Interrupt Priority: Highest */
#define P6IV__P6IFG1                                       (0x0004)              /* Interrupt Source: Port 6.1 interrupt; Interrupt Flag: P6IFG1 */
#define P6IV__P6IFG2                                       (0x0006)              /* Interrupt Source: Port 6.2 interrupt; Interrupt Flag: P6IFG2 */
#define P6IV__P6IFG3                                       (0x0008)              /* Interrupt Source: Port 6.3 interrupt; Interrupt Flag: P6IFG3 */
#define P6IV__P6IFG4                                       (0x000a)              /* Interrupt Source: Port 6.4 interrupt; Interrupt Flag: P6IFG4 */
#define P6IV__P6IFG5                                       (0x000c)              /* Interrupt Source: Port 6.5 interrupt; Interrupt Flag: P6IFG5 */
#define P6IV__P6IFG6                                       (0x000e)              /* Interrupt Source: Port 6.6 interrupt; Interrupt Flag: P6IFG6 */
#define P6IV__P6IFG7                                       (0x0010)              /* Interrupt Source: Port 6.7 interrupt; Interrupt Flag: P6IFG7; Interrupt Priority: Lowest */
/* DIO_PDIN[P7IN] Bits */
#define P7IN_OFS                                           ( 0)                  /* P7IN Offset */
#define P7IN_M                                             (0x00ff)              /* Port 7 Input */
/* DIO_PDIN[P8IN] Bits */
#define P8IN_OFS                                           ( 8)                  /* P8IN Offset */
#define P8IN_M                                             (0xff00)              /* Port 8 Input */
/* DIO_PDOUT[P7OUT] Bits */
#define P7OUT_OFS                                          ( 0)                  /* P7OUT Offset */
#define P7OUT_M                                            (0x00ff)              /* Port 7 Output */
/* DIO_PDOUT[P8OUT] Bits */
#define P8OUT_OFS                                          ( 8)                  /* P8OUT Offset */
#define P8OUT_M                                            (0xff00)              /* Port 8 Output */
/* DIO_PDDIR[P7DIR] Bits */
#define P7DIR_OFS                                          ( 0)                  /* P7DIR Offset */
#define P7DIR_M                                            (0x00ff)              /* Port 7 Direction */
/* DIO_PDDIR[P8DIR] Bits */
#define P8DIR_OFS                                          ( 8)                  /* P8DIR Offset */
#define P8DIR_M                                            (0xff00)              /* Port 8 Direction */
/* DIO_PDREN[P7REN] Bits */
#define P7REN_OFS                                          ( 0)                  /* P7REN Offset */
#define P7REN_M                                            (0x00ff)              /* Port 7 Resistor Enable */
/* DIO_PDREN[P8REN] Bits */
#define P8REN_OFS                                          ( 8)                  /* P8REN Offset */
#define P8REN_M                                            (0xff00)              /* Port 8 Resistor Enable */
/* DIO_PDDS[P7DS] Bits */
#define P7DS_OFS                                           ( 0)                  /* P7DS Offset */
#define P7DS_M                                             (0x00ff)              /* Port 7 Drive Strength */
/* DIO_PDDS[P8DS] Bits */
#define P8DS_OFS                                           ( 8)                  /* P8DS Offset */
#define P8DS_M                                             (0xff00)              /* Port 8 Drive Strength */
/* DIO_PDSEL0[P7SEL0] Bits */
#define P7SEL0_OFS                                         ( 0)                  /* P7SEL0 Offset */
#define P7SEL0_M                                           (0x00ff)              /* Port 7 Select 0 */
/* DIO_PDSEL0[P8SEL0] Bits */
#define P8SEL0_OFS                                         ( 8)                  /* P8SEL0 Offset */
#define P8SEL0_M                                           (0xff00)              /* Port 8 Select 0 */
/* DIO_PDSEL1[P7SEL1] Bits */
#define P7SEL1_OFS                                         ( 0)                  /* P7SEL1 Offset */
#define P7SEL1_M                                           (0x00ff)              /* Port 7 Select 1 */
/* DIO_PDSEL1[P8SEL1] Bits */
#define P8SEL1_OFS                                         ( 8)                  /* P8SEL1 Offset */
#define P8SEL1_M                                           (0xff00)              /* Port 8 Select 1 */
/* DIO_P7IV[P7IV] Bits */
#define P7IV_OFS                                           ( 0)                  /* P7IV Offset */
#define P7IV_M                                             (0x001f)              /* Port 7 interrupt vector value */
#define P7IV0                                              (0x0001)              /* Port 7 interrupt vector value */
#define P7IV1                                              (0x0002)              /* Port 7 interrupt vector value */
#define P7IV2                                              (0x0004)              /* Port 7 interrupt vector value */
#define P7IV3                                              (0x0008)              /* Port 7 interrupt vector value */
#define P7IV4                                              (0x0010)              /* Port 7 interrupt vector value */
#define P7IV_0                                             (0x0000)              /* No interrupt pending */
#define P7IV_2                                             (0x0002)              /* Interrupt Source: Port 7.0 interrupt; Interrupt Flag: P7IFG0; Interrupt Priority: Highest */
#define P7IV_4                                             (0x0004)              /* Interrupt Source: Port 7.1 interrupt; Interrupt Flag: P7IFG1 */
#define P7IV_6                                             (0x0006)              /* Interrupt Source: Port 7.2 interrupt; Interrupt Flag: P7IFG2 */
#define P7IV_8                                             (0x0008)              /* Interrupt Source: Port 7.3 interrupt; Interrupt Flag: P7IFG3 */
#define P7IV_10                                            (0x000a)              /* Interrupt Source: Port 7.4 interrupt; Interrupt Flag: P7IFG4 */
#define P7IV_12                                            (0x000c)              /* Interrupt Source: Port 7.5 interrupt; Interrupt Flag: P7IFG5 */
#define P7IV_14                                            (0x000e)              /* Interrupt Source: Port 7.6 interrupt; Interrupt Flag: P7IFG6 */
#define P7IV_16                                            (0x0010)              /* Interrupt Source: Port 7.7 interrupt; Interrupt Flag: P7IFG7; Interrupt Priority: Lowest */
#define P7IV__NONE                                         (0x0000)              /* No interrupt pending */
#define P7IV__P7IFG0                                       (0x0002)              /* Interrupt Source: Port 7.0 interrupt; Interrupt Flag: P7IFG0; Interrupt Priority: Highest */
#define P7IV__P7IFG1                                       (0x0004)              /* Interrupt Source: Port 7.1 interrupt; Interrupt Flag: P7IFG1 */
#define P7IV__P7IFG2                                       (0x0006)              /* Interrupt Source: Port 7.2 interrupt; Interrupt Flag: P7IFG2 */
#define P7IV__P7IFG3                                       (0x0008)              /* Interrupt Source: Port 7.3 interrupt; Interrupt Flag: P7IFG3 */
#define P7IV__P7IFG4                                       (0x000a)              /* Interrupt Source: Port 7.4 interrupt; Interrupt Flag: P7IFG4 */
#define P7IV__P7IFG5                                       (0x000c)              /* Interrupt Source: Port 7.5 interrupt; Interrupt Flag: P7IFG5 */
#define P7IV__P7IFG6                                       (0x000e)              /* Interrupt Source: Port 7.6 interrupt; Interrupt Flag: P7IFG6 */
#define P7IV__P7IFG7                                       (0x0010)              /* Interrupt Source: Port 7.7 interrupt; Interrupt Flag: P7IFG7; Interrupt Priority: Lowest */
/* DIO_PDSELC[P7SELC] Bits */
#define P7SELC_OFS                                         ( 0)                  /* P7SELC Offset */
#define P7SELC_M                                           (0x00ff)              /* Port 7 Complement Select */
/* DIO_PDSELC[P8SELC] Bits */
#define P8SELC_OFS                                         ( 8)                  /* P8SELC Offset */
#define P8SELC_M                                           (0xff00)              /* Port 8 Complement Select */
/* DIO_PDIES[P7IES] Bits */
#define P7IES_OFS                                          ( 0)                  /* P7IES Offset */
#define P7IES_M                                            (0x00ff)              /* Port 7 Interrupt Edge Select */
/* DIO_PDIES[P8IES] Bits */
#define P8IES_OFS                                          ( 8)                  /* P8IES Offset */
#define P8IES_M                                            (0xff00)              /* Port 8 Interrupt Edge Select */
/* DIO_PDIE[P7IE] Bits */
#define P7IE_OFS                                           ( 0)                  /* P7IE Offset */
#define P7IE_M                                             (0x00ff)              /* Port 7 Interrupt Enable */
/* DIO_PDIE[P8IE] Bits */
#define P8IE_OFS                                           ( 8)                  /* P8IE Offset */
#define P8IE_M                                             (0xff00)              /* Port 8 Interrupt Enable */
/* DIO_PDIFG[P7IFG] Bits */
#define P7IFG_OFS                                          ( 0)                  /* P7IFG Offset */
#define P7IFG_M                                            (0x00ff)              /* Port 7 Interrupt Flag */
/* DIO_PDIFG[P8IFG] Bits */
#define P8IFG_OFS                                          ( 8)                  /* P8IFG Offset */
#define P8IFG_M                                            (0xff00)              /* Port 8 Interrupt Flag */
/* DIO_P8IV[P8IV] Bits */
#define P8IV_OFS                                           ( 0)                  /* P8IV Offset */
#define P8IV_M                                             (0x001f)              /* Port 8 interrupt vector value */
#define P8IV0                                              (0x0001)              /* Port 8 interrupt vector value */
#define P8IV1                                              (0x0002)              /* Port 8 interrupt vector value */
#define P8IV2                                              (0x0004)              /* Port 8 interrupt vector value */
#define P8IV3                                              (0x0008)              /* Port 8 interrupt vector value */
#define P8IV4                                              (0x0010)              /* Port 8 interrupt vector value */
#define P8IV_0                                             (0x0000)              /* No interrupt pending */
#define P8IV_2                                             (0x0002)              /* Interrupt Source: Port 8.0 interrupt; Interrupt Flag: P8IFG0; Interrupt Priority: Highest */
#define P8IV_4                                             (0x0004)              /* Interrupt Source: Port 8.1 interrupt; Interrupt Flag: P8IFG1 */
#define P8IV_6                                             (0x0006)              /* Interrupt Source: Port 8.2 interrupt; Interrupt Flag: P8IFG2 */
#define P8IV_8                                             (0x0008)              /* Interrupt Source: Port 8.3 interrupt; Interrupt Flag: P8IFG3 */
#define P8IV_10                                            (0x000a)              /* Interrupt Source: Port 8.4 interrupt; Interrupt Flag: P8IFG4 */
#define P8IV_12                                            (0x000c)              /* Interrupt Source: Port 8.5 interrupt; Interrupt Flag: P8IFG5 */
#define P8IV_14                                            (0x000e)              /* Interrupt Source: Port 8.6 interrupt; Interrupt Flag: P8IFG6 */
#define P8IV_16                                            (0x0010)              /* Interrupt Source: Port 8.7 interrupt; Interrupt Flag: P8IFG7; Interrupt Priority: Lowest */
#define P8IV__NONE                                         (0x0000)              /* No interrupt pending */
