arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/******************************************************************************
* EUSCI_A Bits (legacy section)
******************************************************************************/
/* UCA0CTLW0[UCSWRST] Bits */
#define UCSWRST_OFS                              EUSCI_A_CTLW0_SWRST_OFS         /**< UCSWRST Offset */
#define UCSWRST                                  EUSCI_A_CTLW0_SWRST             /**< Software reset enable */
/* UCA0CTLW0[UCTXBRK] Bits */
#define UCTXBRK_OFS                              EUSCI_A_CTLW0_TXBRK_OFS         /**< UCTXBRK Offset */
#define UCTXBRK                                  EUSCI_A_CTLW0_TXBRK             /**< Transmit break */
/* UCA0CTLW0[UCTXADDR] Bits */
#define UCTXADDR_OFS                             EUSCI_A_CTLW0_TXADDR_OFS        /**< UCTXADDR Offset */
#define UCTXADDR                                 EUSCI_A_CTLW0_TXADDR            /**< Transmit address */
/* UCA0CTLW0[UCDORM] Bits */
#define UCDORM_OFS                               EUSCI_A_CTLW0_DORM_OFS          /**< UCDORM Offset */
#define UCDORM                                   EUSCI_A_CTLW0_DORM              /**< Dormant */
/* UCA0CTLW0[UCBRKIE] Bits */
#define UCBRKIE_OFS                              EUSCI_A_CTLW0_BRKIE_OFS         /**< UCBRKIE Offset */
#define UCBRKIE                                  EUSCI_A_CTLW0_BRKIE             /**< Receive break character interrupt enable */
/* UCA0CTLW0[UCRXEIE] Bits */
#define UCRXEIE_OFS                              EUSCI_A_CTLW0_RXEIE_OFS         /**< UCRXEIE Offset */
#define UCRXEIE                                  EUSCI_A_CTLW0_RXEIE             /**< Receive erroneous-character interrupt enable */
/* UCA0CTLW0[UCSSEL] Bits */
#define UCSSEL_OFS                               EUSCI_A_CTLW0_SSEL_OFS          /**< UCSSEL Offset */
#define UCSSEL_M                                 EUSCI_A_CTLW0_SSEL_MASK         /**< eUSCI_A clock source select */
#define UCSSEL0                                  EUSCI_A_CTLW0_SSEL0             /**< UCSSEL Bit 0 */
#define UCSSEL1                                  EUSCI_A_CTLW0_SSEL1             /**< UCSSEL Bit 1 */
#define UCSSEL_0                                 EUSCI_A_CTLW0_UCSSEL_0          /**< UCLK */
#define UCSSEL_1                                 EUSCI_A_CTLW0_UCSSEL_1          /**< ACLK */
#define UCSSEL_2                                 EUSCI_A_CTLW0_UCSSEL_2          /**< SMCLK */
#define UCSSEL__UCLK                             EUSCI_A_CTLW0_SSEL__UCLK        /**< UCLK */
#define UCSSEL__ACLK                             EUSCI_A_CTLW0_SSEL__ACLK        /**< ACLK */
#define UCSSEL__SMCLK                            EUSCI_A_CTLW0_SSEL__SMCLK       /**< SMCLK */
/* UCA0CTLW0[UCSYNC] Bits */
#define UCSYNC_OFS                               EUSCI_A_CTLW0_SYNC_OFS          /**< UCSYNC Offset */
#define UCSYNC                                   EUSCI_A_CTLW0_SYNC              /**< Synchronous mode enable */
/* UCA0CTLW0[UCMODE] Bits */
#define UCMODE_OFS                               EUSCI_A_CTLW0_MODE_OFS          /**< UCMODE Offset */
#define UCMODE_M                                 EUSCI_A_CTLW0_MODE_MASK         /**< eUSCI_A mode */
#define UCMODE0                                  EUSCI_A_CTLW0_MODE0             /**< UCMODE Bit 0 */
#define UCMODE1                                  EUSCI_A_CTLW0_MODE1             /**< UCMODE Bit 1 */
#define UCMODE_0                                 EUSCI_A_CTLW0_MODE_0            /**< UART mode */
#define UCMODE_1                                 EUSCI_A_CTLW0_MODE_1            /**< Idle-line multiprocessor mode */
#define UCMODE_2                                 EUSCI_A_CTLW0_MODE_2            /**< Address-bit multiprocessor mode */
#define UCMODE_3                                 EUSCI_A_CTLW0_MODE_3            /**< UART mode with automatic baud-rate detection */
/* UCA0CTLW0[UCSPB] Bits */
#define UCSPB_OFS                                EUSCI_A_CTLW0_SPB_OFS           /**< UCSPB Offset */
#define UCSPB                                    EUSCI_A_CTLW0_SPB               /**< Stop bit select */
/* UCA0CTLW0[UC7BIT] Bits */
#define UC7BIT_OFS                               EUSCI_A_CTLW0_SEVENBIT_OFS      /**< UC7BIT Offset */
#define UC7BIT                                   EUSCI_A_CTLW0_SEVENBIT          /**< Character length */
/* UCA0CTLW0[UCMSB] Bits */
#define UCMSB_OFS                                EUSCI_A_CTLW0_MSB_OFS           /**< UCMSB Offset */
#define UCMSB                                    EUSCI_A_CTLW0_MSB               /**< MSB first select */
/* UCA0CTLW0[UCPAR] Bits */
#define UCPAR_OFS                                EUSCI_A_CTLW0_PAR_OFS           /**< UCPAR Offset */
#define UCPAR                                    EUSCI_A_CTLW0_PAR               /**< Parity select */
/* UCA0CTLW0[UCPEN] Bits */
#define UCPEN_OFS                                EUSCI_A_CTLW0_PEN_OFS           /**< UCPEN Offset */
#define UCPEN                                    EUSCI_A_CTLW0_PEN               /**< Parity enable */
/* UCA0CTLW0_SPI[UCSWRST] Bits */
//#define UCSWRST_OFS                              EUSCI_A_CTLW0_SWRST_OFS         /**< UCSWRST Offset */
//#define UCSWRST                                  EUSCI_A_CTLW0_SWRST             /**< Software reset enable */
/* UCA0CTLW0_SPI[UCSTEM] Bits */
#define UCSTEM_OFS                               EUSCI_A_CTLW0_STEM_OFS          /**< UCSTEM Offset */
#define UCSTEM                                   EUSCI_A_CTLW0_STEM              /**< STE mode select in master mode. */
/* UCA0CTLW0_SPI[UCSSEL] Bits */
//#define UCSSEL_OFS                               EUSCI_A_CTLW0_SSEL_OFS          /**< UCSSEL Offset */
//#define UCSSEL_M                                 EUSCI_A_CTLW0_SSEL_MASK         /**< eUSCI_A clock source select */
//#define UCSSEL0                                  EUSCI_A_CTLW0_SSEL0             /**< UCSSEL Bit 0 */
//#define UCSSEL1                                  EUSCI_A_CTLW0_SSEL1             /**< UCSSEL Bit 1 */
//#define UCSSEL_1                                 EUSCI_A_CTLW0_UCSSEL_1          /**< ACLK */
//#define UCSSEL_2                                 EUSCI_A_CTLW0_UCSSEL_2          /**< SMCLK */
//#define UCSSEL_0                                 EUSCI_A_CTLW0_SSEL_0            /**< Reserved */
//#define UCSSEL__ACLK                             EUSCI_A_CTLW0_SSEL__ACLK        /**< ACLK */
//#define UCSSEL__SMCLK                            EUSCI_A_CTLW0_SSEL__SMCLK       /**< SMCLK */
/* UCA0CTLW0_SPI[UCSYNC] Bits */
//#define UCSYNC_OFS                               EUSCI_A_CTLW0_SYNC_OFS          /**< UCSYNC Offset */
//#define UCSYNC                                   EUSCI_A_CTLW0_SYNC              /**< Synchronous mode enable */
/* UCA0CTLW0_SPI[UCMODE] Bits */
//#define UCMODE_OFS                               EUSCI_A_CTLW0_MODE_OFS          /**< UCMODE Offset */
//#define UCMODE_M                                 EUSCI_A_CTLW0_MODE_MASK         /**< eUSCI mode */
//#define UCMODE0                                  EUSCI_A_CTLW0_MODE0             /**< UCMODE Bit 0 */
//#define UCMODE1                                  EUSCI_A_CTLW0_MODE1             /**< UCMODE Bit 1 */
//#define UCMODE_0                                 EUSCI_A_CTLW0_MODE_0            /**< 3-pin SPI */
//#define UCMODE_1                                 EUSCI_A_CTLW0_MODE_1            /**< 4-pin SPI with UCxSTE active high: Slave enabled when UCxSTE = 1 */
//#define UCMODE_2                                 EUSCI_A_CTLW0_MODE_2            /**< 4-pin SPI with UCxSTE active low: Slave enabled when UCxSTE = 0 */
/* UCA0CTLW0_SPI[UCMST] Bits */
#define UCMST_OFS                                EUSCI_A_CTLW0_MST_OFS           /**< UCMST Offset */
#define UCMST                                    EUSCI_A_CTLW0_MST               /**< Master mode select */
/* UCA0CTLW0_SPI[UC7BIT] Bits */
//#define UC7BIT_OFS                               EUSCI_A_CTLW0_SEVENBIT_OFS      /**< UC7BIT Offset */
//#define UC7BIT                                   EUSCI_A_CTLW0_SEVENBIT          /**< Character length */
/* UCA0CTLW0_SPI[UCMSB] Bits */
//#define UCMSB_OFS                                EUSCI_A_CTLW0_MSB_OFS           /**< UCMSB Offset */
//#define UCMSB                                    EUSCI_A_CTLW0_MSB               /**< MSB first select */
/* UCA0CTLW0_SPI[UCCKPL] Bits */
#define UCCKPL_OFS                               EUSCI_A_CTLW0_CKPL_OFS          /**< UCCKPL Offset */
#define UCCKPL                                   EUSCI_A_CTLW0_CKPL              /**< Clock polarity select */
/* UCA0CTLW0_SPI[UCCKPH] Bits */
#define UCCKPH_OFS                               EUSCI_A_CTLW0_CKPH_OFS          /**< UCCKPH Offset */
#define UCCKPH                                   EUSCI_A_CTLW0_CKPH              /**< Clock phase select */
/* UCA0CTLW1[UCGLIT] Bits */
#define UCGLIT_OFS                               EUSCI_A_CTLW1_GLIT_OFS          /**< UCGLIT Offset */
#define UCGLIT_M                                 EUSCI_A_CTLW1_GLIT_MASK         /**< Deglitch time */
#define UCGLIT0                                  EUSCI_A_CTLW1_GLIT0             /**< UCGLIT Bit 0 */
#define UCGLIT1                                  EUSCI_A_CTLW1_GLIT1             /**< UCGLIT Bit 1 */
#define UCGLIT_0                                 EUSCI_A_CTLW1_GLIT_0            /**< Approximately 2 ns (equivalent of 1 delay element) */
#define UCGLIT_1                                 EUSCI_A_CTLW1_GLIT_1            /**< Approximately 50 ns */
#define UCGLIT_2                                 EUSCI_A_CTLW1_GLIT_2            /**< Approximately 100 ns */
#define UCGLIT_3                                 EUSCI_A_CTLW1_GLIT_3            /**< Approximately 200 ns */
/* UCA0MCTLW[UCOS16] Bits */
#define UCOS16_OFS                               EUSCI_A_MCTLW_OS16_OFS          /**< UCOS16 Offset */
#define UCOS16                                   EUSCI_A_MCTLW_OS16              /**< Oversampling mode enabled */
/* UCA0MCTLW[UCBRF] Bits */
#define UCBRF_OFS                                EUSCI_A_MCTLW_BRF_OFS           /**< UCBRF Offset */
#define UCBRF_M                                  EUSCI_A_MCTLW_BRF_MASK          /**< First modulation stage select */
/* UCA0MCTLW[UCBRS] Bits */
#define UCBRS_OFS                                EUSCI_A_MCTLW_BRS_OFS           /**< UCBRS Offset */
#define UCBRS_M                                  EUSCI_A_MCTLW_BRS_MASK          /**< Second modulation stage select */
/* UCA0STATW[UCBUSY] Bits */
#define UCBUSY_OFS                               EUSCI_A_STATW_BUSY_OFS          /**< UCBUSY Offset */
#define UCBUSY                                   EUSCI_A_STATW_BUSY              /**< eUSCI_A busy */
/* UCA0STATW[UCADDR_UCIDLE] Bits */
#define UCADDR_UCIDLE_OFS                        EUSCI_A_STATW_ADDR_IDLE_OFS     /**< UCADDR_UCIDLE Offset */
#define UCADDR_UCIDLE                            EUSCI_A_STATW_ADDR_IDLE         /**< Address received / Idle line detected */
/* UCA0STATW[UCRXERR] Bits */
#define UCRXERR_OFS                              EUSCI_A_STATW_RXERR_OFS         /**< UCRXERR Offset */
#define UCRXERR                                  EUSCI_A_STATW_RXERR             /**< Receive error flag */
/* UCA0STATW[UCBRK] Bits */
#define UCBRK_OFS                                EUSCI_A_STATW_BRK_OFS           /**< UCBRK Offset */
#define UCBRK                                    EUSCI_A_STATW_BRK               /**< Break detect flag */
/* UCA0STATW[UCPE] Bits */
#define UCPE_OFS                                 EUSCI_A_STATW_PE_OFS            /**< UCPE Offset */
#define UCPE                                     EUSCI_A_STATW_PE
/* UCA0STATW[UCOE] Bits */
#define UCOE_OFS                                 EUSCI_A_STATW_OE_OFS            /**< UCOE Offset */
#define UCOE                                     EUSCI_A_STATW_OE                /**< Overrun error flag */
/* UCA0STATW[UCFE] Bits */
#define UCFE_OFS                                 EUSCI_A_STATW_FE_OFS            /**< UCFE Offset */
#define UCFE                                     EUSCI_A_STATW_FE                /**< Framing error flag */
/* UCA0STATW[UCLISTEN] Bits */
#define UCLISTEN_OFS                             EUSCI_A_STATW_LISTEN_OFS        /**< UCLISTEN Offset */
#define UCLISTEN                                 EUSCI_A_STATW_LISTEN            /**< Listen enable */
/* UCA0STATW_SPI[UCBUSY] Bits */
//#define UCBUSY_OFS                               EUSCI_A_STATW_BUSY_OFS          /**< UCBUSY Offset */
//#define UCBUSY                                   EUSCI_A_STATW_BUSY              /**< eUSCI_A busy */
/* UCA0STATW_SPI[UCOE] Bits */
//#define UCOE_OFS                                 EUSCI_A_STATW_OE_OFS            /**< UCOE Offset */
//#define UCOE                                     EUSCI_A_STATW_OE                /**< Overrun error flag */
/* UCA0STATW_SPI[UCFE] Bits */
//#define UCFE_OFS                                 EUSCI_A_STATW_FE_OFS            /**< UCFE Offset */
//#define UCFE                                     EUSCI_A_STATW_FE                /**< Framing error flag */
/* UCA0STATW_SPI[UCLISTEN] Bits */
//#define UCLISTEN_OFS                             EUSCI_A_STATW_LISTEN_OFS        /**< UCLISTEN Offset */
//#define UCLISTEN                                 EUSCI_A_STATW_LISTEN            /**< Listen enable */
/* UCA0RXBUF[UCRXBUF] Bits */
#define UCRXBUF_OFS                              EUSCI_A_RXBUF_RXBUF_OFS         /**< UCRXBUF Offset */
#define UCRXBUF_M                                EUSCI_A_RXBUF_RXBUF_MASK        /**< Receive data buffer */
/* UCA0RXBUF_SPI[UCRXBUF] Bits */
//#define UCRXBUF_OFS                              EUSCI_A_RXBUF_RXBUF_OFS         /**< UCRXBUF Offset */
//#define UCRXBUF_M                                EUSCI_A_RXBUF_RXBUF_MASK        /**< Receive data buffer */
/* UCA0TXBUF[UCTXBUF] Bits */
#define UCTXBUF_OFS                              EUSCI_A_TXBUF_TXBUF_OFS         /**< UCTXBUF Offset */
#define UCTXBUF_M                                EUSCI_A_TXBUF_TXBUF_MASK        /**< Transmit data buffer */
/* UCA0TXBUF_SPI[UCTXBUF] Bits */
//#define UCTXBUF_OFS                              EUSCI_A_TXBUF_TXBUF_OFS         /**< UCTXBUF Offset */
//#define UCTXBUF_M                                EUSCI_A_TXBUF_TXBUF_MASK        /**< Transmit data buffer */
/* UCA0ABCTL[UCABDEN] Bits */
#define UCABDEN_OFS                              EUSCI_A_ABCTL_ABDEN_OFS         /**< UCABDEN Offset */
#define UCABDEN                                  EUSCI_A_ABCTL_ABDEN             /**< Automatic baud-rate detect enable */
/* UCA0ABCTL[UCBTOE] Bits */
#define UCBTOE_OFS                               EUSCI_A_ABCTL_BTOE_OFS          /**< UCBTOE Offset */
#define UCBTOE                                   EUSCI_A_ABCTL_BTOE              /**< Break time out error */
/* UCA0ABCTL[UCSTOE] Bits */
#define UCSTOE_OFS                               EUSCI_A_ABCTL_STOE_OFS          /**< UCSTOE Offset */
#define UCSTOE                                   EUSCI_A_ABCTL_STOE              /**< Synch field time out error */
/* UCA0ABCTL[UCDELIM] Bits */
#define UCDELIM_OFS                              EUSCI_A_ABCTL_DELIM_OFS         /**< UCDELIM Offset */
#define UCDELIM_M                                EUSCI_A_ABCTL_DELIM_MASK        /**< Break/synch delimiter length */
#define UCDELIM0                                 EUSCI_A_ABCTL_DELIM0            /**< UCDELIM Bit 0 */
#define UCDELIM1                                 EUSCI_A_ABCTL_DELIM1            /**< UCDELIM Bit 1 */
#define UCDELIM_0                                EUSCI_A_ABCTL_DELIM_0           /**< 1 bit time */
#define UCDELIM_1                                EUSCI_A_ABCTL_DELIM_1           /**< 2 bit times */
#define UCDELIM_2                                EUSCI_A_ABCTL_DELIM_2           /**< 3 bit times */
#define UCDELIM_3                                EUSCI_A_ABCTL_DELIM_3           /**< 4 bit times */
/* UCA0IRCTL[UCIREN] Bits */
#define UCIREN_OFS                               EUSCI_A_IRCTL_IREN_OFS          /**< UCIREN Offset */
#define UCIREN                                   EUSCI_A_IRCTL_IREN              /**< IrDA encoder/decoder enable */
/* UCA0IRCTL[UCIRTXCLK] Bits */
#define UCIRTXCLK_OFS                            EUSCI_A_IRCTL_IRTXCLK_OFS       /**< UCIRTXCLK Offset */
#define UCIRTXCLK                                EUSCI_A_IRCTL_IRTXCLK           /**< IrDA transmit pulse clock select */
/* UCA0IRCTL[UCIRTXPL] Bits */
#define UCIRTXPL_OFS                             EUSCI_A_IRCTL_IRTXPL_OFS        /**< UCIRTXPL Offset */
#define UCIRTXPL_M                               EUSCI_A_IRCTL_IRTXPL_MASK       /**< Transmit pulse length */
/* UCA0IRCTL[UCIRRXFE] Bits */
#define UCIRRXFE_OFS                             EUSCI_A_IRCTL_IRRXFE_OFS        /**< UCIRRXFE Offset */
#define UCIRRXFE                                 EUSCI_A_IRCTL_IRRXFE            /**< IrDA receive filter enabled */
/* UCA0IRCTL[UCIRRXPL] Bits */
#define UCIRRXPL_OFS                             EUSCI_A_IRCTL_IRRXPL_OFS        /**< UCIRRXPL Offset */
#define UCIRRXPL                                 EUSCI_A_IRCTL_IRRXPL            /**< IrDA receive input UCAxRXD polarity */
/* UCA0IRCTL[UCIRRXFL] Bits */
#define UCIRRXFL_OFS                             EUSCI_A_IRCTL_IRRXFL_OFS        /**< UCIRRXFL Offset */
#define UCIRRXFL_M                               EUSCI_A_IRCTL_IRRXFL_MASK       /**< Receive filter length */
/* UCA0IE[UCRXIE] Bits */
#define UCRXIE_OFS                               EUSCI_A_IE_RXIE_OFS             /**< UCRXIE Offset */
#define UCRXIE                                   EUSCI_A_IE_RXIE                 /**< Receive interrupt enable */
/* UCA0IE[UCTXIE] Bits */
#define UCTXIE_OFS                               EUSCI_A_IE_TXIE_OFS             /**< UCTXIE Offset */
#define UCTXIE                                   EUSCI_A_IE_TXIE                 /**< Transmit interrupt enable */
/* UCA0IE[UCSTTIE] Bits */
#define UCSTTIE_OFS                              EUSCI_A_IE_STTIE_OFS            /**< UCSTTIE Offset */
#define UCSTTIE                                  EUSCI_A_IE_STTIE                /**< Start bit interrupt enable */
/* UCA0IE[UCTXCPTIE] Bits */
#define UCTXCPTIE_OFS                            EUSCI_A_IE_TXCPTIE_OFS          /**< UCTXCPTIE Offset */
#define UCTXCPTIE                                EUSCI_A_IE_TXCPTIE              /**< Transmit complete interrupt enable */
/* UCA0IE_SPI[UCRXIE] Bits */
//#define UCRXIE_OFS                               EUSCI_A__RXIE_OFS               /**< UCRXIE Offset */
//#define UCRXIE                                   EUSCI_A__RXIE                   /**< Receive interrupt enable */
/* UCA0IE_SPI[UCTXIE] Bits */
//#define UCTXIE_OFS                               EUSCI_A__TXIE_OFS               /**< UCTXIE Offset */
//#define UCTXIE                                   EUSCI_A__TXIE                   /**< Transmit interrupt enable */
/* UCA0IFG[UCRXIFG] Bits */
#define UCRXIFG_OFS                              EUSCI_A_IFG_RXIFG_OFS           /**< UCRXIFG Offset */
#define UCRXIFG                                  EUSCI_A_IFG_RXIFG               /**< Receive interrupt flag */
/* UCA0IFG[UCTXIFG] Bits */
#define UCTXIFG_OFS                              EUSCI_A_IFG_TXIFG_OFS           /**< UCTXIFG Offset */
#define UCTXIFG                                  EUSCI_A_IFG_TXIFG               /**< Transmit interrupt flag */
/* UCA0IFG[UCSTTIFG] Bits */
#define UCSTTIFG_OFS                             EUSCI_A_IFG_STTIFG_OFS          /**< UCSTTIFG Offset */
#define UCSTTIFG                                 EUSCI_A_IFG_STTIFG              /**< Start bit interrupt flag */
/* UCA0IFG[UCTXCPTIFG] Bits */
#define UCTXCPTIFG_OFS                           EUSCI_A_IFG_TXCPTIFG_OFS        /**< UCTXCPTIFG Offset */
#define UCTXCPTIFG                               EUSCI_A_IFG_TXCPTIFG            /**< Transmit ready interrupt enable */
/* UCA0IFG_SPI[UCRXIFG] Bits */
//#define UCRXIFG_OFS                              EUSCI_A_IFG_RXIFG_OFS           /**< UCRXIFG Offset */
//#define UCRXIFG                                  EUSCI_A_IFG_RXIFG               /**< Receive interrupt flag */
/* UCA0IFG_SPI[UCTXIFG] Bits */
//#define UCTXIFG_OFS                              EUSCI_A_IFG_TXIFG_OFS           /**< UCTXIFG Offset */
//#define UCTXIFG                                  EUSCI_A_IFG_TXIFG               /**< Transmit interrupt flag */


