arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/******************************************************************************
* EUSCI_B Bits (legacy section)
******************************************************************************/
/* UCB0CTLW0[UCSWRST] Bits */
//#define UCSWRST_OFS                              EUSCI_B_CTLW0_SWRST_OFS         /**< UCSWRST Offset */
//#define UCSWRST                                  EUSCI_B_CTLW0_SWRST             /**< Software reset enable */
/* UCB0CTLW0[UCTXSTT] Bits */
#define UCTXSTT_OFS                              EUSCI_B_CTLW0_TXSTT_OFS         /**< UCTXSTT Offset */
#define UCTXSTT                                  EUSCI_B_CTLW0_TXSTT             /**< Transmit START condition in master mode */
/* UCB0CTLW0[UCTXSTP] Bits */
#define UCTXSTP_OFS                              EUSCI_B_CTLW0_TXSTP_OFS         /**< UCTXSTP Offset */
#define UCTXSTP                                  EUSCI_B_CTLW0_TXSTP             /**< Transmit STOP condition in master mode */
/* UCB0CTLW0[UCTXNACK] Bits */
#define UCTXNACK_OFS                             EUSCI_B_CTLW0_TXNACK_OFS        /**< UCTXNACK Offset */
#define UCTXNACK                                 EUSCI_B_CTLW0_TXNACK            /**< Transmit a NACK */
/* UCB0CTLW0[UCTR] Bits */
#define UCTR_OFS                                 EUSCI_B_CTLW0_TR_OFS            /**< UCTR Offset */
#define UCTR                                     EUSCI_B_CTLW0_TR                /**< Transmitter/receiver */
/* UCB0CTLW0[UCTXACK] Bits */
#define UCTXACK_OFS                              EUSCI_B_CTLW0_TXACK_OFS         /**< UCTXACK Offset */
#define UCTXACK                                  EUSCI_B_CTLW0_TXACK             /**< Transmit ACK condition in slave mode */
/* UCB0CTLW0[UCSSEL] Bits */
//#define UCSSEL_OFS                               EUSCI_B_CTLW0_SSEL_OFS          /**< UCSSEL Offset */
//#define UCSSEL_M                                 EUSCI_B_CTLW0_SSEL_MASK         /**< eUSCI_B clock source select */
//#define UCSSEL0                                  EUSCI_B_CTLW0_SSEL0             /**< UCSSEL Bit 0 */
//#define UCSSEL1                                  EUSCI_B_CTLW0_SSEL1             /**< UCSSEL Bit 1 */
//#define UCSSEL_0                                 EUSCI_B_CTLW0_UCSSEL_0          /**< UCLKI */
//#define UCSSEL_1                                 EUSCI_B_CTLW0_UCSSEL_1          /**< ACLK */
//#define UCSSEL_2                                 EUSCI_B_CTLW0_UCSSEL_2          /**< SMCLK */
#define UCSSEL__UCLKI                            EUSCI_B_CTLW0_SSEL__UCLKI       /**< UCLKI */
//#define UCSSEL__ACLK                             EUSCI_B_CTLW0_SSEL__ACLK        /**< ACLK */
//#define UCSSEL__SMCLK                            EUSCI_B_CTLW0_SSEL__SMCLK       /**< SMCLK */
#define UCSSEL_3                                 EUSCI_B_CTLW0_SSEL_3            /**< SMCLK */
/* UCB0CTLW0[UCSYNC] Bits */
//#define UCSYNC_OFS                               EUSCI_B_CTLW0_SYNC_OFS          /**< UCSYNC Offset */
//#define UCSYNC                                   EUSCI_B_CTLW0_SYNC              /**< Synchronous mode enable */
/* UCB0CTLW0[UCMODE] Bits */
//#define UCMODE_OFS                               EUSCI_B_CTLW0_MODE_OFS          /**< UCMODE Offset */
//#define UCMODE_M                                 EUSCI_B_CTLW0_MODE_MASK         /**< eUSCI_B mode */
//#define UCMODE0                                  EUSCI_B_CTLW0_MODE0             /**< UCMODE Bit 0 */
//#define UCMODE1                                  EUSCI_B_CTLW0_MODE1             /**< UCMODE Bit 1 */
//#define UCMODE_0                                 EUSCI_B_CTLW0_MODE_0            /**< 3-pin SPI */
//#define UCMODE_1                                 EUSCI_B_CTLW0_MODE_1            /**< 4-pin SPI (master or slave enabled if STE = 1) */
//#define UCMODE_2                                 EUSCI_B_CTLW0_MODE_2            /**< 4-pin SPI (master or slave enabled if STE = 0) */
//#define UCMODE_3                                 EUSCI_B_CTLW0_MODE_3            /**< I2C mode */
/* UCB0CTLW0[UCMST] Bits */
//#define UCMST_OFS                                EUSCI_B_CTLW0_MST_OFS           /**< UCMST Offset */
//#define UCMST                                    EUSCI_B_CTLW0_MST               /**< Master mode select */
/* UCB0CTLW0[UCMM] Bits */
#define UCMM_OFS                                 EUSCI_B_CTLW0_MM_OFS            /**< UCMM Offset */
#define UCMM                                     EUSCI_B_CTLW0_MM                /**< Multi-master environment select */
/* UCB0CTLW0[UCSLA10] Bits */
#define UCSLA10_OFS                              EUSCI_B_CTLW0_SLA10_OFS         /**< UCSLA10 Offset */
#define UCSLA10                                  EUSCI_B_CTLW0_SLA10             /**< Slave addressing mode select */
/* UCB0CTLW0[UCA10] Bits */
#define UCA10_OFS                                EUSCI_B_CTLW0_A10_OFS           /**< UCA10 Offset */
#define UCA10                                    EUSCI_B_CTLW0_A10               /**< Own addressing mode select */
/* UCB0CTLW0_SPI[UCSWRST] Bits */
//#define UCSWRST_OFS                              EUSCI_B_CTLW0_SWRST_OFS         /**< UCSWRST Offset */
//#define UCSWRST                                  EUSCI_B_CTLW0_SWRST             /**< Software reset enable */
/* UCB0CTLW0_SPI[UCSTEM] Bits */
//#define UCSTEM_OFS                               EUSCI_B_CTLW0_STEM_OFS          /**< UCSTEM Offset */
//#define UCSTEM                                   EUSCI_B_CTLW0_STEM              /**< STE mode select in master mode. */
/* UCB0CTLW0_SPI[UCSSEL] Bits */
//#define UCSSEL_OFS                               EUSCI_B_CTLW0_SSEL_OFS          /**< UCSSEL Offset */
//#define UCSSEL_M                                 EUSCI_B_CTLW0_SSEL_MASK         /**< eUSCI_B clock source select */
//#define UCSSEL0                                  EUSCI_B_CTLW0_SSEL0             /**< UCSSEL Bit 0 */
//#define UCSSEL1                                  EUSCI_B_CTLW0_SSEL1             /**< UCSSEL Bit 1 */
//#define UCSSEL_1                                 EUSCI_B_CTLW0_UCSSEL_1          /**< ACLK */
//#define UCSSEL_2                                 EUSCI_B_CTLW0_UCSSEL_2          /**< SMCLK */
//#define UCSSEL_0                                 EUSCI_B_CTLW0_SSEL_0            /**< Reserved */
//#define UCSSEL__ACLK                             EUSCI_B_CTLW0_SSEL__ACLK        /**< ACLK */
//#define UCSSEL__SMCLK                            EUSCI_B_CTLW0_SSEL__SMCLK       /**< SMCLK */
//#define UCSSEL_3                                 EUSCI_B_CTLW0_SSEL_3            /**< SMCLK */
/* UCB0CTLW0_SPI[UCSYNC] Bits */
//#define UCSYNC_OFS                               EUSCI_B_CTLW0_SYNC_OFS          /**< UCSYNC Offset */
//#define UCSYNC                                   EUSCI_B_CTLW0_SYNC              /**< Synchronous mode enable */
/* UCB0CTLW0_SPI[UCMODE] Bits */
//#define UCMODE_OFS                               EUSCI_B_CTLW0_MODE_OFS          /**< UCMODE Offset */
//#define UCMODE_M                                 EUSCI_B_CTLW0_MODE_MASK         /**< eUSCI mode */
//#define UCMODE0                                  EUSCI_B_CTLW0_MODE0             /**< UCMODE Bit 0 */
//#define UCMODE1                                  EUSCI_B_CTLW0_MODE1             /**< UCMODE Bit 1 */
//#define UCMODE_0                                 EUSCI_B_CTLW0_MODE_0            /**< 3-pin SPI */
//#define UCMODE_1                                 EUSCI_B_CTLW0_MODE_1            /**< 4-pin SPI with UCxSTE active high: Slave enabled when UCxSTE = 1 */
//#define UCMODE_2                                 EUSCI_B_CTLW0_MODE_2            /**< 4-pin SPI with UCxSTE active low: Slave enabled when UCxSTE = 0 */
//#define UCMODE_3                                 EUSCI_B_CTLW0_MODE_3            /**< I2C mode */
/* UCB0CTLW0_SPI[UCMST] Bits */
//#define UCMST_OFS                                EUSCI_B_CTLW0_MST_OFS           /**< UCMST Offset */
//#define UCMST                                    EUSCI_B_CTLW0_MST               /**< Master mode select */
/* UCB0CTLW0_SPI[UC7BIT] Bits */
//#define UC7BIT_OFS                               EUSCI_B_CTLW0_SEVENBIT_OFS      /**< UC7BIT Offset */
//#define UC7BIT                                   EUSCI_B_CTLW0_SEVENBIT          /**< Character length */
/* UCB0CTLW0_SPI[UCMSB] Bits */
//#define UCMSB_OFS                                EUSCI_B_CTLW0_MSB_OFS           /**< UCMSB Offset */
//#define UCMSB                                    EUSCI_B_CTLW0_MSB               /**< MSB first select */
/* UCB0CTLW0_SPI[UCCKPL] Bits */
//#define UCCKPL_OFS                               EUSCI_B_CTLW0_CKPL_OFS          /**< UCCKPL Offset */
//#define UCCKPL                                   EUSCI_B_CTLW0_CKPL              /**< Clock polarity select */
/* UCB0CTLW0_SPI[UCCKPH] Bits */
//#define UCCKPH_OFS                               EUSCI_B_CTLW0_CKPH_OFS          /**< UCCKPH Offset */
//#define UCCKPH                                   EUSCI_B_CTLW0_CKPH              /**< Clock phase select */
/* UCB0CTLW1[UCGLIT] Bits */
//#define UCGLIT_OFS                               EUSCI_B_CTLW1_GLIT_OFS          /**< UCGLIT Offset */
//#define UCGLIT_M                                 EUSCI_B_CTLW1_GLIT_MASK         /**< Deglitch time */
//#define UCGLIT0                                  EUSCI_B_CTLW1_GLIT0             /**< UCGLIT Bit 0 */
//#define UCGLIT1                                  EUSCI_B_CTLW1_GLIT1             /**< UCGLIT Bit 1 */
//#define UCGLIT_0                                 EUSCI_B_CTLW1_GLIT_0            /**< 50 ns */
//#define UCGLIT_1                                 EUSCI_B_CTLW1_GLIT_1            /**< 25 ns */
//#define UCGLIT_2                                 EUSCI_B_CTLW1_GLIT_2            /**< 12.5 ns */
//#define UCGLIT_3                                 EUSCI_B_CTLW1_GLIT_3            /**< 6.25 ns */
/* UCB0CTLW1[UCASTP] Bits */
#define UCASTP_OFS                               EUSCI_B_CTLW1_ASTP_OFS          /**< UCASTP Offset */
#define UCASTP_M                                 EUSCI_B_CTLW1_ASTP_MASK         /**< Automatic STOP condition generation */
#define UCASTP0                                  EUSCI_B_CTLW1_ASTP0             /**< UCASTP Bit 0 */
#define UCASTP1                                  EUSCI_B_CTLW1_ASTP1             /**< UCASTP Bit 1 */
#define UCASTP_0                                 EUSCI_B_CTLW1_ASTP_0            /**< No automatic STOP generation. The STOP condition is generated after the user  */
                                                                                 /* sets the UCTXSTP bit. The value in UCBxTBCNT is a don't care. */
#define UCASTP_1                                 EUSCI_B_CTLW1_ASTP_1            /**< UCBCNTIFG is set with the byte counter reaches the threshold defined in  */
                                                                                 /* UCBxTBCNT */
#define UCASTP_2                                 EUSCI_B_CTLW1_ASTP_2            /**< A STOP condition is generated automatically after the byte counter value  */
                                                                                 /* reached UCBxTBCNT. UCBCNTIFG is set with the byte counter reaching the  */
                                                                                 /* threshold */
/* UCB0CTLW1[UCSWACK] Bits */
#define UCSWACK_OFS                              EUSCI_B_CTLW1_SWACK_OFS         /**< UCSWACK Offset */
#define UCSWACK                                  EUSCI_B_CTLW1_SWACK             /**< SW or HW ACK control */
/* UCB0CTLW1[UCSTPNACK] Bits */
#define UCSTPNACK_OFS                            EUSCI_B_CTLW1_STPNACK_OFS       /**< UCSTPNACK Offset */
#define UCSTPNACK                                EUSCI_B_CTLW1_STPNACK           /**< ACK all master bytes */
/* UCB0CTLW1[UCCLTO] Bits */
#define UCCLTO_OFS                               EUSCI_B_CTLW1_CLTO_OFS          /**< UCCLTO Offset */
#define UCCLTO_M                                 EUSCI_B_CTLW1_CLTO_MASK         /**< Clock low timeout select */
#define UCCLTO0                                  EUSCI_B_CTLW1_CLTO0             /**< UCCLTO Bit 0 */
#define UCCLTO1                                  EUSCI_B_CTLW1_CLTO1             /**< UCCLTO Bit 1 */
#define UCCLTO_0                                 EUSCI_B_CTLW1_CLTO_0            /**< Disable clock low timeout counter */
#define UCCLTO_1                                 EUSCI_B_CTLW1_CLTO_1            /**< 135 000 SYSCLK cycles (approximately 28 ms) */
#define UCCLTO_2                                 EUSCI_B_CTLW1_CLTO_2            /**< 150 000 SYSCLK cycles (approximately 31 ms) */
#define UCCLTO_3                                 EUSCI_B_CTLW1_CLTO_3            /**< 165 000 SYSCLK cycles (approximately 34 ms) */
/* UCB0CTLW1[UCETXINT] Bits */
#define UCETXINT_OFS                             EUSCI_B_CTLW1_ETXINT_OFS        /**< UCETXINT Offset */
#define UCETXINT                                 EUSCI_B_CTLW1_ETXINT            /**< Early UCTXIFG0 */
/* UCB0STATW[UCBBUSY] Bits */
#define UCBBUSY_OFS                              EUSCI_B_STATW_BBUSY_OFS         /**< UCBBUSY Offset */
#define UCBBUSY                                  EUSCI_B_STATW_BBUSY             /**< Bus busy */
/* UCB0STATW[UCGC] Bits */
#define UCGC_OFS                                 EUSCI_B_STATW_GC_OFS            /**< UCGC Offset */
#define UCGC                                     EUSCI_B_STATW_GC                /**< General call address received */
/* UCB0STATW[UCSCLLOW] Bits */
#define UCSCLLOW_OFS                             EUSCI_B_STATW_SCLLOW_OFS        /**< UCSCLLOW Offset */
#define UCSCLLOW                                 EUSCI_B_STATW_SCLLOW            /**< SCL low */
/* UCB0STATW[UCBCNT] Bits */
#define UCBCNT_OFS                               EUSCI_B_STATW_BCNT_OFS          /**< UCBCNT Offset */
#define UCBCNT_M                                 EUSCI_B_STATW_BCNT_MASK         /**< Hardware byte counter value */
/* UCB0STATW_SPI[UCBUSY] Bits */
//#define UCBUSY_OFS                               EUSCI_B_STATW_BUSY_OFS          /**< UCBUSY Offset */
//#define UCBUSY                                   EUSCI_B_STATW_BUSY              /**< eUSCI_B busy */
/* UCB0STATW_SPI[UCOE] Bits */
//#define UCOE_OFS                                 EUSCI_B_STATW_OE_OFS            /**< UCOE Offset */
//#define UCOE                                     EUSCI_B_STATW_OE                /**< Overrun error flag */
/* UCB0STATW_SPI[UCFE] Bits */
//#define UCFE_OFS                                 EUSCI_B_STATW_FE_OFS            /**< UCFE Offset */
//#define UCFE                                     EUSCI_B_STATW_FE                /**< Framing error flag */
/* UCB0STATW_SPI[UCLISTEN] Bits */
//#define UCLISTEN_OFS                             EUSCI_B_STATW_LISTEN_OFS        /**< UCLISTEN Offset */
//#define UCLISTEN                                 EUSCI_B_STATW_LISTEN            /**< Listen enable */
/* UCB0TBCNT[UCTBCNT] Bits */
#define UCTBCNT_OFS                              EUSCI_B_TBCNT_TBCNT_OFS         /**< UCTBCNT Offset */
#define UCTBCNT_M                                EUSCI_B_TBCNT_TBCNT_MASK        /**< Byte counter threshold value */
/* UCB0RXBUF[UCRXBUF] Bits */
//#define UCRXBUF_OFS                              EUSCI_B_RXBUF_RXBUF_OFS         /**< UCRXBUF Offset */
//#define UCRXBUF_M                                EUSCI_B_RXBUF_RXBUF_MASK        /**< Receive data buffer */
/* UCB0RXBUF_SPI[UCRXBUF] Bits */
//#define UCRXBUF_OFS                              EUSCI_B_RXBUF_RXBUF_OFS         /**< UCRXBUF Offset */
//#define UCRXBUF_M                                EUSCI_B_RXBUF_RXBUF_MASK        /**< Receive data buffer */
/* UCB0TXBUF[UCTXBUF] Bits */
//#define UCTXBUF_OFS                              EUSCI_B_TXBUF_TXBUF_OFS         /**< UCTXBUF Offset */
//#define UCTXBUF_M                                EUSCI_B_TXBUF_TXBUF_MASK        /**< Transmit data buffer */
/* UCB0TXBUF_SPI[UCTXBUF] Bits */
//#define UCTXBUF_OFS                              EUSCI_B_TXBUF_TXBUF_OFS         /**< UCTXBUF Offset */
//#define UCTXBUF_M                                EUSCI_B_TXBUF_TXBUF_MASK        /**< Transmit data buffer */
/* UCB0I2COA0[I2COA0] Bits */
#define I2COA0_OFS                               EUSCI_B_I2COA0_I2COA0_OFS       /**< I2COA0 Offset */
#define I2COA0_M                                 EUSCI_B_I2COA0_I2COA0_MASK      /**< I2C own address */
/* UCB0I2COA0[UCOAEN] Bits */
#define UCOAEN_OFS                               EUSCI_B_I2COA0_OAEN_OFS         /**< UCOAEN Offset */
#define UCOAEN                                   EUSCI_B_I2COA0_OAEN             /**< Own Address enable register */
/* UCB0I2COA0[UCGCEN] Bits */
#define UCGCEN_OFS                               EUSCI_B_I2COA0_GCEN_OFS         /**< UCGCEN Offset */
#define UCGCEN                                   EUSCI_B_I2COA0_GCEN             /**< General call response enable */
/* UCB0I2COA1[I2COA1] Bits */
#define I2COA1_OFS                               EUSCI_B_I2COA1_I2COA1_OFS       /**< I2COA1 Offset */
#define I2COA1_M                                 EUSCI_B_I2COA1_I2COA1_MASK      /**< I2C own address */
/* UCB0I2COA1[UCOAEN] Bits */
//#define UCOAEN_OFS                               EUSCI_B_I2COA1_OAEN_OFS         /**< UCOAEN Offset */
//#define UCOAEN                                   EUSCI_B_I2COA1_OAEN             /**< Own Address enable register */
/* UCB0I2COA2[I2COA2] Bits */
#define I2COA2_OFS                               EUSCI_B_I2COA2_I2COA2_OFS       /**< I2COA2 Offset */
#define I2COA2_M                                 EUSCI_B_I2COA2_I2COA2_MASK      /**< I2C own address */
/* UCB0I2COA2[UCOAEN] Bits */
//#define UCOAEN_OFS                               EUSCI_B_I2COA2_OAEN_OFS         /**< UCOAEN Offset */
//#define UCOAEN                                   EUSCI_B_I2COA2_OAEN             /**< Own Address enable register */
/* UCB0I2COA3[I2COA3] Bits */
#define I2COA3_OFS                               EUSCI_B_I2COA3_I2COA3_OFS       /**< I2COA3 Offset */
#define I2COA3_M                                 EUSCI_B_I2COA3_I2COA3_MASK      /**< I2C own address */
/* UCB0I2COA3[UCOAEN] Bits */
//#define UCOAEN_OFS                               EUSCI_B_I2COA3_OAEN_OFS         /**< UCOAEN Offset */
//#define UCOAEN                                   EUSCI_B_I2COA3_OAEN             /**< Own Address enable register */
/* UCB0ADDRX[ADDRX] Bits */
#define ADDRX_OFS                                EUSCI_B_ADDRX_ADDRX_OFS         /**< ADDRX Offset */
#define ADDRX_M                                  EUSCI_B_ADDRX_ADDRX_MASK        /**< Received Address Register */
/* UCB0ADDMASK[ADDMASK] Bits */
#define ADDMASK_OFS                              EUSCI_B_ADDMASK_ADDMASK_OFS     /**< ADDMASK Offset */
#define ADDMASK_M                                EUSCI_B_ADDMASK_ADDMASK_MASK
/* UCB0I2CSA[I2CSA] Bits */
#define I2CSA_OFS                                EUSCI_B_I2CSA_I2CSA_OFS         /**< I2CSA Offset */
#define I2CSA_M                                  EUSCI_B_I2CSA_I2CSA_MASK        /**< I2C slave address */
/* UCB0IE[UCRXIE0] Bits */
#define UCRXIE0_OFS                              EUSCI_B_IE_RXIE0_OFS            /**< UCRXIE0 Offset */
#define UCRXIE0                                  EUSCI_B_IE_RXIE0                /**< Receive interrupt enable 0 */
/* UCB0IE[UCTXIE0] Bits */
#define UCTXIE0_OFS                              EUSCI_B_IE_TXIE0_OFS            /**< UCTXIE0 Offset */
#define UCTXIE0                                  EUSCI_B_IE_TXIE0                /**< Transmit interrupt enable 0 */
/* UCB0IE[UCSTTIE] Bits */
//#define UCSTTIE_OFS                              EUSCI_B_IE_STTIE_OFS            /**< UCSTTIE Offset */
//#define UCSTTIE                                  EUSCI_B_IE_STTIE                /**< START condition interrupt enable */
/* UCB0IE[UCSTPIE] Bits */
#define UCSTPIE_OFS                              EUSCI_B_IE_STPIE_OFS            /**< UCSTPIE Offset */
#define UCSTPIE                                  EUSCI_B_IE_STPIE                /**< STOP condition interrupt enable */
/* UCB0IE[UCALIE] Bits */
#define UCALIE_OFS                               EUSCI_B_IE_ALIE_OFS             /**< UCALIE Offset */
#define UCALIE                                   EUSCI_B_IE_ALIE                 /**< Arbitration lost interrupt enable */
/* UCB0IE[UCNACKIE] Bits */
#define UCNACKIE_OFS                             EUSCI_B_IE_NACKIE_OFS           /**< UCNACKIE Offset */
#define UCNACKIE                                 EUSCI_B_IE_NACKIE               /**< Not-acknowledge interrupt enable */
/* UCB0IE[UCBCNTIE] Bits */
#define UCBCNTIE_OFS                             EUSCI_B_IE_BCNTIE_OFS           /**< UCBCNTIE Offset */
#define UCBCNTIE                                 EUSCI_B_IE_BCNTIE               /**< Byte counter interrupt enable */
/* UCB0IE[UCCLTOIE] Bits */
#define UCCLTOIE_OFS                             EUSCI_B_IE_CLTOIE_OFS           /**< UCCLTOIE Offset */
#define UCCLTOIE                                 EUSCI_B_IE_CLTOIE               /**< Clock low timeout interrupt enable */
/* UCB0IE[UCRXIE1] Bits */
#define UCRXIE1_OFS                              EUSCI_B_IE_RXIE1_OFS            /**< UCRXIE1 Offset */
#define UCRXIE1                                  EUSCI_B_IE_RXIE1                /**< Receive interrupt enable 1 */
/* UCB0IE[UCTXIE1] Bits */
#define UCTXIE1_OFS                              EUSCI_B_IE_TXIE1_OFS            /**< UCTXIE1 Offset */
#define UCTXIE1                                  EUSCI_B_IE_TXIE1                /**< Transmit interrupt enable 1 */
/* UCB0IE[UCRXIE2] Bits */
#define UCRXIE2_OFS                              EUSCI_B_IE_RXIE2_OFS            /**< UCRXIE2 Offset */
#define UCRXIE2                                  EUSCI_B_IE_RXIE2                /**< Receive interrupt enable 2 */
/* UCB0IE[UCTXIE2] Bits */
#define UCTXIE2_OFS                              EUSCI_B_IE_TXIE2_OFS            /**< UCTXIE2 Offset */
#define UCTXIE2                                  EUSCI_B_IE_TXIE2                /**< Transmit interrupt enable 2 */
/* UCB0IE[UCRXIE3] Bits */
#define UCRXIE3_OFS                              EUSCI_B_IE_RXIE3_OFS            /**< UCRXIE3 Offset */
#define UCRXIE3                                  EUSCI_B_IE_RXIE3                /**< Receive interrupt enable 3 */
/* UCB0IE[UCTXIE3] Bits */
#define UCTXIE3_OFS                              EUSCI_B_IE_TXIE3_OFS            /**< UCTXIE3 Offset */
#define UCTXIE3                                  EUSCI_B_IE_TXIE3                /**< Transmit interrupt enable 3 */
/* UCB0IE[UCBIT9IE] Bits */
#define UCBIT9IE_OFS                             EUSCI_B_IE_BIT9IE_OFS           /**< UCBIT9IE Offset */
#define UCBIT9IE                                 EUSCI_B_IE_BIT9IE               /**< Bit position 9 interrupt enable */
/* UCB0IE_SPI[UCRXIE] Bits */
//#define UCRXIE_OFS                               EUSCI_B__RXIE_OFS               /**< UCRXIE Offset */
//#define UCRXIE                                   EUSCI_B__RXIE                   /**< Receive interrupt enable */
/* UCB0IE_SPI[UCTXIE] Bits */
//#define UCTXIE_OFS                               EUSCI_B__TXIE_OFS               /**< UCTXIE Offset */
//#define UCTXIE                                   EUSCI_B__TXIE                   /**< Transmit interrupt enable */
/* UCB0IFG[UCRXIFG0] Bits */
#define UCRXIFG0_OFS                             EUSCI_B_IFG_RXIFG0_OFS          /**< UCRXIFG0 Offset */
#define UCRXIFG0                                 EUSCI_B_IFG_RXIFG0              /**< eUSCI_B receive interrupt flag 0 */
/* UCB0IFG[UCTXIFG0] Bits */
#define UCTXIFG0_OFS                             EUSCI_B_IFG_TXIFG0_OFS          /**< UCTXIFG0 Offset */
#define UCTXIFG0                                 EUSCI_B_IFG_TXIFG0              /**< eUSCI_B transmit interrupt flag 0 */
/* UCB0IFG[UCSTTIFG] Bits */
