arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
//#define UCSTTIFG_OFS                             EUSCI_B_IFG_STTIFG_OFS          /**< UCSTTIFG Offset */
//#define UCSTTIFG                                 EUSCI_B_IFG_STTIFG              /**< START condition interrupt flag */
/* UCB0IFG[UCSTPIFG] Bits */
#define UCSTPIFG_OFS                             EUSCI_B_IFG_STPIFG_OFS          /**< UCSTPIFG Offset */
#define UCSTPIFG                                 EUSCI_B_IFG_STPIFG              /**< STOP condition interrupt flag */
/* UCB0IFG[UCALIFG] Bits */
#define UCALIFG_OFS                              EUSCI_B_IFG_ALIFG_OFS           /**< UCALIFG Offset */
#define UCALIFG                                  EUSCI_B_IFG_ALIFG               /**< Arbitration lost interrupt flag */
/* UCB0IFG[UCNACKIFG] Bits */
#define UCNACKIFG_OFS                            EUSCI_B_IFG_NACKIFG_OFS         /**< UCNACKIFG Offset */
#define UCNACKIFG                                EUSCI_B_IFG_NACKIFG             /**< Not-acknowledge received interrupt flag */
/* UCB0IFG[UCBCNTIFG] Bits */
#define UCBCNTIFG_OFS                            EUSCI_B_IFG_BCNTIFG_OFS         /**< UCBCNTIFG Offset */
#define UCBCNTIFG                                EUSCI_B_IFG_BCNTIFG             /**< Byte counter interrupt flag */
/* UCB0IFG[UCCLTOIFG] Bits */
#define UCCLTOIFG_OFS                            EUSCI_B_IFG_CLTOIFG_OFS         /**< UCCLTOIFG Offset */
#define UCCLTOIFG                                EUSCI_B_IFG_CLTOIFG             /**< Clock low timeout interrupt flag */
/* UCB0IFG[UCRXIFG1] Bits */
#define UCRXIFG1_OFS                             EUSCI_B_IFG_RXIFG1_OFS          /**< UCRXIFG1 Offset */
#define UCRXIFG1                                 EUSCI_B_IFG_RXIFG1              /**< eUSCI_B receive interrupt flag 1 */
/* UCB0IFG[UCTXIFG1] Bits */
#define UCTXIFG1_OFS                             EUSCI_B_IFG_TXIFG1_OFS          /**< UCTXIFG1 Offset */
#define UCTXIFG1                                 EUSCI_B_IFG_TXIFG1              /**< eUSCI_B transmit interrupt flag 1 */
/* UCB0IFG[UCRXIFG2] Bits */
#define UCRXIFG2_OFS                             EUSCI_B_IFG_RXIFG2_OFS          /**< UCRXIFG2 Offset */
#define UCRXIFG2                                 EUSCI_B_IFG_RXIFG2              /**< eUSCI_B receive interrupt flag 2 */
/* UCB0IFG[UCTXIFG2] Bits */
#define UCTXIFG2_OFS                             EUSCI_B_IFG_TXIFG2_OFS          /**< UCTXIFG2 Offset */
#define UCTXIFG2                                 EUSCI_B_IFG_TXIFG2              /**< eUSCI_B transmit interrupt flag 2 */
/* UCB0IFG[UCRXIFG3] Bits */
#define UCRXIFG3_OFS                             EUSCI_B_IFG_RXIFG3_OFS          /**< UCRXIFG3 Offset */
#define UCRXIFG3                                 EUSCI_B_IFG_RXIFG3              /**< eUSCI_B receive interrupt flag 3 */
/* UCB0IFG[UCTXIFG3] Bits */
#define UCTXIFG3_OFS                             EUSCI_B_IFG_TXIFG3_OFS          /**< UCTXIFG3 Offset */
#define UCTXIFG3                                 EUSCI_B_IFG_TXIFG3              /**< eUSCI_B transmit interrupt flag 3 */
/* UCB0IFG[UCBIT9IFG] Bits */
#define UCBIT9IFG_OFS                            EUSCI_B_IFG_BIT9IFG_OFS         /**< UCBIT9IFG Offset */
#define UCBIT9IFG                                EUSCI_B_IFG_BIT9IFG             /**< Bit position 9 interrupt flag */
/* UCB0IFG_SPI[UCRXIFG] Bits */
//#define UCRXIFG_OFS                              EUSCI_B_IFG_RXIFG_OFS           /**< UCRXIFG Offset */
//#define UCRXIFG                                  EUSCI_B_IFG_RXIFG               /**< Receive interrupt flag */
/* UCB0IFG_SPI[UCTXIFG] Bits */
//#define UCTXIFG_OFS                              EUSCI_B_IFG_TXIFG_OFS           /**< UCTXIFG Offset */
//#define UCTXIFG                                  EUSCI_B_IFG_TXIFG               /**< Transmit interrupt flag */


/******************************************************************************
* PMAP Bits (legacy section)
******************************************************************************/
/* PMAPCTL[PMAPLOCKED] Bits */
#define PMAPLOCKED_OFS                           PMAP_CTL_LOCKED_OFS             /**< PMAPLOCKED Offset */
#define PMAPLOCKED                               PMAP_CTL_LOCKED                 /**< Port mapping lock bit */
/* PMAPCTL[PMAPRECFG] Bits */
#define PMAPRECFG_OFS                            PMAP_CTL_PRECFG_OFS             /**< PMAPRECFG Offset */
#define PMAPRECFG                                PMAP_CTL_PRECFG                 /**< Port mapping reconfiguration control bit */

/* Pre-defined bitfield values */
/* PMAP_PMAPCTL[PMAPLOCKED] Bits */
#define PMAPLOCKED_OFS                                     PMAP_CTL_LOCKED_OFS   /* PMAPLOCKED Offset */
#define PMAPLOCKED                                         PMAP_CTL_LOCKED       /* Port mapping lock bit */
/* PMAP_PMAPCTL[PMAPRECFG] Bits */
#define PMAPRECFG_OFS                                      PMAP_CTL_PRECFG_OFS   /* PMAPRECFG Offset */
#define PMAPRECFG                                          PMAP_CTL_PRECFG       /* Port mapping reconfiguration control bit */

#define PM_NONE                                            PMAP_NONE
#define PM_UCA0CLK                                         PMAP_UCA0CLK
#define PM_UCA0RXD                                         PMAP_UCA0RXD
#define PM_UCA0SOMI                                        PMAP_UCA0SOMI
#define PM_UCA0TXD                                         PMAP_UCA0TXD
#define PM_UCA0SIMO                                        PMAP_UCA0SIMO
#define PM_UCB0CLK                                         PMAP_UCB0CLK
#define PM_UCB0SDA                                         PMAP_UCB0SDA
#define PM_UCB0SIMO                                        PMAP_UCB0SIMO
#define PM_UCB0SCL                                         PMAP_UCB0SCL
#define PM_UCB0SOMI                                        PMAP_UCB0SOMI
#define PM_UCA1STE                                         PMAP_UCA1STE
#define PM_UCA1CLK                                         PMAP_UCA1CLK
#define PM_UCA1RXD                                         PMAP_UCA1RXD
#define PM_UCA1SOMI                                        PMAP_UCA1SOMI
#define PM_UCA1TXD                                         PMAP_UCA1TXD
#define PM_UCA1SIMO                                        PMAP_UCA1SIMO
#define PM_UCA2STE                                         PMAP_UCA2STE
#define PM_UCA2CLK                                         PMAP_UCA2CLK
#define PM_UCA2RXD                                         PMAP_UCA2RXD
#define PM_UCA2SOMI                                        PMAP_UCA2SOMI
#define PM_UCA2TXD                                         PMAP_UCA2TXD
#define PM_UCA2SIMO                                        PMAP_UCA2SIMO
#define PM_UCB2STE                                         PMAP_UCB2STE
#define PM_UCB2CLK                                         PMAP_UCB2CLK
#define PM_UCB2SDA                                         PMAP_UCB2SDA
#define PM_UCB2SIMO                                        PMAP_UCB2SIMO
#define PM_UCB2SCL                                         PMAP_UCB2SCL
#define PM_UCB2SOMI                                        PMAP_UCB2SOMI
#define PM_TA0CCR0A                                        PMAP_TA0CCR0A
#define PM_TA0CCR1A                                        PMAP_TA0CCR1A
#define PM_TA0CCR2A                                        PMAP_TA0CCR2A
#define PM_TA0CCR3A                                        PMAP_TA0CCR3A
#define PM_TA0CCR4A                                        PMAP_TA0CCR4A
#define PM_TA1CCR1A                                        PMAP_TA1CCR1A
#define PM_TA1CCR2A                                        PMAP_TA1CCR2A
#define PM_TA1CCR3A                                        PMAP_TA1CCR3A
#define PM_TA1CCR4A                                        PMAP_TA1CCR4A
#define PM_TA0CLK                                          PMAP_TA0CLK
#define PM_CE0OUT                                          PMAP_CE0OUT
#define PM_TA1CLK                                          PMAP_TA1CLK
#define PM_CE1OUT                                          PMAP_CE1OUT
#define PM_DMAE0                                           PMAP_DMAE0
#define PM_SMCLK                                           PMAP_SMCLK
#define PM_ANALOG                                          PMAP_ANALOG

#define PMAPKEY                                            PMAP_KEYID_VAL        /**< Port Mapping Key */
#define PMAPPWD                                            PMAP_KEYID_VAL        /**< Legacy Definition: Mapping Key register */
#define PMAPPW                                             PMAP_KEYID_VAL        /**< Legacy Definition: Port Mapping Password */


