arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/******************************************************************************
* REF_A Bits (legacy section)
******************************************************************************/
/* REFCTL0[REFON] Bits */
#define REFON_OFS                                REF_A_CTL0_ON_OFS               /**< REFON Offset */
#define REFON                                    REF_A_CTL0_ON                   /**< Reference enable */
/* REFCTL0[REFOUT] Bits */
#define REFOUT_OFS                               REF_A_CTL0_OUT_OFS              /**< REFOUT Offset */
#define REFOUT                                   REF_A_CTL0_OUT                  /**< Reference output buffer */
/* REFCTL0[REFTCOFF] Bits */
#define REFTCOFF_OFS                             REF_A_CTL0_TCOFF_OFS            /**< REFTCOFF Offset */
#define REFTCOFF                                 REF_A_CTL0_TCOFF                /**< Temperature sensor disabled */
/* REFCTL0[REFVSEL] Bits */
#define REFVSEL_OFS                              REF_A_CTL0_VSEL_OFS             /**< REFVSEL Offset */
#define REFVSEL_M                                REF_A_CTL0_VSEL_MASK            /**< Reference voltage level select */
#define REFVSEL0                                 REF_A_CTL0_VSEL0                /**< REFVSEL Bit 0 */
#define REFVSEL1                                 REF_A_CTL0_VSEL1                /**< REFVSEL Bit 1 */
#define REFVSEL_0                                REF_A_CTL0_VSEL_0               /**< 1.2 V available when reference requested or REFON = 1 */
#define REFVSEL_1                                REF_A_CTL0_VSEL_1               /**< 1.45 V available when reference requested or REFON = 1 */
#define REFVSEL_3                                REF_A_CTL0_VSEL_3               /**< 2.5 V available when reference requested or REFON = 1 */
/* REFCTL0[REFGENOT] Bits */
#define REFGENOT_OFS                             REF_A_CTL0_GENOT_OFS            /**< REFGENOT Offset */
#define REFGENOT                                 REF_A_CTL0_GENOT                /**< Reference generator one-time trigger */
/* REFCTL0[REFBGOT] Bits */
#define REFBGOT_OFS                              REF_A_CTL0_BGOT_OFS             /**< REFBGOT Offset */
#define REFBGOT                                  REF_A_CTL0_BGOT                 /**< Bandgap and bandgap buffer one-time trigger */
/* REFCTL0[REFGENACT] Bits */
#define REFGENACT_OFS                            REF_A_CTL0_GENACT_OFS           /**< REFGENACT Offset */
#define REFGENACT                                REF_A_CTL0_GENACT               /**< Reference generator active */
/* REFCTL0[REFBGACT] Bits */
#define REFBGACT_OFS                             REF_A_CTL0_BGACT_OFS            /**< REFBGACT Offset */
#define REFBGACT                                 REF_A_CTL0_BGACT                /**< Reference bandgap active */
/* REFCTL0[REFGENBUSY] Bits */
#define REFGENBUSY_OFS                           REF_A_CTL0_GENBUSY_OFS          /**< REFGENBUSY Offset */
#define REFGENBUSY                               REF_A_CTL0_GENBUSY              /**< Reference generator busy */
/* REFCTL0[BGMODE] Bits */
#define BGMODE_OFS                               REF_A_CTL0_BGMODE_OFS           /**< BGMODE Offset */
#define BGMODE                                   REF_A_CTL0_BGMODE               /**< Bandgap mode */
/* REFCTL0[REFGENRDY] Bits */
#define REFGENRDY_OFS                            REF_A_CTL0_GENRDY_OFS           /**< REFGENRDY Offset */
#define REFGENRDY                                REF_A_CTL0_GENRDY               /**< Variable reference voltage ready status */
/* REFCTL0[REFBGRDY] Bits */
#define REFBGRDY_OFS                             REF_A_CTL0_BGRDY_OFS            /**< REFBGRDY Offset */
#define REFBGRDY                                 REF_A_CTL0_BGRDY                /**< Buffered bandgap voltage ready status */


/******************************************************************************
* RTC_C Bits (legacy section)
******************************************************************************/
/* RTCCTL0[RTCRDYIFG] Bits */
#define RTCRDYIFG_OFS                            RTC_C_CTL0_RDYIFG_OFS           /**< RTCRDYIFG Offset */
#define RTCRDYIFG                                RTC_C_CTL0_RDYIFG               /**< Real-time clock ready interrupt flag */
/* RTCCTL0[RTCAIFG] Bits */
#define RTCAIFG_OFS                              RTC_C_CTL0_AIFG_OFS             /**< RTCAIFG Offset */
#define RTCAIFG                                  RTC_C_CTL0_AIFG                 /**< Real-time clock alarm interrupt flag */
/* RTCCTL0[RTCTEVIFG] Bits */
#define RTCTEVIFG_OFS                            RTC_C_CTL0_TEVIFG_OFS           /**< RTCTEVIFG Offset */
#define RTCTEVIFG                                RTC_C_CTL0_TEVIFG               /**< Real-time clock time event interrupt flag */
/* RTCCTL0[RTCOFIFG] Bits */
#define RTCOFIFG_OFS                             RTC_C_CTL0_OFIFG_OFS            /**< RTCOFIFG Offset */
#define RTCOFIFG                                 RTC_C_CTL0_OFIFG                /**< 32-kHz crystal oscillator fault interrupt flag */
/* RTCCTL0[RTCRDYIE] Bits */
#define RTCRDYIE_OFS                             RTC_C_CTL0_RDYIE_OFS            /**< RTCRDYIE Offset */
#define RTCRDYIE                                 RTC_C_CTL0_RDYIE                /**< Real-time clock ready interrupt enable */
/* RTCCTL0[RTCAIE] Bits */
#define RTCAIE_OFS                               RTC_C_CTL0_AIE_OFS              /**< RTCAIE Offset */
#define RTCAIE                                   RTC_C_CTL0_AIE                  /**< Real-time clock alarm interrupt enable */
/* RTCCTL0[RTCTEVIE] Bits */
#define RTCTEVIE_OFS                             RTC_C_CTL0_TEVIE_OFS            /**< RTCTEVIE Offset */
#define RTCTEVIE                                 RTC_C_CTL0_TEVIE                /**< Real-time clock time event interrupt enable */
/* RTCCTL0[RTCOFIE] Bits */
#define RTCOFIE_OFS                              RTC_C_CTL0_OFIE_OFS             /**< RTCOFIE Offset */
#define RTCOFIE                                  RTC_C_CTL0_OFIE                 /**< 32-kHz crystal oscillator fault interrupt enable */
/* RTCCTL0[RTCKEY] Bits */
#define RTCKEY_OFS                               RTC_C_CTL0_KEY_OFS              /**< RTCKEY Offset */
#define RTCKEY_M                                 RTC_C_CTL0_KEY_MASK             /**< Real-time clock key */
/* RTCCTL13[RTCTEV] Bits */
#define RTCTEV_OFS                               RTC_C_CTL13_TEV_OFS             /**< RTCTEV Offset */
#define RTCTEV_M                                 RTC_C_CTL13_TEV_MASK            /**< Real-time clock time event */
#define RTCTEV0                                  RTC_C_CTL13_TEV0                /**< RTCTEV Bit 0 */
#define RTCTEV1                                  RTC_C_CTL13_TEV1                /**< RTCTEV Bit 1 */
#define RTCTEV_0                                 RTC_C_CTL13_TEV_0               /**< Minute changed */
#define RTCTEV_1                                 RTC_C_CTL13_TEV_1               /**< Hour changed */
#define RTCTEV_2                                 RTC_C_CTL13_TEV_2               /**< Every day at midnight (00:00) */
#define RTCTEV_3                                 RTC_C_CTL13_TEV_3               /**< Every day at noon (12:00) */
/* RTCCTL13[RTCSSEL] Bits */
#define RTCSSEL_OFS                              RTC_C_CTL13_SSEL_OFS            /**< RTCSSEL Offset */
#define RTCSSEL_M                                RTC_C_CTL13_SSEL_MASK           /**< Real-time clock source select */
#define RTCSSEL0                                 RTC_C_CTL13_SSEL0               /**< RTCSSEL Bit 0 */
#define RTCSSEL1                                 RTC_C_CTL13_SSEL1               /**< RTCSSEL Bit 1 */
#define RTCSSEL_0                                RTC_C_CTL13_SSEL_0              /**< BCLK */
#define RTCSSEL__BCLK                            RTC_C_CTL13_SSEL__BCLK          /**< BCLK */
/* RTCCTL13[RTCRDY] Bits */
#define RTCRDY_OFS                               RTC_C_CTL13_RDY_OFS             /**< RTCRDY Offset */
#define RTCRDY                                   RTC_C_CTL13_RDY                 /**< Real-time clock ready */
/* RTCCTL13[RTCMODE] Bits */
#define RTCMODE_OFS                              RTC_C_CTL13_MODE_OFS            /**< RTCMODE Offset */
#define RTCMODE                                  RTC_C_CTL13_MODE
/* RTCCTL13[RTCHOLD] Bits */
#define RTCHOLD_OFS                              RTC_C_CTL13_HOLD_OFS            /**< RTCHOLD Offset */
#define RTCHOLD                                  RTC_C_CTL13_HOLD                /**< Real-time clock hold */
/* RTCCTL13[RTCBCD] Bits */
#define RTCBCD_OFS                               RTC_C_CTL13_BCD_OFS             /**< RTCBCD Offset */
#define RTCBCD                                   RTC_C_CTL13_BCD                 /**< Real-time clock BCD select */
/* RTCCTL13[RTCCALF] Bits */
#define RTCCALF_OFS                              RTC_C_CTL13_CALF_OFS            /**< RTCCALF Offset */
#define RTCCALF_M                                RTC_C_CTL13_CALF_MASK           /**< Real-time clock calibration frequency */
#define RTCCALF0                                 RTC_C_CTL13_CALF0               /**< RTCCALF Bit 0 */
#define RTCCALF1                                 RTC_C_CTL13_CALF1               /**< RTCCALF Bit 1 */
#define RTCCALF_0                                RTC_C_CTL13_CALF_0              /**< No frequency output to RTCCLK pin */
#define RTCCALF_1                                RTC_C_CTL13_CALF_1              /**< 512 Hz */
#define RTCCALF_2                                RTC_C_CTL13_CALF_2              /**< 256 Hz */
#define RTCCALF_3                                RTC_C_CTL13_CALF_3              /**< 1 Hz */
#define RTCCALF__NONE                            RTC_C_CTL13_CALF__NONE          /**< No frequency output to RTCCLK pin */
#define RTCCALF__512                             RTC_C_CTL13_CALF__512           /**< 512 Hz */
#define RTCCALF__256                             RTC_C_CTL13_CALF__256           /**< 256 Hz */
#define RTCCALF__1                               RTC_C_CTL13_CALF__1             /**< 1 Hz */
/* RTCOCAL[RTCOCAL] Bits */
#define RTCOCAL_OFS                              RTC_C_OCAL_OCAL_OFS             /**< RTCOCAL Offset */
#define RTCOCAL_M                                RTC_C_OCAL_OCAL_MASK            /**< Real-time clock offset error calibration */
/* RTCOCAL[RTCOCALS] Bits */
#define RTCOCALS_OFS                             RTC_C_OCAL_OCALS_OFS            /**< RTCOCALS Offset */
#define RTCOCALS                                 RTC_C_OCAL_OCALS                /**< Real-time clock offset error calibration sign */
/* RTCTCMP[RTCTCMP] Bits */
#define RTCTCMP_OFS                              RTC_C_TCMP_TCMPX_OFS            /**< RTCTCMP Offset */
#define RTCTCMP_M                                RTC_C_TCMP_TCMPX_MASK           /**< Real-time clock temperature compensation */
/* RTCTCMP[RTCTCOK] Bits */
#define RTCTCOK_OFS                              RTC_C_TCMP_TCOK_OFS             /**< RTCTCOK Offset */
#define RTCTCOK                                  RTC_C_TCMP_TCOK                 /**< Real-time clock temperature compensation write OK */
/* RTCTCMP[RTCTCRDY] Bits */
#define RTCTCRDY_OFS                             RTC_C_TCMP_TCRDY_OFS            /**< RTCTCRDY Offset */
#define RTCTCRDY                                 RTC_C_TCMP_TCRDY                /**< Real-time clock temperature compensation ready */
/* RTCTCMP[RTCTCMPS] Bits */
#define RTCTCMPS_OFS                             RTC_C_TCMP_TCMPS_OFS            /**< RTCTCMPS Offset */
#define RTCTCMPS                                 RTC_C_TCMP_TCMPS                /**< Real-time clock temperature compensation sign */
/* RTCPS0CTL[RT0PSIFG] Bits */
#define RT0PSIFG_OFS                             RTC_C_PS0CTL_RT0PSIFG_OFS       /**< RT0PSIFG Offset */
#define RT0PSIFG                                 RTC_C_PS0CTL_RT0PSIFG           /**< Prescale timer 0 interrupt flag */
/* RTCPS0CTL[RT0PSIE] Bits */
#define RT0PSIE_OFS                              RTC_C_PS0CTL_RT0PSIE_OFS        /**< RT0PSIE Offset */
#define RT0PSIE                                  RTC_C_PS0CTL_RT0PSIE            /**< Prescale timer 0 interrupt enable */
/* RTCPS0CTL[RT0IP] Bits */
#define RT0IP_OFS                                RTC_C_PS0CTL_RT0IP_OFS          /**< RT0IP Offset */
#define RT0IP_M                                  RTC_C_PS0CTL_RT0IP_MASK         /**< Prescale timer 0 interrupt interval */
#define RT0IP0                                   RTC_C_PS0CTL_RT0IP0             /**< RT0IP Bit 0 */
#define RT0IP1                                   RTC_C_PS0CTL_RT0IP1             /**< RT0IP Bit 1 */
#define RT0IP2                                   RTC_C_PS0CTL_RT0IP2             /**< RT0IP Bit 2 */
#define RT0IP_0                                  RTC_C_PS0CTL_RT0IP_0            /**< Divide by 2 */
#define RT0IP_1                                  RTC_C_PS0CTL_RT0IP_1            /**< Divide by 4 */
#define RT0IP_2                                  RTC_C_PS0CTL_RT0IP_2            /**< Divide by 8 */
#define RT0IP_3                                  RTC_C_PS0CTL_RT0IP_3            /**< Divide by 16 */
#define RT0IP_4                                  RTC_C_PS0CTL_RT0IP_4            /**< Divide by 32 */
#define RT0IP_5                                  RTC_C_PS0CTL_RT0IP_5            /**< Divide by 64 */
#define RT0IP_6                                  RTC_C_PS0CTL_RT0IP_6            /**< Divide by 128 */
#define RT0IP_7                                  RTC_C_PS0CTL_RT0IP_7            /**< Divide by 256 */
#define RT0IP__2                                 RTC_C_PS0CTL_RT0IP__2           /**< Divide by 2 */
#define RT0IP__4                                 RTC_C_PS0CTL_RT0IP__4           /**< Divide by 4 */
#define RT0IP__8                                 RTC_C_PS0CTL_RT0IP__8           /**< Divide by 8 */
#define RT0IP__16                                RTC_C_PS0CTL_RT0IP__16          /**< Divide by 16 */
#define RT0IP__32                                RTC_C_PS0CTL_RT0IP__32          /**< Divide by 32 */
#define RT0IP__64                                RTC_C_PS0CTL_RT0IP__64          /**< Divide by 64 */
#define RT0IP__128                               RTC_C_PS0CTL_RT0IP__128         /**< Divide by 128 */
#define RT0IP__256                               RTC_C_PS0CTL_RT0IP__256         /**< Divide by 256 */
/* RTCPS1CTL[RT1PSIFG] Bits */
#define RT1PSIFG_OFS                             RTC_C_PS1CTL_RT1PSIFG_OFS       /**< RT1PSIFG Offset */
#define RT1PSIFG                                 RTC_C_PS1CTL_RT1PSIFG           /**< Prescale timer 1 interrupt flag */
/* RTCPS1CTL[RT1PSIE] Bits */
#define RT1PSIE_OFS                              RTC_C_PS1CTL_RT1PSIE_OFS        /**< RT1PSIE Offset */
#define RT1PSIE                                  RTC_C_PS1CTL_RT1PSIE            /**< Prescale timer 1 interrupt enable */
/* RTCPS1CTL[RT1IP] Bits */
#define RT1IP_OFS                                RTC_C_PS1CTL_RT1IP_OFS          /**< RT1IP Offset */
#define RT1IP_M                                  RTC_C_PS1CTL_RT1IP_MASK         /**< Prescale timer 1 interrupt interval */
#define RT1IP0                                   RTC_C_PS1CTL_RT1IP0             /**< RT1IP Bit 0 */
#define RT1IP1                                   RTC_C_PS1CTL_RT1IP1             /**< RT1IP Bit 1 */
#define RT1IP2                                   RTC_C_PS1CTL_RT1IP2             /**< RT1IP Bit 2 */
#define RT1IP_0                                  RTC_C_PS1CTL_RT1IP_0            /**< Divide by 2 */
#define RT1IP_1                                  RTC_C_PS1CTL_RT1IP_1            /**< Divide by 4 */
#define RT1IP_2                                  RTC_C_PS1CTL_RT1IP_2            /**< Divide by 8 */
#define RT1IP_3                                  RTC_C_PS1CTL_RT1IP_3            /**< Divide by 16 */
#define RT1IP_4                                  RTC_C_PS1CTL_RT1IP_4            /**< Divide by 32 */
#define RT1IP_5                                  RTC_C_PS1CTL_RT1IP_5            /**< Divide by 64 */
#define RT1IP_6                                  RTC_C_PS1CTL_RT1IP_6            /**< Divide by 128 */
#define RT1IP_7                                  RTC_C_PS1CTL_RT1IP_7            /**< Divide by 256 */
#define RT1IP__2                                 RTC_C_PS1CTL_RT1IP__2           /**< Divide by 2 */
#define RT1IP__4                                 RTC_C_PS1CTL_RT1IP__4           /**< Divide by 4 */
#define RT1IP__8                                 RTC_C_PS1CTL_RT1IP__8           /**< Divide by 8 */
#define RT1IP__16                                RTC_C_PS1CTL_RT1IP__16          /**< Divide by 16 */
#define RT1IP__32                                RTC_C_PS1CTL_RT1IP__32          /**< Divide by 32 */
#define RT1IP__64                                RTC_C_PS1CTL_RT1IP__64          /**< Divide by 64 */
#define RT1IP__128                               RTC_C_PS1CTL_RT1IP__128         /**< Divide by 128 */
#define RT1IP__256                               RTC_C_PS1CTL_RT1IP__256         /**< Divide by 256 */
/* RTCPS[RT0PS] Bits */
#define RT0PS_OFS                                RTC_C_PS_RT0PS_OFS              /**< RT0PS Offset */
#define RT0PS_M                                  RTC_C_PS_RT0PS_MASK             /**< Prescale timer 0 counter value */
/* RTCPS[RT1PS] Bits */
#define RT1PS_OFS                                RTC_C_PS_RT1PS_OFS              /**< RT1PS Offset */
#define RT1PS_M                                  RTC_C_PS_RT1PS_MASK             /**< Prescale timer 1 counter value */
/* RTCTIM0[SECONDS] Bits */
#define SECONDS_OFS                              RTC_C_TIM0_SEC_OFS              /**< Seconds Offset */
#define SECONDS_M                                RTC_C_TIM0_SEC_MASK             /**< Seconds (0 to 59) */
/* RTCTIM0[MINUTES] Bits */
#define MINUTES_OFS                              RTC_C_TIM0_MIN_OFS              /**< Minutes Offset */
#define MINUTES_M                                RTC_C_TIM0_MIN_MASK             /**< Minutes (0 to 59) */
/* RTCTIM0_BCD[SECONDSLOWDIGIT] Bits */
#define SECONDSLOWDIGIT_OFS                      RTC_C_TIM0_SEC_LD_OFS           /**< SecondsLowDigit Offset */
#define SECONDSLOWDIGIT_M                        RTC_C_TIM0_SEC_LD_MASK          /**< Seconds ? low digit (0 to 9) */
/* RTCTIM0_BCD[SECONDSHIGHDIGIT] Bits */
#define SECONDSHIGHDIGIT_OFS                     RTC_C_TIM0_SEC_HD_OFS           /**< SecondsHighDigit Offset */
#define SECONDSHIGHDIGIT_M                       RTC_C_TIM0_SEC_HD_MASK          /**< Seconds ? high digit (0 to 5) */
/* RTCTIM0_BCD[MINUTESLOWDIGIT] Bits */
#define MINUTESLOWDIGIT_OFS                      RTC_C_TIM0_MIN_LD_OFS           /**< MinutesLowDigit Offset */
#define MINUTESLOWDIGIT_M                        RTC_C_TIM0_MIN_LD_MASK          /**< Minutes ? low digit (0 to 9) */
/* RTCTIM0_BCD[MINUTESHIGHDIGIT] Bits */
#define MINUTESHIGHDIGIT_OFS                     RTC_C_TIM0_MIN_HD_OFS           /**< MinutesHighDigit Offset */
#define MINUTESHIGHDIGIT_M                       RTC_C_TIM0_MIN_HD_MASK          /**< Minutes ? high digit (0 to 5) */
/* RTCTIM1[HOURS] Bits */
#define HOURS_OFS                                RTC_C_TIM1_HOUR_OFS             /**< Hours Offset */
#define HOURS_M                                  RTC_C_TIM1_HOUR_MASK            /**< Hours (0 to 23) */
/* RTCTIM1[DAYOFWEEK] Bits */
#define DAYOFWEEK_OFS                            RTC_C_TIM1_DOW_OFS              /**< DayofWeek Offset */
#define DAYOFWEEK_M                              RTC_C_TIM1_DOW_MASK             /**< Day of week (0 to 6) */
/* RTCTIM1_BCD[HOURSLOWDIGIT] Bits */
#define HOURSLOWDIGIT_OFS                        RTC_C_TIM1_HOUR_LD_OFS          /**< HoursLowDigit Offset */
#define HOURSLOWDIGIT_M                          RTC_C_TIM1_HOUR_LD_MASK         /**< Hours ? low digit (0 to 9) */
/* RTCTIM1_BCD[HOURSHIGHDIGIT] Bits */
#define HOURSHIGHDIGIT_OFS                       RTC_C_TIM1_HOUR_HD_OFS          /**< HoursHighDigit Offset */
#define HOURSHIGHDIGIT_M                         RTC_C_TIM1_HOUR_HD_MASK         /**< Hours ? high digit (0 to 2) */
/* RTCTIM1_BCD[DAYOFWEEK] Bits */
//#define DAYOFWEEK_OFS                            RTC_C_TIM1_DOW_OFS              /**< DayofWeek Offset */
//#define DAYOFWEEK_M                              RTC_C_TIM1_DOW_MASK             /**< Day of week (0 to 6) */
/* RTCDATE[DAY] Bits */
#define DAY_OFS                                  RTC_C_DATE_DAY_OFS              /**< Day Offset */
#define DAY_M                                    RTC_C_DATE_DAY_MASK             /**< Day of month (1 to 28, 29, 30, 31) */
/* RTCDATE[MONTH] Bits */
#define MONTH_OFS                                RTC_C_DATE_MON_OFS              /**< Month Offset */
#define MONTH_M                                  RTC_C_DATE_MON_MASK             /**< Month (1 to 12) */
/* RTCDATE_BCD[DAYLOWDIGIT] Bits */
#define DAYLOWDIGIT_OFS                          RTC_C_DATE_DAY_LD_OFS           /**< DayLowDigit Offset */
#define DAYLOWDIGIT_M                            RTC_C_DATE_DAY_LD_MASK          /**< Day of month ? low digit (0 to 9) */
/* RTCDATE_BCD[DAYHIGHDIGIT] Bits */
#define DAYHIGHDIGIT_OFS                         RTC_C_DATE_DAY_HD_OFS           /**< DayHighDigit Offset */
#define DAYHIGHDIGIT_M                           RTC_C_DATE_DAY_HD_MASK          /**< Day of month ? high digit (0 to 3) */
/* RTCDATE_BCD[MONTHLOWDIGIT] Bits */
#define MONTHLOWDIGIT_OFS                        RTC_C_DATE_MON_LD_OFS           /**< MonthLowDigit Offset */
#define MONTHLOWDIGIT_M                          RTC_C_DATE_MON_LD_MASK          /**< Month ? low digit (0 to 9) */
/* RTCDATE_BCD[MONTHHIGHDIGIT] Bits */
#define MONTHHIGHDIGIT_OFS                       RTC_C_DATE_MON_HD_OFS           /**< MonthHighDigit Offset */
#define MONTHHIGHDIGIT                           RTC_C_DATE_MON_HD               /**< Month ? high digit (0 or 1) */
/* RTCYEAR[YEARLOWBYTE] Bits */
#define YEARLOWBYTE_OFS                          RTC_C_YEAR_YEAR_LB_OFS          /**< YearLowByte Offset */
#define YEARLOWBYTE_M                            RTC_C_YEAR_YEAR_LB_MASK         /**< Year ? low byte. Valid values for Year are 0 to 4095. */
/* RTCYEAR[YEARHIGHBYTE] Bits */
#define YEARHIGHBYTE_OFS                         RTC_C_YEAR_YEAR_HB_OFS          /**< YearHighByte Offset */
#define YEARHIGHBYTE_M                           RTC_C_YEAR_YEAR_HB_MASK         /**< Year ? high byte. Valid values for Year are 0 to 4095. */
/* RTCYEAR_BCD[YEAR] Bits */
#define YEAR_OFS                                 RTC_C_YEAR_YEAR_OFS             /**< Year Offset */
#define YEAR_M                                   RTC_C_YEAR_YEAR_MASK            /**< Year ? lowest digit (0 to 9) */
/* RTCYEAR_BCD[DECADE] Bits */
#define DECADE_OFS                               RTC_C_YEAR_DEC_OFS              /**< Decade Offset */
#define DECADE_M                                 RTC_C_YEAR_DEC_MASK             /**< Decade (0 to 9) */
/* RTCYEAR_BCD[CENTURYLOWDIGIT] Bits */
#define CENTURYLOWDIGIT_OFS                      RTC_C_YEAR_CENT_LD_OFS          /**< CenturyLowDigit Offset */
#define CENTURYLOWDIGIT_M                        RTC_C_YEAR_CENT_LD_MASK         /**< Century ? low digit (0 to 9) */
/* RTCYEAR_BCD[CENTURYHIGHDIGIT] Bits */
#define CENTURYHIGHDIGIT_OFS                     RTC_C_YEAR_CENT_HD_OFS          /**< CenturyHighDigit Offset */
#define CENTURYHIGHDIGIT_M                       RTC_C_YEAR_CENT_HD_MASK         /**< Century ? high digit (0 to 4) */
/* RTCAMINHR[MINUTES] Bits */
//#define MINUTES_OFS                              RTC_C_AMINHR_MIN_OFS            /**< Minutes Offset */
//#define MINUTES_M                                RTC_C_AMINHR_MIN_MASK           /**< Minutes (0 to 59) */
/* RTCAMINHR[MINAE] Bits */
#define MINAE_OFS                                RTC_C_AMINHR_MINAE_OFS          /**< MINAE Offset */
