arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
#define MINAE                                    RTC_C_AMINHR_MINAE              /**< Alarm enable */
/* RTCAMINHR[HOURS] Bits */
//#define HOURS_OFS                                RTC_C_AMINHR_HOUR_OFS           /**< Hours Offset */
//#define HOURS_M                                  RTC_C_AMINHR_HOUR_MASK          /**< Hours (0 to 23) */
/* RTCAMINHR[HOURAE] Bits */
#define HOURAE_OFS                               RTC_C_AMINHR_HOURAE_OFS         /**< HOURAE Offset */
#define HOURAE                                   RTC_C_AMINHR_HOURAE             /**< Alarm enable */
/* RTCAMINHR_BCD[MINUTESLOWDIGIT] Bits */
//#define MINUTESLOWDIGIT_OFS                      RTC_C_AMINHR_MIN_LD_OFS         /**< MinutesLowDigit Offset */
//#define MINUTESLOWDIGIT_M                        RTC_C_AMINHR_MIN_LD_MASK        /**< Minutes ? low digit (0 to 9) */
/* RTCAMINHR_BCD[MINUTESHIGHDIGIT] Bits */
//#define MINUTESHIGHDIGIT_OFS                     RTC_C_AMINHR_MIN_HD_OFS         /**< MinutesHighDigit Offset */
//#define MINUTESHIGHDIGIT_M                       RTC_C_AMINHR_MIN_HD_MASK        /**< Minutes ? high digit (0 to 5) */
/* RTCAMINHR_BCD[MINAE] Bits */
//#define MINAE_OFS                                RTC_C_AMINHR__OFS               /**< MINAE Offset */
//#define MINAE                                    RTC_C_AMINHR_                   /**< Alarm enable */
/* RTCAMINHR_BCD[HOURSLOWDIGIT] Bits */
//#define HOURSLOWDIGIT_OFS                        RTC_C_AMINHR_HOUR_LD_OFS        /**< HoursLowDigit Offset */
//#define HOURSLOWDIGIT_M                          RTC_C_AMINHR_HOUR_LD_MASK       /**< Hours ? low digit (0 to 9) */
/* RTCAMINHR_BCD[HOURSHIGHDIGIT] Bits */
//#define HOURSHIGHDIGIT_OFS                       RTC_C_AMINHR_HOUR_HD_OFS        /**< HoursHighDigit Offset */
//#define HOURSHIGHDIGIT_M                         RTC_C_AMINHR_HOUR_HD_MASK       /**< Hours ? high digit (0 to 2) */
/* RTCAMINHR_BCD[HOURAE] Bits */
//#define HOURAE_OFS                               RTC_C_AMINHR_HOURAE_OFS         /**< HOURAE Offset */
//#define HOURAE                                   RTC_C_AMINHR_HOURAE             /**< Alarm enable */
/* RTCADOWDAY[DAYOFWEEK] Bits */
//#define DAYOFWEEK_OFS                            RTC_C_ADOWDAY_DOW_OFS           /**< DayofWeek Offset */
//#define DAYOFWEEK_M                              RTC_C_ADOWDAY_DOW_MASK          /**< Day of week (0 to 6) */
/* RTCADOWDAY[DOWAE] Bits */
#define DOWAE_OFS                                RTC_C_ADOWDAY_DOWAE_OFS         /**< DOWAE Offset */
#define DOWAE                                    RTC_C_ADOWDAY_DOWAE             /**< Alarm enable */
/* RTCADOWDAY[DAYOFMONTH] Bits */
#define DAYOFMONTH_OFS                           RTC_C_ADOWDAY_DAY_OFS           /**< DayofMonth Offset */
#define DAYOFMONTH_M                             RTC_C_ADOWDAY_DAY_MASK          /**< Day of month (1 to 28, 29, 30, 31) */
/* RTCADOWDAY[DAYAE] Bits */
#define DAYAE_OFS                                RTC_C_ADOWDAY_DAYAE_OFS         /**< DAYAE Offset */
#define DAYAE                                    RTC_C_ADOWDAY_DAYAE             /**< Alarm enable */
/* RTCADOWDAY_BCD[DAYOFWEEK] Bits */
//#define DAYOFWEEK_OFS                            RTC_C_ADOWDAY_DOW_OFS           /**< DayofWeek Offset */
//#define DAYOFWEEK_M                              RTC_C_ADOWDAY_DOW_MASK          /**< Day of week (0 to 6) */
/* RTCADOWDAY_BCD[DOWAE] Bits */
//#define DOWAE_OFS                                RTC_C_ADOWDAY_DOWAE_OFS         /**< DOWAE Offset */
//#define DOWAE                                    RTC_C_ADOWDAY_DOWAE             /**< Alarm enable */
/* RTCADOWDAY_BCD[DAYLOWDIGIT] Bits */
//#define DAYLOWDIGIT_OFS                          RTC_C_ADOWDAY_DAY_LD_OFS        /**< DayLowDigit Offset */
//#define DAYLOWDIGIT_M                            RTC_C_ADOWDAY_DAY_LD_MASK       /**< Day of month ? low digit (0 to 9) */
/* RTCADOWDAY_BCD[DAYHIGHDIGIT] Bits */
//#define DAYHIGHDIGIT_OFS                         RTC_C_ADOWDAY_DAY_HD_OFS        /**< DayHighDigit Offset */
//#define DAYHIGHDIGIT_M                           RTC_C_ADOWDAY_DAY_HD_MASK       /**< Day of month ? high digit (0 to 3) */
/* RTCADOWDAY_BCD[DAYAE] Bits */
//#define DAYAE_OFS                                RTC_C_ADOWDAY_DAYAE_OFS         /**< DAYAE Offset */
//#define DAYAE                                    RTC_C_ADOWDAY_DAYAE             /**< Alarm enable */

/* Pre-defined bitfield values */
#define RTCKEY                                             RTC_C_KEY              /* RTC_C Key Value for RTC_C write access */
#define RTCKEY_H                                           RTC_C_KEY_H            /* RTC_C Key Value for RTC_C write access */
#define RTCKEY_VAL                                         RTC_C_KEY_VAL          /* RTC_C Key Value for RTC_C write access */


/******************************************************************************
* Timer_A Bits (legacy section)
******************************************************************************/
/* TA0CTL[TAIFG] Bits */
#define TAIFG_OFS                                TIMER_A_CTL_IFG_OFS             /**< TAIFG Offset */
#define TAIFG                                    TIMER_A_CTL_IFG                 /**< TimerA interrupt flag */
/* TA0CTL[TAIE] Bits */
#define TAIE_OFS                                 TIMER_A_CTL_IE_OFS              /**< TAIE Offset */
#define TAIE                                     TIMER_A_CTL_IE                  /**< TimerA interrupt enable */
/* TA0CTL[TACLR] Bits */
#define TACLR_OFS                                TIMER_A_CTL_CLR_OFS             /**< TACLR Offset */
#define TACLR                                    TIMER_A_CTL_CLR                 /**< TimerA clear */
/* TA0CTL[MC] Bits */
#define MC_OFS                                   TIMER_A_CTL_MC_OFS              /**< MC Offset */
#define MC_M                                     TIMER_A_CTL_MC_MASK             /**< Mode control */
#define MC0                                      TIMER_A_CTL_MC0                 /**< MC Bit 0 */
#define MC1                                      TIMER_A_CTL_MC1                 /**< MC Bit 1 */
#define MC_0                                     TIMER_A_CTL_MC_0                /**< Stop mode: Timer is halted */
#define MC_1                                     TIMER_A_CTL_MC_1                /**< Up mode: Timer counts up to TAxCCR0 */
#define MC_2                                     TIMER_A_CTL_MC_2                /**< Continuous mode: Timer counts up to 0FFFFh */
#define MC_3                                     TIMER_A_CTL_MC_3                /**< Up/down mode: Timer counts up to TAxCCR0 then down to 0000h */
#define MC__STOP                                 TIMER_A_CTL_MC__STOP            /**< Stop mode: Timer is halted */
#define MC__UP                                   TIMER_A_CTL_MC__UP              /**< Up mode: Timer counts up to TAxCCR0 */
#define MC__CONTINUOUS                           TIMER_A_CTL_MC__CONTINUOUS      /**< Continuous mode: Timer counts up to 0FFFFh */
#define MC__UPDOWN                               TIMER_A_CTL_MC__UPDOWN          /**< Up/down mode: Timer counts up to TAxCCR0 then down to 0000h */
/* TA0CTL[ID] Bits */
#define ID_OFS                                   TIMER_A_CTL_ID_OFS              /**< ID Offset */
#define ID_M                                     TIMER_A_CTL_ID_MASK             /**< Input divider */
#define ID0                                      TIMER_A_CTL_ID0                 /**< ID Bit 0 */
#define ID1                                      TIMER_A_CTL_ID1                 /**< ID Bit 1 */
#define ID_0                                     TIMER_A_CTL_ID_0                /**< /1 */
#define ID_1                                     TIMER_A_CTL_ID_1                /**< /2 */
#define ID_2                                     TIMER_A_CTL_ID_2                /**< /4 */
#define ID_3                                     TIMER_A_CTL_ID_3                /**< /8 */
#define ID__1                                    TIMER_A_CTL_ID__1               /**< /1 */
#define ID__2                                    TIMER_A_CTL_ID__2               /**< /2 */
#define ID__4                                    TIMER_A_CTL_ID__4               /**< /4 */
#define ID__8                                    TIMER_A_CTL_ID__8               /**< /8 */
/* TA0CTL[TASSEL] Bits */
#define TASSEL_OFS                               TIMER_A_CTL_SSEL_OFS            /**< TASSEL Offset */
#define TASSEL_M                                 TIMER_A_CTL_SSEL_MASK           /**< TimerA clock source select */
#define TASSEL0                                  TIMER_A_CTL_SSEL0               /**< TASSEL Bit 0 */
#define TASSEL1                                  TIMER_A_CTL_SSEL1               /**< TASSEL Bit 1 */
#define TASSEL_0                                 TIMER_A_CTL_TASSEL_0            /**< TAxCLK */
#define TASSEL_1                                 TIMER_A_CTL_TASSEL_1            /**< ACLK */
#define TASSEL_2                                 TIMER_A_CTL_TASSEL_2            /**< SMCLK */
#define TASSEL_3                                 TIMER_A_CTL_TASSEL_3            /**< INCLK */
#define TASSEL__TACLK                            TIMER_A_CTL_SSEL__TACLK         /**< TAxCLK */
#define TASSEL__ACLK                             TIMER_A_CTL_SSEL__ACLK          /**< ACLK */
#define TASSEL__SMCLK                            TIMER_A_CTL_SSEL__SMCLK         /**< SMCLK */
#define TASSEL__INCLK                            TIMER_A_CTL_SSEL__INCLK         /**< INCLK */
/* TA0CCTLN[CCIFG] Bits */
#define CCIFG_OFS                                TIMER_A_CCTLN_CCIFG_OFS         /**< CCIFG Offset */
#define CCIFG                                    TIMER_A_CCTLN_CCIFG             /**< Capture/compare interrupt flag */
/* TA0CCTLN[COV] Bits */
#define COV_OFS                                  TIMER_A_CCTLN_COV_OFS           /**< COV Offset */
#define COV                                      TIMER_A_CCTLN_COV               /**< Capture overflow */
/* TA0CCTLN[OUT] Bits */
//#define OUT_OFS                                  TIMER_A_CCTLN_OUT_OFS           /**< OUT Offset */
//#define OUT                                      TIMER_A_CCTLN_OUT               /**< Output */
/* TA0CCTLN[CCI] Bits */
#define CCI_OFS                                  TIMER_A_CCTLN_CCI_OFS           /**< CCI Offset */
#define CCI                                      TIMER_A_CCTLN_CCI               /**< Capture/compare input */
/* TA0CCTLN[CCIE] Bits */
#define CCIE_OFS                                 TIMER_A_CCTLN_CCIE_OFS          /**< CCIE Offset */
#define CCIE                                     TIMER_A_CCTLN_CCIE              /**< Capture/compare interrupt enable */
/* TA0CCTLN[OUTMOD] Bits */
#define OUTMOD_OFS                               TIMER_A_CCTLN_OUTMOD_OFS        /**< OUTMOD Offset */
#define OUTMOD_M                                 TIMER_A_CCTLN_OUTMOD_MASK       /**< Output mode */
#define OUTMOD0                                  TIMER_A_CCTLN_OUTMOD0           /**< OUTMOD Bit 0 */
#define OUTMOD1                                  TIMER_A_CCTLN_OUTMOD1           /**< OUTMOD Bit 1 */
#define OUTMOD2                                  TIMER_A_CCTLN_OUTMOD2           /**< OUTMOD Bit 2 */
#define OUTMOD_0                                 TIMER_A_CCTLN_OUTMOD_0          /**< OUT bit value */
#define OUTMOD_1                                 TIMER_A_CCTLN_OUTMOD_1          /**< Set */
#define OUTMOD_2                                 TIMER_A_CCTLN_OUTMOD_2          /**< Toggle/reset */
#define OUTMOD_3                                 TIMER_A_CCTLN_OUTMOD_3          /**< Set/reset */
#define OUTMOD_4                                 TIMER_A_CCTLN_OUTMOD_4          /**< Toggle */
#define OUTMOD_5                                 TIMER_A_CCTLN_OUTMOD_5          /**< Reset */
#define OUTMOD_6                                 TIMER_A_CCTLN_OUTMOD_6          /**< Toggle/set */
#define OUTMOD_7                                 TIMER_A_CCTLN_OUTMOD_7          /**< Reset/set */
/* TA0CCTLN[CAP] Bits */
#define CAP_OFS                                  TIMER_A_CCTLN_CAP_OFS           /**< CAP Offset */
#define CAP                                      TIMER_A_CCTLN_CAP               /**< Capture mode */
/* TA0CCTLN[SCCI] Bits */
#define SCCI_OFS                                 TIMER_A_CCTLN_SCCI_OFS          /**< SCCI Offset */
#define SCCI                                     TIMER_A_CCTLN_SCCI              /**< Synchronized capture/compare input */
/* TA0CCTLN[SCS] Bits */
#define SCS_OFS                                  TIMER_A_CCTLN_SCS_OFS           /**< SCS Offset */
#define SCS                                      TIMER_A_CCTLN_SCS               /**< Synchronize capture source */
/* TA0CCTLN[CCIS] Bits */
#define CCIS_OFS                                 TIMER_A_CCTLN_CCIS_OFS          /**< CCIS Offset */
#define CCIS_M                                   TIMER_A_CCTLN_CCIS_MASK         /**< Capture/compare input select */
#define CCIS0                                    TIMER_A_CCTLN_CCIS0             /**< CCIS Bit 0 */
#define CCIS1                                    TIMER_A_CCTLN_CCIS1             /**< CCIS Bit 1 */
#define CCIS_0                                   TIMER_A_CCTLN_CCIS_0            /**< CCIxA */
#define CCIS_1                                   TIMER_A_CCTLN_CCIS_1            /**< CCIxB */
#define CCIS_2                                   TIMER_A_CCTLN_CCIS_2            /**< GND */
#define CCIS_3                                   TIMER_A_CCTLN_CCIS_3            /**< VCC */
#define CCIS__CCIA                               TIMER_A_CCTLN_CCIS__CCIA        /**< CCIxA */
#define CCIS__CCIB                               TIMER_A_CCTLN_CCIS__CCIB        /**< CCIxB */
#define CCIS__GND                                TIMER_A_CCTLN_CCIS__GND         /**< GND */
#define CCIS__VCC                                TIMER_A_CCTLN_CCIS__VCC         /**< VCC */
/* TA0CCTLN[CM] Bits */
#define CM_OFS                                   TIMER_A_CCTLN_CM_OFS            /**< CM Offset */
#define CM_M                                     TIMER_A_CCTLN_CM_MASK           /**< Capture mode */
#define CM0                                      TIMER_A_CCTLN_CM0               /**< CM Bit 0 */
#define CM1                                      TIMER_A_CCTLN_CM1               /**< CM Bit 1 */
#define CM_0                                     TIMER_A_CCTLN_CM_0              /**< No capture */
#define CM_1                                     TIMER_A_CCTLN_CM_1              /**< Capture on rising edge */
#define CM_2                                     TIMER_A_CCTLN_CM_2              /**< Capture on falling edge */
#define CM_3                                     TIMER_A_CCTLN_CM_3              /**< Capture on both rising and falling edges */
#define CM__NONE                                 TIMER_A_CCTLN_CM__NONE          /**< No capture */
#define CM__RISING                               TIMER_A_CCTLN_CM__RISING        /**< Capture on rising edge */
#define CM__FALLING                              TIMER_A_CCTLN_CM__FALLING       /**< Capture on falling edge */
#define CM__BOTH                                 TIMER_A_CCTLN_CM__BOTH          /**< Capture on both rising and falling edges */
/* TA0EX0[TAIDEX] Bits */
#define TAIDEX_OFS                               TIMER_A_EX0_IDEX_OFS            /**< TAIDEX Offset */
#define TAIDEX_M                                 TIMER_A_EX0_IDEX_MASK           /**< Input divider expansion */
#define TAIDEX0                                  TIMER_A_EX0_IDEX0               /**< TAIDEX Bit 0 */
#define TAIDEX1                                  TIMER_A_EX0_IDEX1               /**< TAIDEX Bit 1 */
#define TAIDEX2                                  TIMER_A_EX0_IDEX2               /**< TAIDEX Bit 2 */
#define TAIDEX_0                                 TIMER_A_EX0_TAIDEX_0            /**< Divide by 1 */
#define TAIDEX_1                                 TIMER_A_EX0_TAIDEX_1            /**< Divide by 2 */
#define TAIDEX_2                                 TIMER_A_EX0_TAIDEX_2            /**< Divide by 3 */
#define TAIDEX_3                                 TIMER_A_EX0_TAIDEX_3            /**< Divide by 4 */
#define TAIDEX_4                                 TIMER_A_EX0_TAIDEX_4            /**< Divide by 5 */
#define TAIDEX_5                                 TIMER_A_EX0_TAIDEX_5            /**< Divide by 6 */
#define TAIDEX_6                                 TIMER_A_EX0_TAIDEX_6            /**< Divide by 7 */
#define TAIDEX_7                                 TIMER_A_EX0_TAIDEX_7            /**< Divide by 8 */
#define TAIDEX__1                                TIMER_A_EX0_IDEX__1             /**< Divide by 1 */
#define TAIDEX__2                                TIMER_A_EX0_IDEX__2             /**< Divide by 2 */
#define TAIDEX__3                                TIMER_A_EX0_IDEX__3             /**< Divide by 3 */
#define TAIDEX__4                                TIMER_A_EX0_IDEX__4             /**< Divide by 4 */
#define TAIDEX__5                                TIMER_A_EX0_IDEX__5             /**< Divide by 5 */
#define TAIDEX__6                                TIMER_A_EX0_IDEX__6             /**< Divide by 6 */
#define TAIDEX__7                                TIMER_A_EX0_IDEX__7             /**< Divide by 7 */
#define TAIDEX__8                                TIMER_A_EX0_IDEX__8             /**< Divide by 8 */


