arduino/Arduino/hardware/msp432/cores/msp432/inc/msp432p401r_classic.h
/******************************************************************************
* WDT_A Bits (legacy section)
******************************************************************************/
/* WDTCTL[WDTIS] Bits */
#define WDTIS_OFS                                WDT_A_CTL_IS_OFS                /**< WDTIS Offset */
#define WDTIS_M                                  WDT_A_CTL_IS_MASK               /**< Watchdog timer interval select */
#define WDTIS0                                   WDT_A_CTL_IS0                   /**< WDTIS Bit 0 */
#define WDTIS1                                   WDT_A_CTL_IS1                   /**< WDTIS Bit 1 */
#define WDTIS2                                   WDT_A_CTL_IS2                   /**< WDTIS Bit 2 */
#define WDTIS_0                                  WDT_A_CTL_IS_0                  /**< Watchdog clock source / (2^(31)) (18:12:16 at 32.768 kHz) */
#define WDTIS_1                                  WDT_A_CTL_IS_1                  /**< Watchdog clock source /(2^(27)) (01:08:16 at 32.768 kHz) */
#define WDTIS_2                                  WDT_A_CTL_IS_2                  /**< Watchdog clock source /(2^(23)) (00:04:16 at 32.768 kHz) */
#define WDTIS_3                                  WDT_A_CTL_IS_3                  /**< Watchdog clock source /(2^(19)) (00:00:16 at 32.768 kHz) */
#define WDTIS_4                                  WDT_A_CTL_IS_4                  /**< Watchdog clock source /(2^(15)) (1 s at 32.768 kHz) */
#define WDTIS_5                                  WDT_A_CTL_IS_5                  /**< Watchdog clock source / (2^(13)) (250 ms at 32.768 kHz) */
#define WDTIS_6                                  WDT_A_CTL_IS_6                  /**< Watchdog clock source / (2^(9)) (15.625 ms at 32.768 kHz) */
#define WDTIS_7                                  WDT_A_CTL_IS_7                  /**< Watchdog clock source / (2^(6)) (1.95 ms at 32.768 kHz) */
/* WDTCTL[WDTCNTCL] Bits */
#define WDTCNTCL_OFS                             WDT_A_CTL_CNTCL_OFS             /**< WDTCNTCL Offset */
#define WDTCNTCL                                 WDT_A_CTL_CNTCL                 /**< Watchdog timer counter clear */
/* WDTCTL[WDTTMSEL] Bits */
#define WDTTMSEL_OFS                             WDT_A_CTL_TMSEL_OFS             /**< WDTTMSEL Offset */
#define WDTTMSEL                                 WDT_A_CTL_TMSEL                 /**< Watchdog timer mode select */
/* WDTCTL[WDTSSEL] Bits */
#define WDTSSEL_OFS                              WDT_A_CTL_SSEL_OFS              /**< WDTSSEL Offset */
#define WDTSSEL_M                                WDT_A_CTL_SSEL_MASK             /**< Watchdog timer clock source select */
#define WDTSSEL0                                 WDT_A_CTL_SSEL0                 /**< WDTSSEL Bit 0 */
#define WDTSSEL1                                 WDT_A_CTL_SSEL1                 /**< WDTSSEL Bit 1 */
#define WDTSSEL_0                                WDT_A_CTL_SSEL_0                /**< SMCLK */
#define WDTSSEL_1                                WDT_A_CTL_SSEL_1                /**< ACLK */
#define WDTSSEL_2                                WDT_A_CTL_SSEL_2                /**< VLOCLK */
#define WDTSSEL_3                                WDT_A_CTL_SSEL_3                /**< BCLK */
#define WDTSSEL__SMCLK                           WDT_A_CTL_SSEL__SMCLK           /**< SMCLK */
#define WDTSSEL__ACLK                            WDT_A_CTL_SSEL__ACLK            /**< ACLK */
#define WDTSSEL__VLOCLK                          WDT_A_CTL_SSEL__VLOCLK          /**< VLOCLK */
#define WDTSSEL__BCLK                            WDT_A_CTL_SSEL__BCLK            /**< BCLK */
/* WDTCTL[WDTHOLD] Bits */
#define WDTHOLD_OFS                              WDT_A_CTL_HOLD_OFS              /**< WDTHOLD Offset */
#define WDTHOLD                                  WDT_A_CTL_HOLD                  /**< Watchdog timer hold */
/* WDTCTL[WDTPW] Bits */
#define WDTPW_OFS                                WDT_A_CTL_PW_OFS                /**< WDTPW Offset */
#define WDTPW_M                                  WDT_A_CTL_PW_MASK               /**< Watchdog timer password */

/* Pre-defined bitfield values */
#define WDTPW                                          WDT_A_CTL_PW              /* WDT Key Value for WDT write access */


#ifdef __cplusplus
}
#endif

#endif /* __MSP432P401R_CLASSIC_H__ */
